from adjective import adjective
from noun.create_noun_basic import create_all_basic_noun_forms
from noun import noun
if __name__ == '__main__':
    # res = adjective.create_all('ωραίος')
    # print(res)

    words = ('άνθρωπος', 'αρχαιολόγος', 'ψήφος', 'νηπιαγογός', 'υπολογιστής', 'ταξιτζής', 'δάσος', 'σκέλος', 'αναπτήρας', 'βασιλιάς',
             'βασιλεύς', 'συγγραφέας', 'μηχανή', 'πόλη', 'κατάσταση', 'λέξη', 'βραδιά', 'δολάριο', 'θέατρο', 'ευρώ', 'βιβλίο', 'παιδί',
             'τραπέζι', 'μάθημα', 'ρήμα', 'γράψιμο', 'άστυ', 'Κυριακή', 'Χριστούγεννα', 'προπόδες', 'αλεπού', 'αγώνας', 'ταμίας', 'φύλακας',
             'ψαράς', 'ρήγας', 'ναύτης', 'μαθητής', 'φούρναρης', 'μανάβης', 'παπουτσής', 'δουλευτής', 'συγγενής',
             'καφές', 'αντίλαλος', 'άνεμος', 'διάμετρος', 'Φρόσω', 'κυρά', 'κρέας', 'φως', 'γάλα', 'φωνήεν', 'καθήκον',
             'καθεστώς', 'δάκρυ', 'γεγονός', 'οξύ', 'ον', 'Ζευς', 'βρώμα', 'κου', 'περίπλους')
    for word in words:
        res = noun.create_all(word)
        print(res)