
irregular_passive_perfect_participles = {'αγανακτώ': 'αγανακτισμένος', 'αποτυχαίνω': 'αποτυχημένος', 'αγαπάω': 'αγαπημένος', 'αγωνίζομαι': 'αγωνισμένος', 'δυστυχώ': 'δυστυχισμένος', 'ευτυχώ': 'ευτυχισμένος', 'θυμώνω': 'θυμωμένος', 'αγοράζω': 'αγορασμένος', 'αφαιρώ': 'αφηρημένος', 'αισθάνομαι': 'αισθαμένος', 'ακολουθώ': 'ακολουθημένος', 'ακούω': 'ακουσμένος', 'αλλάζω': 'αλλαγμένος', 'ανάβω': 'αναμμένος', 'αναγκάζω': 'αναγκασμένος', 'ανήκω': None, 'δίνω': 'δοσμένος', 'κάθομαι': 'καθισμένος', 'καίω': 'καμένος', 'κλαίω': 'κλαμένος', 'προβάλλω': 'προβεβλημένος,προβλημένος', 'τρώω': 'φαγωμένος', 'στρέφω': 'στραμμένος', 'ανοίγω': 'ανοιγμένος',  'αξίζω': None, 'απαγορεύω': 'απαγορευμένος', 'απαντάω': 'απαντημένος', 'αποκτώ': 'αποκτημένος', 'απορώ': None, 'αποτελούμαι': 'αποτελεσμένος', 'αποφασίζω': 'αποφασισμένος', 'αργώ': None, 'αρέσω': None, 'βρέχω': 'βρεγμένος', 'αρχίζω': None, 'αστειεύομαι': None, 'αφήνω': 'αφημένος', 'βάζω': 'βαλμένος', 'βάφω': 'βαμμένος', 'βαριέμαι': 'βαρεμένος', 'βγάζω': 'βγαλμένος', 'βγαίνω': None, 'βιάζομαι': 'βιασμένος', 'βλέπω': 'ιδωμένος', 'βοηθάω': 'βοηθημένος', 'βρίσκω': None, 'βράζω': 'βρασμένος', 'γδύνω': 'γδυμένος', 'γελάω': 'γελασμένος', 'γεμίζω': 'γεμισμένος', 'γεννάω': 'γεννημένος', 'γίνομαι': 'γινωμένος', 'γκρινιάζω': None, 'γράφω': 'γραμμένος', 'γυρίζω': 'γυρισμένος', 'δανείζω': 'δανεισμένος', 'δείχνω': 'δειγμένος', 'δένω': 'δεμένος', 'δέχομαι': 'δεχτός, δεκτός', 'διαβάζω': 'διαβασμένος', 'διαλέγω': 'διαλεγμένος', 'διαμαρτύρομαι': 'διαμαρτυρημένος', 'διαφωνώ': None, 'διηγούμαι': 'διηγημένος', 'διορθώνω': 'διορθωμένος', 'διψάω': 'διψασμένος', 'διώχνω': 'διωγμένος', 'δοκιμάζω': 'δοκιμασμένος', 'δουλεύω': None, 'είμαι': None, 'εκφράζω': 'εκφρασμένος', 'ελπίζω': None, 'εμφανίζομαι': 'εμφανισμένος', 'ενδιαφέρομαι': None, 'εξηγώ': 'εξηγημένος', 'εξαφανίζομαι': 'εξαφανισμένος', 'επηρεάζω': 'επηρεασμένος', 'επιτρέπω': 'επιτετραμμένος', 'έρχομαι': None, 'ετοιμάζω': 'ετοιμασμένος', 'εύχομαι': None, 'έχω': None, 'ζεσταίνω': 'ζεσταμένος', 'ζηλεύω': 'ζηλεμένος', 'ζητάω': 'ζητημένος', 'ζω': 'βιωμένος', 'θέλω': None, 'θυμάμαι': 'θυμημένος', 'καθαρίζω': 'καθαρισμένος', 'καλώ': 'καλεσμένος', 'καπνίζω': None, 'καταλαβαίνω': None, 'καταστρέφω': 'κατεστραμμένος', 'κατεβάζω': 'κατεβασμένος', 'κατεβαίνω': None, 'κερνάω': 'κερασμένος', 'κλείνω': 'κλεισμένος', 'κόβω': 'κομμένος', 'κοιμάμαι': 'κοιμισμένος', 'κοιτάζω': 'κοιταγμένος', 'κουράζω': 'κουρασμένος', 'κρατάω': 'κρατημένος', 'κρύβω': 'κρυμμένος', 'λέω': 'ειπωμένος', 'λείπω': None, 'λύνω': 'λυμένος', 'λυπάμαι': 'λυπημένος', 'μαγειρεύω': 'μαγειρεμένος', 'μαζεύω': 'μαζεμένος', 'μαθαίνω': 'μαθημένος', 'μιμούμαι': None, 'μένω': None, 'μοιάζω': None, 'μοιράζω': 'μοιρασμένος', 'μπαίνω': None, 'μπορώ': None, 'νικάω': 'νικημένος', 'νοιάζομαι': 'νοιασμένος', 'νομίζω': None, 'ντρέπομαι': None, 'ντύνω': 'ντυμένος', 'ξαπλώνω': 'ξαπλωμένος', 'ξεκινάω': 'ξεκινημένος', 'ξέρω': None, 'ξεχνάω': 'ξεχασμένος', 'ξυπνάω': 'ξυπνημένος', 'ξυρίζω': 'ξυρισμένος', 'οδηγώ': 'οδηγημένος', 'ονειρεύομαι': 'ονειρεμένος', 'ονομάζω': 'ονομασμένος', 'οφείλω': None, 'παθαίνω': 'πεθαμένος', 'παίζω': None, 'παίρνω': 'παρμένος', 'παντρεύομαι': 'παντρεμένος', 'παραγγέλνω': None, 'παραπονιέμαι': 'παραπονεμένος', 'παριστάνω': None, 'πεθαίνω': 'παθημένος', 'πείθω': 'πεπεισμένος', 'πεινάω': 'πεινασμένος', 'περιμένω': None, 'περνάω': 'περασμένος', 'περπατάω': 'περπατημένος', 'πετυχαίνω': 'πετυχημένος', 'πετάω': 'πεταγμένος', 'πέφτω': 'πεσμένος', 'πηγαίνω': None, 'πιάνω': 'πιασμένος', 'πιέζω': 'πιεσμένος', 'πίνω': 'πιωμένος', 'πιστεύω': None, 'πλένω': 'πλυμένος', 'πληρώνω': 'πληρωμένος', 'πονάω': 'πονεμένος', 'πουλάω': 'πουλημένος', 'πρέπει': None, 'πρόκειται': None, 'προκύπτω': None, 'προσθέτω': 'προστεθειμένος', 'προσέχω': None, 'προσποιούμαι': 'προσποιημένος', 'προτείνω': 'προτεταμένος', 'προτιμάω': 'προτιμημένος', 'ράβω': 'ραμμένος', 'ρίχνω': 'ριγμένος', 'ρωτάω': 'ρωτημένος', 'σβήνω': 'σβησμένος', 'σέβομαι': 'σεβασμένος', 'σηκώνω': 'σηκωμένος', 'σημαίνω': None, 'σκεπάζω': 'σκεπασμένος', 'σκέφτομαι': None, 'σκοτώνω': 'σκοτωμένος', 'σκουπίζω': 'σκουπισμένος', 'σπουδάζω': 'σπουδασμένος', 'στέλνω': 'σταλμένος', 'στενοχωριέμαι': 'στενοχωρημένος', 'συμμετέχω': None, 'συμπεριφέρομαι': None, 'συμφωνώ': 'συμφωνημένος', 'στηρίζω': 'στηριγμένος', 'συνηθίζω': 'συνηθισμένος', 'συστήνω': 'συστημένος', 'σώζω': 'σωσμένος', 'ταξιδεύω': None, 'τρελαίνομαι': 'τρελαμένος', 'τρέχω': None, 'υπάρχω': None, 'υποπτεύομαι': None, 'υπόσχομαι': 'υποσχεμένος', 'υποφέρω': 'υποσχεμένος', 'υποψιάζομαι': 'υποψιασμένος', 'φαίνομαι': None, 'φαντάζομαι': 'φαντασμένος', 'φέρνω': 'φερμένος', 'φεύγω': None, 'φοβάμαι': None, 'φοράω': 'φορεμένος', 'φταίω': 'φοβημένος', 'φτάνω': None, 'φτιάχνω': 'φτιαγμένος', 'φωνάζω': None, 'χαίρομαι': 'χαρούμενος', 'χαλάω': None, 'χάνω': 'χαμένος', 'χρειάζομαι': None, 'χρησιμοποιώ': 'χρησιμοποιημένος', 'χρωστάω': None, 'χτυπάω': 'χτυπημένος', 'χωράω': None, 'ψάχνω': 'ψαγμένος', 'ωφελώ': 'ωφελημένος'}

irregular_active_roots = \
    [['ανεβαίν', 'ανέβ,ανεβ'], ['κατεβαίν', 'κατέβ,κατεβ'], ['βάλλ', 'βάλ'], ['λαμβάν', 'λάβ'], ['βάζ', 'βάσ'], ['βάζ', 'βάλ'], ['βγάζ', 'βγάλ'], ['λαβαίν', 'λάβ'], ['αγγέλν','αγγείλ'], ['αγγέλλ', 'αγγείλ'], ['στάν', 'στήσ'], ['σταίν', 'στήσ'], ['πίπτ', 'πέσ'], ['φέρν', 'φέρ'], ['φεύγ','φύγ'], ['άγ', 'αγάγ'], ['γέρν', 'γεράσ'], ['πάσχ', 'πάθ'], ['σέρν', 'σύρ'], ['τέμν', 'τμήσ'], ['εφιστ', 'επιστήσ'], ['καθιστ', 'καταστήσ'], ['λανθάν', 'λάθ'], ['λαγχάνω', 'λάχ'], ['λαχαίν', 'λάχ'], ['αίρν', 'άρ'], ['αίρ', 'άρ'], ['δίν', 'δώσ'], ['δίδ', 'δώσ'], ['μέν', 'μείν'], ['στέλν', 'στείλ'], ['στέλλ', 'στείλ'], ['πλέν', 'πλύν'], ['βαίν', 'β'], ['βγαίν', 'βγ'], ['αυξάν', 'αυξήσ'], ['μεθ', 'μεθύσ'], ['σπέρν', 'σπείρ'], ['αλίσκ', 'αλώσ'], ['μπαίν', 'μπ'], ['μην', 'μηνύσ'], ['πλέ', 'πλεύσ'], ['πνέ', 'πνεύσ'], ['ρέ', 'ρεύσ'], ['βρίσκ', 'βρ'], ['πίν', 'πι'], ['τρώ', 'φά'], ['λέ', 'π'], ['λέγ', 'π,λέξ'], ['τρώγ', 'φάγ'], ['δέρν', 'δείρ'], ['κλίν', 'κλίν'], ['κάν', 'κάν'], ['μαθαίν', 'μάθ'], ['παθαίν', 'πάθ'],  ['πεθαίν', 'πεθάν'], ['βλέπ', 'δ,ιδ'], ['θνήσκ', 'θάν'], ['τείν', 'τείν'], ['πέφτ', 'πέσ'], ['πέπτ', 'πέσ'], ['πηγαίν', 'πά'], ['τυχαίν', 'τύχ'], ['πετυχαίν', 'πετύχ'], ['τυγχάν', 'τύχ'], ['άσχ', 'ασχέσ'], ['τρέφ', 'θρέψ'], ['ελαύν', 'ελάσ'], ['κρέμ', 'κρεμάσ'], ['ευρίσκ', 'εύρ'], ['έχ', 'άσχ'], ['έλκ', 'έλκυσ'], ['θαρρ', 'θαρρέψ'], ['χέ', 'χύσ'], ['νιστ', 'στήσ'], ['ιστάν', 'αστήσ'], ['δεικνύ', 'δείξ'], ['μειγνύ', 'μείξ'], ['ρηγνύ', 'ρήξ'], ['γιγνώσκ', 'γνώσ'], ['πηγνύ', 'πήξ'], ['τρώ', 'φά,φάγ'], ['τρώγ', 'φά,φάγ']]

irregular_passive_roots = \
    [['βάλλ', 'βληθ'], ['βάζ', 'βαλθ'], ['βγάζ', 'βγαλθ'], ['λαμβάν', 'ληφθ'], ['λαβαίν', 'ληφθ'], ['ρήγνυ', 'ραγ,ρηχθ'], ['ρηγνύ', 'ραγ,ρηχθ'], ['αίρν', 'αρθ'], ['γράφ', 'γραφ,γραφτ'], ['αίρ', 'αρθ'], ['δέρν', 'δαρθ'], ['άσχ', 'ασχεθ'], ['καλ', 'κληθ'], ['εύχ', 'ευχηθ'], ['δίν', 'δοθ'], ['δίδ', 'δοθ'],['υπόσχ', 'υποσχεθ'], ['κόπτ', 'κοπ'], ['κόβ', 'κοπ'], ['ακού', 'ακουστ'], ['στέλν', 'σταλθ,σταλ'], ['στέλλ', 'σταλθ,σταλ'], ['πλέν', 'πλυθ'], ['έρχ', 'έλθ,έρθ,`ρθ,`λθ'], ['κάθ', 'καθίσ,κάτσ'], ['γίν', 'γίν'], ['καί', 'κα'], ['στέκ', 'σταθ'], ['στήν', 'σταθ'], ['οφείλ', 'οφεληθ'], ['πνίγ', 'πνιγ,πνιχτ'], ['θέτ', 'τεθ'], ['βλέπ','ιδωθ'], ['λέγ', 'ειπωθ,ιπωθ,λεγ'], ['τείν', 'ταθ'], ['φαίν', 'φαν'], ['σέρν', 'συρθ'], ['αυξάν', 'αυξηθ'], ['σπέρν', 'σπαρθ'], ['αλίσκ', 'αλωθ'], ['τρέφ', 'τραφ'], ['τέμν', 'τμηθ'], ['κρέμ', 'κρεμαστ'], ['βρίσκ', 'βρεθ'], ['τρώ', 'φαγωθ'], ['λέ', 'ειπωθ'], ['τρώγ', 'φαγωθ'], ['αφήν', 'αφεθ'], ['τρέπ', 'τραπ'], ['στρέφ', 'στραφ'], ['τίθε', 'τεθ'], ['προτίθε', 'προτεθ'], ['σέβ', 'σεβαστ'], ['χαίρ', 'χαρ'], ['λέγ', 'λεγ'], ['επαφίε', 'επαφεθ'], ['ρήγνυ', 'ραγ'], ['ίστ', 'αστ'], ['θίστ', 'ταστ'], ['έλκ', 'ελκυστ'], ['χέ', 'χυσθ'], ['νιστ', 'σταθ'], ['ελαύν', 'ελαθ'], ['ιστάν', 'ασταθ'], ['δεικνύ', 'δειχθ'], ['δείκνυ', 'δειχθ'], ['μειγνύ', 'μειχθ'], ['γιγνώσκ', 'γνωσθ'], ['πηγνύ', 'παγ'], ['ενδείκνυ', 'ενδειχθ'], ['ευρίσκ', 'ευρεθ'], ['τρώ', 'φαγωθ'], ['τρώγ', 'φαγωθ']]

irregular_imperative_forms = {
    'σηκωθ': {'sg': {'sec': 'σήκω'}},
    'ακού': {'sg': {'sec': 'άκου'}},
    'ακούσ': {'sg': {'sec': 'άκου'}},
    'ανεβ': {'sg': {'sec': 'ανέβα'}},
    'κατεβ': {'sg': {'sec': 'κατέβα'}},
    "φύγ": {'sg': {'sec': 'φεύγα'}, 'pl': {'sec': 'φευγάτε'}},
    "τρέξ": {'sg': {'sec': 'τρέχα'}, 'pl': {'sed': 'τρεχάτε'}},
    "πλύν": {'pl': {'sec': 'πλύντε'}},
    "πά": {'sg': {'sec': 'πήγαινε'}, 'pl': {'sec': 'πηγαίνετε'}},
    "έρθ": {'sg': {'sec': 'έλα'}, 'pl': {'sec': 'ελάτε'}},
    "έλθ": {'sg': {'sec': 'έλα'}, 'pl': {'sec': 'ελάτε'}},
}

deponens_with_active_perf_forms = ['έρχομαι', 'κάθομαι', 'γίνομαι']

irregular_active_aorists = {'βαίνω': 'βηκα', 'μπαίνω': 'μπήκα', 'βγαίνω': 'βγήκα', 'βρίσκω': 'βρήκα', 'πηγαίνω': 'πήγα', 'παίρνω': 'πήρα', 'λέω': 'είπα', 'λέγω': 'είπα', 'πίνω': 'ήπια', 'τρώω': 'έφαγα', 'τρώγω': 'έφαγα', 'βλέπω': 'είδα'}

irregular_passive_aorists = {'λέω': 'ειπώθηκα', 'λέγω': 'ειπώθηκα', 'βλέπω': 'ειδώθηκα'}



conjugations = {
'eimai': {'sg': {'pri': ['είμαι'], 'sec': ['είσαι'], 'ter': ['είναι']}, 'pl': {'pri': ['είμαστε'], 'sec': ['είστε', 'είσαστε'], 'ter': ['είναι']}},
'eimai_paratatikos':  {'sg': {'pri': ['ήμουν', 'ήμουνα'], 'sec': ['ησουν', 'ήσουνα'], 'ter': ['ήταν', 'ήτανε']}, 'pl': {'pri': ['ήμαστε', 'ήμασταν'], 'sec': ['ήσαστε', 'ήσασταν'], 'ter': ['ήταν', 'ήτανε']}},
'con1_act': {'sg': {'pri': ['ω'], 'sec': ['εις'], 'ter': ['ει']}, 'pl': {'pri': ['ουμε'], 'sec': ['ετε'], 'ter': ['ουν', 'ουνε']}},
'con2a_act': {'sg': {'pri': ['ώ', 'άω'], 'sec': ['άς'], 'ter': ['ά', 'άει']}, 'pl': {'pri': ['ούμε', 'άμε'], 'sec': ['άτε'], 'ter': ['άνε', 'άν', 'ούν', 'ούνε']}},
'con2b_act': {'sg': {'pri': ['ώ'], 'sec': ['είς'], 'ter': ['εί']}, 'pl': {'pri': ['ούμε'], 'sec': ['είτε'], 'ter': ['ούνε', 'ούν']}},
'con2c_act': {'sg': {'pri': ['ω'], 'sec': ['ς'], 'ter': ['ει']}, 'pl': {'pri': ['με'], 'sec': ['τε'], 'ter': ['νε', 'ν']}},
'con2d_act': {'sg': {'pri': ['ώ'], 'sec': ['οίς'], 'ter': ['οί']}, 'pl': {'pri': ['ούμε', 'ούμεν'], 'sec': ['οίτε', 'ούτε'], 'ter': ['ούνε', 'ούν']}},
'con1_act_modal': {'sg': {'ter': ['ει']}, 'pl': {'ter': ['ουν', 'ουνε']}},
'con2_act_modal': {'sg': {'ter': ['εί']}, 'pl': {'ter': ['ούν']}},

'con1_pass': {'sg': {'pri': ['ομαι'], 'sec': ['εσαι'], 'ter': ['εται']}, 'pl': {'pri': ['όμαστε'], 'sec': ['εστε', 'όσαστε'], 'ter': ['ονται']}},
'con2a_pass': {'sg': {'pri': ['ιέμαι'], 'sec': ['ιέσαι'], 'ter': ['ιέται']}, 'pl': {'pri': ['ιόμαστε', 'ιούμαστε'], 'sec': ['ιέστε', 'ιόσαστε'], 'ter': ['ιούνται', 'ιόνται']}},
'con2ab_pass': {'sg': {'pri': ['ώμαι'], 'sec': ['άσαι'], 'ter': ['άται']}, 'pl': {'pri': ['όμαστε'], 'sec': ['άστε'],
                                                                                  'ter': ['ώνται']}},

'con2b_pass': {'sg': {'pri': ['ούμαι'], 'sec': ['είσαι'], 'ter': ['είται']}, 'pl': {'pri': ['ούμαστε', 'ούμεθα'], 'sec': ['είστε', 'είσθε'], 'ter': ['ούνται']}},
'con2c_pass': {'sg': {'pri': ['άμαι'], 'sec': ['άσαι'], 'ter': ['άται']}, 'pl': {'pri': ['όμαστε'], 'sec': ['άστε', 'όσαστε'], 'ter': ['ούνται']}},
'con2sa_pass': {'sg': {'pri': ['ούμαι'], 'sec': ['ούσαι'], 'ter': ['ούται']}, 'pl': {'pri': ['ούμεθα'], 'sec': ['ούσθε'],
                                                                                 'ter': ['ούνται']}},
'con2d_pass': {'sg': {'pri': ['μαι'], 'sec': ['σαι'], 'ter': ['ται']}, 'pl': {'pri': ['μεθα'], 'sec': ['στε'],
                                                                                 'ter': ['νται']}},
'con2e_pass': {'sg': {'pri': ['αμαι'], 'sec': ['ασαι'], 'ter': ['αται']}, 'pl': {'pri': ['άμεθα', 'όμαστε'],
                                                                                 'sec': ['ασθε', 'άστε'],
                                                                                 'ter': ['ανται']}},

'aor_act': {'sg': {'pri': ['α'], 'sec': ['ες'], 'ter': ['ε']}, 'pl': {'pri': ['αμε'], 'sec': ['ατε'], 'ter': ['αν', 'ανε']}},
'arch_pass_aor' :{'sg': {'pri': ['ην'], 'sec': ['ης'], 'ter': ['η']}, 'pl': {'pri': ['ημεν'], 'sec': ['ητε'], 'ter': ['ησαν']}},
'parat2_act': {'sg': {'pri': ['α'], 'sec': ['ες'], 'ter': ['ε']}, 'pl': {'pri': ['αμε'], 'sec': ['ατε'], 'ter': ['αν', 'ανε']}},
'parat_act_modal': {'sg':{'ter': ['ε']}, 'pl':{'ter': ['αν']}},
'parat1_pass': {'sg': {'pri': ['όμουν', 'όμουνα'], 'sec': ['όσουν', 'όσουνα'], 'ter': ['όταν', 'ότανε']}, 'pl': {'pri': ['όμασταν', 'όμαστε'], 'sec': ['όσασταν', 'όσαστε'], 'ter': ['ονταν', 'όντουσαν']}},
'parat2a_pass': {'sg': {'pri': ['ιόμουν', 'ιόμουνα'], 'sec': ['ιόσουν', 'ιόσουνα'], 'ter': ['ιόταν', 'ιότανε']}, 'pl': {'pri': ['ιόμασταν', 'ιόμαστε'], 'sec': ['ιόσασταν', 'ιόσαστε'], 'ter': ['ιούνταν', 'ιόνταν', 'ιόντουσαν']}},
'parat2b_pass': {'sg': {'pri': ['ούμουν'], 'sec': ['ούσουν'], 'ter': ['είτο', 'ούνταν', 'ούντανε']}, 'pl': {'pri': ['ούμασταν', 'ούμαστε'], 'sec': ['ούσασταν', 'ούσαστε'], 'ter': ['ούνταν', 'ούντο', 'ούντανε']}},
'parat2b_pass_logia' : {'sg': {'pri': ['ούμην'], 'sec': ['είσο'], 'ter': ['είτο']}, 'pl': {'pri': ['ούμεθα'], 'sec': ['είσθε'], 'ter': ['ούντο']}},
'parat2c_pass': {'sg': {'pri': ['όμουν', 'όμουνα'], 'sec': ['όσουν', 'όσουνα'], 'ter': ['όταν', 'ότανε']}, 'pl': {'pri': ['όμασταν', 'όμαστε'], 'sec': ['όσασταν', 'όσαστε'], 'ter': ['ούνταν', 'όντουσαν']}},
'parat2d_pass': {'sg': {'pri': ['όμουν', 'έμην'], 'sec': ['όσουν', 'εσο'], 'ter': ['όταν', 'ετο']},
                 'pl': {'pri': ['όμασταν', 'έμεθα'], 'sec': ['όσασταν', 'εσθε'], 'ter': ['ούνταν', 'εντο']}},
'parat2e_pass': {'sg': {'pri': ['άμην'], 'sec': ['ασο'], 'ter': ['ατο']}, 'pl': {'pri': ['άμεθα', 'όμαστε', 'όμασταν'],
                                                                                 'sec': ['ασθε', 'άστε', 'όσασταν',
                                                                                         'όσαστε'],
                                                                                 'ter': ['αντο']}},

'imper_act_cont_1': {'sg': {'sec': ['ε']}, 'pl':{ 'sec':['ετε'] }},
'imper_act_eimai': {'sg': {'ter': ['έστω']}},
'imper_act_cont_2a': {'sg': {'sec': ['α', 'αγε']}, 'pl':{ 'sec':['άτε'] }},
'imper_act_cont_2b': {'sg': {'sec': ['ει']}, 'pl':{ 'sec':['είτε'] }},
'imper_act_cont_2d': {'sg': {'sec': ['ου']}, 'pl': {'sec':['ούτε', 'οίτε']}},
'imper_act_cont_2c': {'sg': {'sec': ['γε']}, 'pl':{ 'sec':['γετε', 'τε']}},
'imper_pass_cont_2d': {'sg': {'sec': ['σο']}, 'pl': {'sec': ['σθε']}},
'imper_pass_cont_2e': {'sg': {'sec': ['σο']}, 'pl': {'sec': ['σθε']}},
'imper_pass_cont_1': {'pl':{ 'sec': ['εστε']}},
'imper_pass_cont_2a': {'pl':{ 'sec': ['ιέστε']}},
'imper_pass_cont_2b': {'pl':{ 'sec': ['είστε']}},
'imper_pass_cont_2c': {'pl':{ 'sec': ['άστε']}},

'imper_act_aor_a': {'sg': {'sec': ['ε']}, 'pl': {'sec':['τε']}},
'imper_act_aor_b': {'sg': {'sec': ['ε']}, 'pl': { 'sec':['ετε'] }},
'imper_act_aor_c': {'sg': {'sec': ['ες']}, 'pl': {'sec':['έστε', 'είτε']}},
'imper_act_aor_ca':{'sg': {'sec': ['α']}, 'pl': {'sec':['είτε']}},
'imper_pass_aor_a': {'sg': {'sec': ['ου']}, 'pl':{ 'sec':['είτε']}},
'imper_pass_aor_b': { 'pl':{ 'sec':['είτε']} },
'present_active_part_1': {'nd': {'nd': ['οντας']}},
'present_active_eimai': {'nd': {'nd': ['όντας']}},
'present_active_part_2c': {'nd': {'nd': ['γοντας']}},
'present_active_part_2': {'nd': {'nd': ['ώντας']}},
'present_passive_part_1': {'sg': {'nd': ['όμενος']}},
'present_passive_part_2a': {'sg': {'nd': ['ώμενος']}},
'present_passive_part_2ab': {'sg': {'nd': ['ώμενος']}},
'present_passive_part_2b': {'sg': {'nd': ['ούμενος']}},
'present_passive_part_2d': {'sg': {'nd': ['έμενος']}},
'present_passive_part_2e': {'sg': {'nd': ['μενος']}},
'past_passive_part': {'sg': {'nd': ['μένος']}},
'modal': None
}
