from unittest import TestCase, main

from modern_greek_inflexion.verb import verb

res = verb.create_all_forms('συμβαίνει')
print(res)

class VerbTestAll(TestCase):
    def test_verb_erxomai(self):
        self.assertEqual(
            verb.create_all_forms('έρχομαι'),
            {'present':
                 {'passive':
                      {'sec_pos': 'ind',
                        'forms_ind': {'sg': {'pri': {'έρχομαι'}, 'sec': {'έρχεσαι'}, 'ter': {'έρχεται'}},
                                    'pl': {'pri': {'ερχόμαστε'}, 'sec': {'έρχεστε', 'ερχόσαστε'}, 'ter': {'έρχονται'}}},
                                     'forms_imp': {'pl': {'sec': {'έρχεστε'}}}}},
             'conjunctive': {
                'active': {'sec_pos': 'ind', 'forms_ind': {
                    'sg': {'pri': {'έρθω', 'έλθω'}, 'sec': {'έρθεις', 'έλθεις'}, 'ter': {'έλθει', 'έρθει'}},
                    'pl': {'pri': {'έλθουμε', 'έρθουμε'}, 'sec': {'έρθετε', 'έλθετε'},
                           'ter': {'έλθουνε', 'έλθουν', 'έρθουν', 'έρθουνε'}}},
                           'forms_imp': {'sg': {'sec': {'έλα'}}, 'pl': {'sec': {'ελάτε', 'έρθετε', 'έλθετε'}}}}},
             'aorist': {'active': {'sec_pos': 'ind', 'forms_ind': {
                 'sg': {'pri': {'ήρθα', 'ήλθα'}, 'sec': {'ήλθες', 'ήρθες'}, 'ter': {'ήρθε', 'ήλθε'}},
                 'pl': {'pri': {'ήρθαμε', 'ήλθαμε'}, 'sec': {'ήλθατε', 'ήρθατε'},
                        'ter': {'ήρθανε', 'ήρθαν', 'ήλθανε', 'ήλθαν'}}}}},
             'paratatikos': {'passive': {'sec_pos': 'ind',
                                         'forms_ind': {'sg': {'pri': {'ερχόμουνα', 'ερχόμουν'},
                                                        'sec': {'ερχόσουνα',  'ερχόσουν'},'ter': {'ερχότανε','ερχόταν'}},
                                                        'pl': { 'pri': {'ερχόμαστε', 'ερχόμασταν'},  'sec': {'ερχόσαστε',
                                                                                                                   'ερχόσασταν'},
                                                                                                               'ter': {
                                                                                                                   'ερχόντουσαν',
                                                                                                                   'έρχονταν'}}}}},
             'pass_pres_participle': {
                 'sg': {'masc': {'nom': 'ερχόμενος', 'gen': 'ερχόμενου', 'acc': 'ερχόμενο', 'voc': 'ερχόμενε'},
                        'fem': {'nom': 'ερχόμενη', 'gen': 'ερχόμενης', 'acc': 'ερχόμενη', 'voc': 'ερχόμενη'},
                        'neut': {'nom': 'ερχόμενο', 'gen': 'ερχόμενου', 'acc': 'ερχόμενο', 'voc': 'ερχόμενο'}},
                 'pl': {'masc': {'nom': 'ερχόμενοι', 'gen': 'ερχόμενων', 'acc': 'ερχόμενους', 'voc': 'ερχόμενοι'},
                        'fem': {'nom': 'ερχόμενες', 'gen': 'ερχόμενων', 'acc': 'ερχόμενες', 'voc': 'ερχόμενες'},
                        'neut': {'nom': 'ερχόμενα', 'gen': 'ερχόμενων', 'acc': 'ερχόμενα', 'voc': 'ερχόμενα'}}}}

        )

    def test_verb_tragoudo(self):
        self.assertEqual(
            verb.create_all_forms('τραγουδώ'),
            {'present': {'active': {'sec_pos': 'ind', 'forms_ind': {
                'sg': {'pri': {'τραγουδάω', 'τραγουδώ'}, 'sec': {'τραγουδάς'}, 'ter': {'τραγουδάει', 'τραγουδά'}},
                'pl': {'pri': {'τραγουδάμε', 'τραγουδούμε'}, 'sec': {'τραγουδάτε'},
                       'ter': {'τραγουδάνε', 'τραγουδούνε', 'τραγουδούν', 'τραγουδάν'}}},
                                    'forms_imp': {'sg': {'sec': {'τραγούδα', 'τραγούδαγε'}},
                                                  'pl': {'sec': {'τραγουδάτε'}}}}, 'passive': {'sec_pos': 'ind',
                                                                                               'forms_ind': {'sg': {
                                                                                                   'pri': {
                                                                                                       'τραγουδιέμαι'},
                                                                                                   'sec': {
                                                                                                       'τραγουδιέσαι'},
                                                                                                   'ter': {
                                                                                                       'τραγουδιέται'}},
                                                                                                             'pl': {
                                                                                                                 'pri': {
                                                                                                                     'τραγουδιόμαστε',
                                                                                                                     'τραγουδιούμαστε'},
                                                                                                                 'sec': {
                                                                                                                     'τραγουδιέστε',
                                                                                                                     'τραγουδιόσαστε'},
                                                                                                                 'ter': {
                                                                                                                     'τραγουδιούνται',
                                                                                                                     'τραγουδιόνται'}}},
                                                                                               'forms_imp': {'pl': {
                                                                                                   'sec': {
                                                                                                       'τραγουδιέστε'}}}}},
             'conjunctive': {'active': {'sec_pos': 'ind', 'forms_ind': {
                 'sg': {'pri': {'τραγουδήσω'}, 'sec': {'τραγουδήσεις'}, 'ter': {'τραγουδήσει'}},
                 'pl': {'pri': {'τραγουδήσουμε'}, 'sec': {'τραγουδήσετε'}, 'ter': {'τραγουδήσουνε', 'τραγουδήσουν'}}},
                                        'forms_imp': {'sg': {'sec': {'τραγούδησε'}}, 'pl': {'sec': {'τραγουδήστε'}}}},
                             'passive': {'sec_pos': 'ind', 'forms_ind': {
                                 'sg': {'pri': {'τραγουδηθώ'}, 'sec': {'τραγουδηθείς'}, 'ter': {'τραγουδηθεί'}},
                                 'pl': {'pri': {'τραγουδηθούμε'}, 'sec': {'τραγουδηθείτε'},
                                        'ter': {'τραγουδηθούνε', 'τραγουδηθούν'}}},
                                         'forms_imp': {'sg': {'sec': {'τραγουδήσου'}},
                                                       'pl': {'sec': {'τραγουδηθείτε'}}}}}, 'aorist': {
                'active': {'sec_pos': 'ind',
                           'forms_ind': {'sg': {'pri': {'τραγούδησα'}, 'sec': {'τραγούδησες'}, 'ter': {'τραγούδησε'}},
                                         'pl': {'pri': {'τραγουδήσαμε'}, 'sec': {'τραγουδήσατε'},
                                                'ter': {'τραγουδήσανε', 'τραγούδησαν'}}}}, 'passive': {'sec_pos': 'ind',
                                                                                                       'forms_ind': {
                                                                                                           'sg': {
                                                                                                               'pri': {
                                                                                                                   'τραγουδήθηκα'},
                                                                                                               'sec': {
                                                                                                                   'τραγουδήθηκες'},
                                                                                                               'ter': {
                                                                                                                   'τραγουδήθηκε'}},
                                                                                                           'pl': {
                                                                                                               'pri': {
                                                                                                                   'τραγουδηθήκαμε'},
                                                                                                               'sec': {
                                                                                                                   'τραγουδηθήκατε'},
                                                                                                               'ter': {
                                                                                                                   'τραγουδήθηκαν',
                                                                                                                   'τραγουδηθήκανε'}}}}},
             'paratatikos': {'active': {'sec_pos': 'ind', 'forms_ind': {
                 'sg': {'pri': {'τραγούδαγα', 'τραγουδούσα'}, 'sec': {'τραγουδούσες', 'τραγούδαγες'},
                        'ter': {'τραγούδαγε', 'τραγουδούσε'}},
                 'pl': {'pri': {'τραγουδάγαμε', 'τραγουδούσαμε'}, 'sec': {'τραγουδάγατε', 'τραγουδούσατε'},
                        'ter': {'τραγούδαγαν', 'τραγουδάγανε', 'τραγουδούσαν', 'τραγουδούσανε'}}}},
                             'passive': {'sec_pos': 'ind', 'forms_ind': {
                                 'sg': {'pri': {'τραγουδιόμουν', 'τραγουδιόμουνα'},
                                        'sec': {'τραγουδιόσουν', 'τραγουδιόσουνα'},
                                        'ter': {'τραγουδιόταν', 'τραγουδιότανε'}},
                                 'pl': {'pri': {'τραγουδιόμαστε', 'τραγουδιόμασταν'},
                                        'sec': {'τραγουδιόσασταν', 'τραγουδιόσαστε'},
                                        'ter': {'τραγουδιούνταν', 'τραγουδιόντουσαν', 'τραγουδιόνταν'}}}}},
             'act_pres_participle': {'τραγουδώντας'}, 'passive_perfect_participle': {'sg': {
                'masc': {'nom': 'τραγουδημένος', 'gen': 'τραγουδημένου', 'acc': 'τραγουδημένο', 'voc': 'τραγουδημένε'},
                'fem': {'nom': 'τραγουδημένη', 'gen': 'τραγουδημένης', 'acc': 'τραγουδημένη', 'voc': 'τραγουδημένη'},
                'neut': {'nom': 'τραγουδημένο', 'gen': 'τραγουδημένου', 'acc': 'τραγουδημένο', 'voc': 'τραγουδημένο'}},
                                                                                     'pl': {'masc': {
                                                                                         'nom': 'τραγουδημένοι',
                                                                                         'gen': 'τραγουδημένων',
                                                                                         'acc': 'τραγουδημένους',
                                                                                         'voc': 'τραγουδημένοι'},
                                                                                            'fem': {
                                                                                                'nom': 'τραγουδημένες',
                                                                                                'gen': 'τραγουδημένων',
                                                                                                'acc': 'τραγουδημένες',
                                                                                                'voc': 'τραγουδημένες'},
                                                                                            'neut': {
                                                                                                'nom': 'τραγουδημένα',
                                                                                                'gen': 'τραγουδημένων',
                                                                                                'acc': 'τραγουδημένα',
                                                                                                'voc': 'τραγουδημένα'}}}}

        )

    def test_verb_kybernw(self):
        self.assertEqual(
            verb.create_all_forms('κυβερνώ'),
            {'present': {'active': {'sec_pos': 'ind', 'forms_ind': {
                'sg': {'pri': {'κυβερνάω', 'κυβερνώ'}, 'sec': {'κυβερνάς'}, 'ter': {'κυβερνάει', 'κυβερνά'}},
                'pl': {'pri': {'κυβερνούμε', 'κυβερνάμε'}, 'sec': {'κυβερνάτε'},
                       'ter': {'κυβερνάν', 'κυβερνούν', 'κυβερνάνε', 'κυβερνούνε'}}},
                                    'forms_imp': {'sg': {'sec': {'κυβέρναγε', 'κυβέρνα'}},
                                                  'pl': {'sec': {'κυβερνάτε'}}}}, 'passive': {'sec_pos': 'ind',
                                                                                              'forms_ind': {'sg': {
                                                                                                  'pri': {'κυβερνούμαι',
                                                                                                          'κυβερνιέμαι',
                                                                                                          'κυβερνώμαι'},
                                                                                                  'sec': {'κυβερνιέσαι',
                                                                                                          'κυβερνάσαι',
                                                                                                          'κυβερνείσαι'},
                                                                                                  'ter': {'κυβερνιέται',
                                                                                                          'κυβερνάται',
                                                                                                          'κυβερνείται'}},
                                                                                                            'pl': {
                                                                                                                'pri': {
                                                                                                                    'κυβερνούμαστε',
                                                                                                                    'κυβερνούμεθα',
                                                                                                                    'κυβερνιόμαστε',
                                                                                                                    'κυβερνιούμαστε',
                                                                                                                    'κυβερνόμαστε'},
                                                                                                                'sec': {
                                                                                                                    'κυβερνείστε',
                                                                                                                    'κυβερνείσθε',
                                                                                                                    'κυβερνιόσαστε',
                                                                                                                    'κυβερνιέστε',
                                                                                                                    'κυβερνάστε'},
                                                                                                                'ter': {
                                                                                                                    'κυβερνιούνται',
                                                                                                                    'κυβερνιόνται',
                                                                                                                    'κυβερνούνται',
                                                                                                                    'κυβερνώνται'}}},
                                                                                              'forms_imp': {'pl': {
                                                                                                  'sec': {'κυβερνείστε',
                                                                                                          'κυβερνάστε',
                                                                                                          'κυβερνιέστε'}}}}},
             'conjunctive': {'active': {'sec_pos': 'ind', 'forms_ind': {
                 'sg': {'pri': {'κυβερνήσω'}, 'sec': {'κυβερνήσεις'}, 'ter': {'κυβερνήσει'}},
                 'pl': {'pri': {'κυβερνήσουμε'}, 'sec': {'κυβερνήσετε'}, 'ter': {'κυβερνήσουν', 'κυβερνήσουνε'}}},
                                        'forms_imp': {'sg': {'sec': {'κυβέρνησε'}}, 'pl': {'sec': {'κυβερνήστε'}}}},
                             'passive': {'sec_pos': 'ind', 'forms_ind': {
                                 'sg': {'pri': {'κυβερνηθώ'}, 'sec': {'κυβερνηθείς'}, 'ter': {'κυβερνηθεί'}},
                                 'pl': {'pri': {'κυβερνηθούμε'}, 'sec': {'κυβερνηθείτε'},
                                        'ter': {'κυβερνηθούν', 'κυβερνηθούνε'}}},
                                         'forms_imp': {'sg': {'sec': {'κυβερνήσου'}},
                                                       'pl': {'sec': {'κυβερνηθείτε'}}}}}, 'aorist': {
                'active': {'sec_pos': 'ind',
                           'forms_ind': {'sg': {'pri': {'κυβέρνησα'}, 'sec': {'κυβέρνησες'}, 'ter': {'κυβέρνησε'}},
                                         'pl': {'pri': {'κυβερνήσαμε'}, 'sec': {'κυβερνήσατε'},
                                                'ter': {'κυβερνήσανε', 'κυβέρνησαν'}}}}, 'passive': {'sec_pos': 'ind',
                                                                                                     'forms_ind': {
                                                                                                         'sg': {'pri': {
                                                                                                             'κυβερνήθηκα'},
                                                                                                                'sec': {
                                                                                                                    'κυβερνήθηκες'},
                                                                                                                'ter': {
                                                                                                                    'κυβερνήθηκε'}},
                                                                                                         'pl': {'pri': {
                                                                                                             'κυβερνηθήκαμε'},
                                                                                                                'sec': {
                                                                                                                    'κυβερνηθήκατε'},
                                                                                                                'ter': {
                                                                                                                    'κυβερνηθήκανε',
                                                                                                                    'κυβερνήθηκαν'}}}}},
             'paratatikos': {'active': {'sec_pos': 'ind', 'forms_ind': {
                 'sg': {'pri': {'κυβερνούσα', 'κυβέρναγα'}, 'sec': {'κυβέρναγες', 'κυβερνούσες'},
                        'ter': {'κυβερνούσε', 'κυβέρναγε'}},
                 'pl': {'pri': {'κυβερνάγαμε', 'κυβερνούσαμε'}, 'sec': {'κυβερνάγατε', 'κυβερνούσατε'},
                        'ter': {'κυβερνούσαν', 'κυβερνούσανε', 'κυβερνάγανε', 'κυβέρναγαν'}}}},
                             'passive': {'sec_pos': 'ind', 'forms_ind': {
                                 'sg': {'pri': {'κυβερνιόμουνα', 'κυβερνιόμουν'},
                                        'sec': {'κυβερνιόσουν', 'κυβερνιόσουνα'},
                                        'ter': {'κυβερνιόταν', 'κυβερνιότανε'}},
                                 'pl': {'pri': {'κυβερνιόμασταν', 'κυβερνιόμαστε'},
                                        'sec': {'κυβερνιόσαστε', 'κυβερνιόσασταν'},
                                        'ter': {'κυβερνιόντουσαν', 'κυβερνιούνταν', 'κυβερνιόνταν'}}}}},
             'act_pres_participle': {'κυβερνώντας'}, 'arch_act_pres_participle': {
                'sg': {'masc': {'nom': 'κυβερνών', 'gen': 'κυβερνώντος', 'acc': 'κυβερνώντα', 'voc': 'κυβερνών'},
                       'fem': {'nom': 'κυβερνώσα', 'gen': 'κυβερνώσας', 'acc': 'κυβερνώσα', 'voc': 'κυβερνώσα'},
                       'neut': {'nom': 'κυβερνών', 'gen': 'κυβερνώντος', 'acc': 'κυβερνών', 'voc': 'κυβερνών'}},
                'pl': {'masc': {'nom': 'κυβερνώντες', 'gen': 'κυβερνώντων', 'acc': 'κυβερνώντες', 'voc': 'κυβερνώντες'},
                       'fem': {'nom': 'κυβερνώσες', 'gen': 'κυβερνωσών', 'acc': 'κυβερνώσες', 'voc': 'κυβερνώσες'},
                       'neut': {'nom': 'κυβερνώντα', 'gen': 'κυβερνώντων', 'acc': 'κυβερνώντα', 'voc': 'κυβερνώντα'}}},
             'pass_pres_participle': {'pl': {
                 'fem': {'nom': 'κυβερνούμενες,κυβερνώμενες', 'acc': 'κυβερνούμενες,κυβερνώμενες',
                         'voc': 'κυβερνούμενες,κυβερνώμενες', 'gen': 'κυβερνούμενων,κυβερνώμενων'},
                 'masc': {'nom': 'κυβερνούμενοι,κυβερνώμενοι', 'acc': 'κυβερνούμενους,κυβερνώμενους',
                          'voc': 'κυβερνούμενοι,κυβερνώμενοι', 'gen': 'κυβερνούμενων,κυβερνώμενων'},
                 'neut': {'nom': 'κυβερνούμενα,κυβερνώμενα', 'acc': 'κυβερνούμενα,κυβερνώμενα',
                          'voc': 'κυβερνούμενα,κυβερνώμενα', 'gen': 'κυβερνούμενων,κυβερνώμενων'}}, 'sg': {
                 'fem': {'nom': 'κυβερνούμενη,κυβερνώμενη', 'acc': 'κυβερνούμενη,κυβερνώμενη',
                         'voc': 'κυβερνούμενη,κυβερνώμενη', 'gen': 'κυβερνούμενης,κυβερνώμενης'},
                 'masc': {'nom': 'κυβερνούμενος,κυβερνώμενος', 'acc': 'κυβερνούμενο,κυβερνώμενο',
                          'voc': 'κυβερνούμενε,κυβερνώμενε', 'gen': 'κυβερνούμενου,κυβερνώμενου'},
                 'neut': {'nom': 'κυβερνούμενο,κυβερνώμενο', 'acc': 'κυβερνούμενο,κυβερνώμενο',
                          'voc': 'κυβερνούμενο,κυβερνώμενο', 'gen': 'κυβερνούμενου,κυβερνώμενου'}}},
             'passive_perfect_participle': {'sg': {
                 'masc': {'nom': 'κυβερνημένος', 'gen': 'κυβερνημένου', 'acc': 'κυβερνημένο', 'voc': 'κυβερνημένε'},
                 'fem': {'nom': 'κυβερνημένη', 'gen': 'κυβερνημένης', 'acc': 'κυβερνημένη', 'voc': 'κυβερνημένη'},
                 'neut': {'nom': 'κυβερνημένο', 'gen': 'κυβερνημένου', 'acc': 'κυβερνημένο', 'voc': 'κυβερνημένο'}},
                                            'pl': {'masc': {'nom': 'κυβερνημένοι', 'gen': 'κυβερνημένων',
                                                            'acc': 'κυβερνημένους', 'voc': 'κυβερνημένοι'},
                                                   'fem': {'nom': 'κυβερνημένες', 'gen': 'κυβερνημένων',
                                                           'acc': 'κυβερνημένες', 'voc': 'κυβερνημένες'},
                                                   'neut': {'nom': 'κυβερνημένα', 'gen': 'κυβερνημένων',
                                                            'acc': 'κυβερνημένα', 'voc': 'κυβερνημένα'}}}}

        )

    def test_verb_blepo(self):
        self.assertEqual(
            verb.create_all_forms('βλέπω'),

            {'present': {'active': {'sec_pos': 'ind',
                                    'forms_ind': {'sg': {'pri': {'βλέπω'}, 'sec': {'βλέπεις'}, 'ter': {'βλέπει'}},
                                                  'pl': {'pri': {'βλέπουμε'}, 'sec': {'βλέπετε'},
                                                         'ter': {'βλέπουν', 'βλέπουνε'}}},
                                    'forms_imp': {'sg': {'sec': {'βλέπε'}}, 'pl': {'sec': {'βλέπετε'}}}},
                         'passive': {'sec_pos': 'ind', 'forms_ind': {
                             'sg': {'pri': {'βλέπομαι'}, 'sec': {'βλέπεσαι'}, 'ter': {'βλέπεται'}},
                             'pl': {'pri': {'βλεπόμαστε'}, 'sec': {'βλέπεστε', 'βλεπόσαστε'}, 'ter': {'βλέπονται'}}},
                                     'forms_imp': {'pl': {'sec': {'βλέπεστε'}}}}}, 'conjunctive': {
                'active': {'sec_pos': 'ind', 'forms_ind': {'sg': {'pri': {'δω'}, 'sec': {'δεις'}, 'ter': {'δει'}},
                                                           'pl': {'pri': {'δούμε'}, 'sec': {'δείτε'},
                                                                  'ter': {'δουν', 'δούνε'}}},
                           'forms_imp': {'sg': {'sec': {'δες'}}, 'pl': {'sec': {'δέστε', 'δείτε'}}}},
                'passive': {'sec_pos': 'ind',
                            'forms_ind': {'sg': {'pri': {'ιδωθώ'}, 'sec': {'ιδωθείς'}, 'ter': {'ιδωθεί'}},
                                          'pl': {'pri': {'ιδωθούμε'}, 'sec': {'ιδωθείτε'},
                                                 'ter': {'ιδωθούνε', 'ιδωθούν'}}},
                            'forms_imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'ιδωθείτε'}}}}}, 'aorist': {
                'active': {'sec_pos': 'ind', 'forms_ind': {'sg': {'pri': {'είδα'}, 'sec': {'είδες'}, 'ter': {'είδε'}},
                                                           'pl': {'pri': {'είδαμε'}, 'sec': {'είδατε'},
                                                                  'ter': {'είδανε', 'είδαν'}}}},
                'passive': {'sec_pos': 'ind',
                            'forms_ind': {'sg': {'pri': {'ειδώθηκα'}, 'sec': {'ειδώθηκες'}, 'ter': {'ειδώθηκε'}},
                                          'pl': {'pri': {'ειδωθήκαμε'}, 'sec': {'ειδωθήκατε'},
                                                 'ter': {'ειδωθήκανε', 'ειδώθηκαν'}}}}}, 'paratatikos': {
                'active': {'sec_pos': 'ind',
                           'forms_ind': {'sg': {'pri': {'έβλεπα'}, 'sec': {'έβλεπες'}, 'ter': {'έβλεπε'}},
                                         'pl': {'pri': {'βλέπαμε'}, 'sec': {'βλέπατε'},
                                                'ter': {'βλέπανε', 'έβλεπαν'}}}}, 'passive': {'sec_pos': 'ind',
                                                                                              'forms_ind': {'sg': {
                                                                                                  'pri': {'βλεπόμουνα',
                                                                                                          'βλεπόμουν'},
                                                                                                  'sec': {'βλεπόσουνα',
                                                                                                          'βλεπόσουν'},
                                                                                                  'ter': {'βλεπόταν',
                                                                                                          'βλεπότανε'}},
                                                                                                            'pl': {
                                                                                                                'pri': {
                                                                                                                    'βλεπόμαστε',
                                                                                                                    'βλεπόμασταν'},
                                                                                                                'sec': {
                                                                                                                    'βλεπόσασταν',
                                                                                                                    'βλεπόσαστε'},
                                                                                                                'ter': {
                                                                                                                    'βλέπονταν',
                                                                                                                    'βλεπόντουσαν'}}}}},
             'act_pres_participle': {'βλέποντας'}, 'arch_act_pres_participle': {
                'sg': {'masc': {'nom': 'βλέπων', 'gen': 'βλέποντος', 'acc': 'βλέποντα', 'voc': 'βλέπων'},
                       'fem': {'nom': 'βλέπουσα', 'gen': 'βλέπουσας', 'acc': 'βλέπουσα', 'voc': 'βλέπουσα'},
                       'neut': {'nom': 'βλέπον', 'gen': 'βλέποντος', 'acc': 'βλέπον', 'voc': 'βλέπον'}},
                'pl': {'masc': {'nom': 'βλέποντες', 'gen': 'βλεπόντων', 'acc': 'βλέποντες', 'voc': 'βλέποντες'},
                       'fem': {'nom': 'βλέπουσες', 'gen': 'βλεπουσών', 'acc': 'βλέπουσες', 'voc': 'βλέπουσες'},
                       'neut': {'nom': 'βλέποντα', 'gen': 'βλεπόντων', 'acc': 'βλέποντα', 'voc': 'βλέποντα'}}},
             'passive_perfect_participle': {
                 'sg': {'masc': {'nom': 'ιδωμένος', 'gen': 'ιδωμένου', 'acc': 'ιδωμένο', 'voc': 'ιδωμένε'},
                        'fem': {'nom': 'ιδωμένη', 'gen': 'ιδωμένης', 'acc': 'ιδωμένη', 'voc': 'ιδωμένη'},
                        'neut': {'nom': 'ιδωμένο', 'gen': 'ιδωμένου', 'acc': 'ιδωμένο', 'voc': 'ιδωμένο'}},
                 'pl': {'masc': {'nom': 'ιδωμένοι', 'gen': 'ιδωμένων', 'acc': 'ιδωμένους', 'voc': 'ιδωμένοι'},
                        'fem': {'nom': 'ιδωμένες', 'gen': 'ιδωμένων', 'acc': 'ιδωμένες', 'voc': 'ιδωμένες'},
                        'neut': {'nom': 'ιδωμένα', 'gen': 'ιδωμένων', 'acc': 'ιδωμένα', 'voc': 'ιδωμένα'}}}}

        )

    def test_verb_syllambanw(self):
        self.assertEqual(
            verb.create_all_forms('συλλαμβάνω'),
            {'present': {'active': {'sec_pos': 'ind', 'forms_ind': {
                'sg': {'pri': {'συλλαμβάνω'}, 'sec': {'συλλαμβάνεις'}, 'ter': {'συλλαμβάνει'}},
                'pl': {'pri': {'συλλαμβάνουμε'}, 'sec': {'συλλαμβάνετε'}, 'ter': {'συλλαμβάνουν', 'συλλαμβάνουνε'}}},
                                    'forms_imp': {'sg': {'sec': {'συλλάμβανε'}}, 'pl': {'sec': {'συλλαμβάνετε'}}}},
                         'passive': {'sec_pos': 'ind', 'forms_ind': {
                             'sg': {'pri': {'συλλαμβάνομαι'}, 'sec': {'συλλαμβάνεσαι'}, 'ter': {'συλλαμβάνεται'}},
                             'pl': {'pri': {'συλλαμβανόμαστε'}, 'sec': {'συλλαμβάνεστε', 'συλλαμβανόσαστε'},
                                    'ter': {'συλλαμβάνονται'}}}, 'forms_imp': {'pl': {'sec': {'συλλαμβάνεστε'}}}}},
             'conjunctive': {'active': {'sec_pos': 'ind', 'forms_ind': {
                 'sg': {'pri': {'συλλάβω'}, 'sec': {'συλλάβεις'}, 'ter': {'συλλάβει'}},
                 'pl': {'pri': {'συλλάβουμε'}, 'sec': {'συλλάβετε'}, 'ter': {'συλλάβουνε', 'συλλάβουν'}}},
                                        'forms_imp': {'sg': {'sec': {'σύλλαβε'}}, 'pl': {'sec': {'συλλάβετε'}}}},
                             'passive': {'sec_pos': 'ind', 'forms_ind': {
                                 'sg': {'pri': {'συλληφθώ'}, 'sec': {'συλληφθείς'}, 'ter': {'συλληφθεί'}},
                                 'pl': {'pri': {'συλληφθούμε'}, 'sec': {'συλληφθείτε'},
                                        'ter': {'συλληφθούνε', 'συλληφθούν'}}},
                                         'forms_imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'συλληφθείτε'}}}}},
             'aorist': {'active': {'sec_pos': 'ind',
                                   'forms_ind': {'sg': {'pri': {'συνέλαβα'}, 'sec': {'συνέλαβες'}, 'ter': {'συνέλαβε'}},
                                                 'pl': {'pri': {'συνελάβαμε'}, 'sec': {'συνελάβατε'},
                                                        'ter': {'συνελάβανε', 'συνέλαβαν'}}}},
                        'passive': {'sec_pos': 'ind', 'forms_ind': {
                            'sg': {'pri': {'συνέληφθην'}, 'sec': {'συνέληφθης'}, 'ter': {'συνέληφθη'}},
                            'pl': {'pri': {'συνελήφθημεν'}, 'sec': {'συνελήφθητε'}, 'ter': {'συνελήφθησαν'}}}}},
             'paratatikos': {'active': {'sec_pos': 'ind', 'forms_ind': {
                 'sg': {'pri': {'συλλάμβανα', 'συνελάμβανα'}, 'sec': {'συνελάμβανες', 'συλλάμβανες'},
                        'ter': {'συλλάμβανε', 'συνελάμβανε'}},
                 'pl': {'pri': {'συνελαμβάναμε', 'συλλαμβάναμε'}, 'sec': {'συλλαμβάνατε', 'συνελαμβάνατε'},
                        'ter': {'συλλάμβαναν', 'συνελάμβαναν', 'συνελαμβάνανε', 'συλλαμβάνανε'}}}},
                             'passive': {'sec_pos': 'ind', 'forms_ind': {
                                 'sg': {'pri': {'συλλαμβανόμουν', 'συλλαμβανόμουνα'},
                                        'sec': {'συλλαμβανόσουν', 'συλλαμβανόσουνα'},
                                        'ter': {'συλλαμβανόταν', 'συλλαμβανότανε'}},
                                 'pl': {'pri': {'συλλαμβανόμασταν', 'συλλαμβανόμαστε'},
                                        'sec': {'συλλαμβανόσασταν', 'συλλαμβανόσαστε'},
                                        'ter': {'συλλαμβανόντουσαν', 'συλλαμβάνονταν'}}}}},
             'act_pres_participle': {'συλλαμβάνοντας'}, 'passive_aorist_participle': {
                'sg': {'masc': {'nom': 'συλληφθείς', 'gen': 'συλληφθέντος', 'acc': 'συλληφθέντα', 'voc': 'συλληφθείς'},
                       'fem': {'nom': 'συλληφθείσα', 'gen': 'συλληφθείσας', 'acc': 'συλληφθείσα', 'voc': 'συλληφθείσα'},
                       'neut': {'nom': 'συλληφθέν', 'gen': 'συλληφθέντος', 'acc': 'συλληφθέν', 'voc': 'συλληφθέν'}},
                'pl': {'masc': {'nom': 'συλληφθέντες', 'gen': 'συλληφθέντων', 'acc': 'συλληφθέντες',
                                'voc': 'συλληφθέντες'},
                       'fem': {'nom': 'συλληφθείσες', 'gen': 'συλληφθεισών', 'acc': 'συλληφθείσες',
                               'voc': 'συλληφθείσες'},
                       'neut': {'nom': 'συλληφθέντα', 'gen': 'συλληφθέντων', 'acc': 'συλληφθέντα',
                                'voc': 'συλληφθέντα'}}}, 'pass_pres_participle': {'sg': {
                'masc': {'nom': 'συλλαμβανόμενος', 'gen': 'συλλαμβανόμενου', 'acc': 'συλλαμβανόμενο',
                         'voc': 'συλλαμβανόμενε'},
                'fem': {'nom': 'συλλαμβανόμενη', 'gen': 'συλλαμβανόμενης', 'acc': 'συλλαμβανόμενη',
                        'voc': 'συλλαμβανόμενη'},
                'neut': {'nom': 'συλλαμβανόμενο', 'gen': 'συλλαμβανόμενου', 'acc': 'συλλαμβανόμενο',
                         'voc': 'συλλαμβανόμενο'}}, 'pl': {
                'masc': {'nom': 'συλλαμβανόμενοι', 'gen': 'συλλαμβανόμενων', 'acc': 'συλλαμβανόμενους',
                         'voc': 'συλλαμβανόμενοι'},
                'fem': {'nom': 'συλλαμβανόμενες', 'gen': 'συλλαμβανόμενων', 'acc': 'συλλαμβανόμενες',
                        'voc': 'συλλαμβανόμενες'},
                'neut': {'nom': 'συλλαμβανόμενα', 'gen': 'συλλαμβανόμενων', 'acc': 'συλλαμβανόμενα',
                         'voc': 'συλλαμβανόμενα'}}}}

        )

    def test_verb_phgainw(self):
        self.assertEqual(
            verb.create_all_forms('πηγαίνω'),
            {'present': {'active': {'sec_pos': 'ind',
                                    'forms_ind': {'sg': {'pri': {'πηγαίνω'}, 'sec': {'πηγαίνεις'}, 'ter': {'πηγαίνει'}},
                                                  'pl': {'pri': {'πηγαίνουμε'}, 'sec': {'πηγαίνετε'},
                                                         'ter': {'πηγαίνουνε', 'πηγαίνουν'}}},
                                    'forms_imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'sec_pos': 'ind',
                                        'forms_ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                      'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'forms_imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'aorist': {'active': {'sec_pos': 'ind',
                                   'forms_ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                                 'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'},
                                                        'ter': {'πήγαν', 'πήγανε'}}}}}, 'paratatikos': {
                'active': {'sec_pos': 'ind',
                           'forms_ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                         'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                'ter': {'πηγαίνανε', 'πήγαιναν'}}}}},
             'act_pres_participle': {'πηγαίνοντας'}}

        )

    def test_verb_prokeitai(self):
        self.assertEqual(
            verb.create_all_forms('πρόκειται'),
            {'present': {'passive': {'sec_pos': 'ind', 'forms_ind': {'sg': {'ter': {'πρόκειται'}}}}},
             'paratatikos': {'passive': {'sec_pos': 'ind', 'forms_ind': {'sg': {'ter': {'επρόκειτο'}}}}}}

        )

    def test_verb_symbainei(self):
        self.assertEqual(
            verb.create_all_forms('συμβαίνει'),
            {'present': {'active': {'sec_pos': 'ind', 'forms_ind': {'sg': {'ter': {'συμβαίνει'}},
                                                                    'pl': {'ter': {'συμβαίνουν', 'συμβαίνουνε'}}},
                                    'forms_imp': 'modal'}},
             'conjunctive': {'active': {'sec_pos': 'ind', 'forms_ind': {'sg': {'ter': {'συμβεί'}}}}}, 'aorist': {
                'active': {'sec_pos': 'ind',
                           'forms_ind': {'sg': {'pri': {'σύνεβην'}, 'sec': {'σύνεβης'}, 'ter': {'σύνεβη'}},
                                         'pl': {'pri': {'συνέβημεν'}, 'sec': {'συνέβητε'}, 'ter': {'συνέβησαν'}}}}},
             'paratatikos': {'active': {'sec_pos': 'ind', 'forms_ind': {'sg': {'ter': {'συνέβαινε'}}}}}}

        )


if __name__ == '__main__':
    main()