from unittest import TestCase

from icecream import ic

# from icecream import ic

from modern_greek_inflexion.exceptions import NotLegalVerbException, NotInGreekException
from modern_greek_inflexion import verb

"""
to do:

przy modalnych błędnie tworzy się liczbę mnogą, niepotrzebnie imieslowy i blednie tryb rozkazujacy

πρόκυψη 
"""


class VerbTestAll(TestCase):

    def test_not_in_greek_exception(self):
        self.assertRaises(NotInGreekException, verb.create_all_forms, 'gamao')

    def test_not_legal_verb_exception(self):
        self.assertRaises(NotLegalVerbException, verb.create_all_forms, 'βλέπουμε')

    def test_verb_modal_pass_fainetai(self):
        self.assertDictEqual(
            verb.create_all_forms('φαίνεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'φαίνεται'}}}}},
             'conjunctive': {'passive': {'ind': {'sg': {'ter': {'φανεί'}}}}},
             'aorist': {'passive': {'ind': {'sg': {'ter': {'φάνηκε'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'φαινόταν'}}}}}},
        )

    def test_verb_modal_brexei(self):
        self.assertDictEqual(
            verb.create_all_forms('βρέχει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'βρέχει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'βρέξει'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'έβρεξε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'έβρεχε'}}}}}}
        )

    def test_verb_antikathistw(self):
        self.assertDictEqual(
            verb.create_all_forms('αντικαθιστώ')['present']['active'],
            {'ind': {'sg': {'pri': {'αντικαθιστώ'}, 'sec': {'αντικαθιστάς'},
                            'ter': {'αντικαθιστά'}},
                     'pl': {'pri': {'αντικαθιστούμε'}, 'sec': {'αντικαθιστάτε'},
                            'ter': {'αντικαθιστούν'}}},
             'imp': {'sg': {'sec': {'αντικαθίστα'}}, 'pl': {'sec': {'αντικαθιστάτε'}}}},

        )

    def test_verb_modal_pass_melletai(self):
        self.assertDictEqual(
            verb.create_all_forms('μέλλεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'μέλλεται'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'μελλόταν'}}}}}}
        )


    def test_verb_opsomai(self):
        self.assertDictEqual(

            verb.create_all_forms('όψομαι'),
            {'present': {'passive': {'imp': {'pl': {'sec': {'όψεστε'}}},
                                     'ind': {'pl': {'pri': {'οψόμεθα', 'οψόμαστε'},
                                                    'sec': {'όψεσθε', 'οψόσαστε', 'όψεστε'},
                                                    'ter': {'όψονται'}},
                                             'sg': {'pri': {'όψομαι'},
                                                    'sec': {'όψεσαι'},
                                                    'ter': {'όψεται'}}}}}}

        )

    def test_verb_antikeimai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('αντίκειμαι'),
            {'paratatikos': {'passive': {'ind': {'sg': {'ter': {'αντίκειτο'}}}}},

             'pass_pres_participle': {
                 'pl': {'fem': {'acc': {'αντικείμενες'}, 'gen': {'αντικείμενων'}, 'nom': {'αντικείμενες'}, 'voc': {
                     'αντικείμενες'}}, 'masc': {'acc': {'αντικείμενους'}, 'gen': {'αντικείμενων'}, 'nom': {
                     'αντικείμενοι'}, 'voc': {'αντικείμενοι'}}, 'neut': {'acc': {'αντικείμενα'}, 'gen': {
                     'αντικείμενων'}, 'nom': {'αντικείμενα'}, 'voc': {
                     'αντικείμενα'}}}, 'sg': {'fem': {'acc': {'αντικείμενη'}, 'gen': {
                     'αντικείμενης'}, 'nom': {
                     'αντικείμενη'}, 'voc': {
                     'αντικείμενη'}}, 'masc': {'acc': {'αντικείμενο'}, 'gen': {
                     'αντικείμενου'}, 'nom': {
                     'αντικείμενος'}, 'voc': {
                     'αντικείμενε'}}, 'neut': {
                     'acc': {'αντικείμενο'}, 'gen': {
                         'αντικείμενου'}, 'nom': {
                         'αντικείμενο'}, 'voc': {
                         'αντικείμενο'}}}}, 'present':
                 {'passive': {'imp': {'pl': {'sec': {'αντίκεισθε'}}, 'sg': {'sec': {'αντίκεισο'}}},
                              'ind': {'pl': {'pri': {'αντικείμεθα'}, 'sec': {
                                  'αντίκεισθε'}, 'ter': {
                                  'αντίκεινται'}}, 'sg': {
                                  'pri': {'αντίκειμαι'}, 'sec': {
                                      'αντίκεισαι'}, 'ter': {
                                      'αντίκειται'}}}}}}


        )

    def test_verb_erxomai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('έρχομαι'),
            {'present':
                {'passive':
                    {'ind': {
                        'sg':
                            {'pri': {'έρχομαι'}, 'sec': {'έρχεσαι'}, 'ter': {'έρχεται'}},
                        'pl': {'pri': {'ερχόμαστε'}, 'sec': {'έρχεστε', 'ερχόσαστε'},
                               'ter': {'έρχονται'}}},
                        'imp': {'pl': {'sec': {'έρχεστε'}}}}},
                'conjunctive': {
                    'active': {
                        'ind': {
                            'sg': {'pri': {'έρθω', 'έλθω'},
                                   'sec': {'έρθεις', 'έλθεις'},
                                   'ter': {'έλθει', 'έρθει'}},
                            'pl': {'pri': {'έρθουμε', 'έλθουμε'},
                                   'sec': {'έρθετε', 'έλθετε'},
                                   'ter': {'έρθουνε', 'έρθουν', 'έλθουν', 'έλθουνε'}}},
                        'imp': {'sg': {'sec': {'έλα'}},
                                'pl': {'sec': {'έλθετε', 'έρθετε', 'ελάτε'}}}}},
                'aorist': {
                    'active': {
                        'ind': {'sg': {'pri': {'ήρθα', 'ήλθα'}, 'sec': {'ήλθες', 'ήρθες'}, 'ter': {'ήλθε', 'ήρθε'}},
                                'pl': {'pri': {'ήλθαμε', 'ήρθαμε'}, 'sec': {'ήλθατε', 'ήρθατε'},
                                       'ter': {'ήρθανε', 'ήρθαν', 'ήλθαν', 'ήλθανε'}}}}},
                'paratatikos': {
                    'passive': {
                        'ind': {
                            'sg': {'pri': {'ερχόμουνα', 'ερχόμουν'}, 'sec': {'ερχόσουνα', 'ερχόσουν'},
                                   'ter': {'ερχότανε', 'ερχόταν'}},
                            'pl': {'pri': {'ερχόμασταν', 'ερχόμαστε'}, 'sec': {'ερχόσαστε', 'ερχόσασταν'},
                                   'ter': {'ερχόντουσαν', 'έρχονταν'}}}}},
                'pass_pres_participle': {
                    'sg': {
                        'masc': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενε'}, 'nom': {'ερχόμενος'}, 'acc': {'ερχόμενο'}},
                        'fem': {'gen': {'ερχόμενης'}, 'voc': {'ερχόμενη'}, 'nom': {'ερχόμενη'}, 'acc': {'ερχόμενη'}},
                        'neut': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενο'}, 'nom': {'ερχόμενο'}, 'acc': {'ερχόμενο'}}},
                    'pl': {'masc': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενοι'}, 'nom': {'ερχόμενοι'},
                                    'acc': {'ερχόμενους'}},
                           'fem': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενες'}, 'nom': {'ερχόμενες'},
                                   'acc': {'ερχόμενες'}},
                           'neut': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενα'}, 'nom': {'ερχόμενα'},
                                    'acc': {'ερχόμενα'}}}}}
        )

    def test_verb_tragoudo(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('τραγουδώ')['paratatikos'],
            {'active': {'ind': {'pl': {'pri': {'τραγουδούσαμε', 'τραγουδάγαμε'},
                                       'sec': {'τραγουδούσατε', 'τραγουδάγατε'},
                                       'ter': {'τραγουδάγανε',
                                               'τραγουδούσαν',
                                               'τραγουδούσανε',
                                               'τραγούδαγαν'}},
                                'sg': {'pri': {'τραγούδαγα', 'τραγουδούσα'},
                                       'sec': {'τραγούδαγες', 'τραγουδούσες'},
                                       'ter': {'τραγουδούσε', 'τραγούδαγε'}}}},
             'passive': {'ind': {'pl': {'pri': {'τραγουδιόμασταν', 'τραγουδιόμαστε'},
                                        'sec': {'τραγουδιόσαστε', 'τραγουδιόσασταν'},
                                        'ter': {'τραγουδιούνταν',
                                                'τραγουδιόνταν',
                                                'τραγουδιόντουσαν'}},
                                 'sg': {'pri': {'τραγουδιόμουν', 'τραγουδιόμουνα'},
                                        'sec': {'τραγουδιόσουνα', 'τραγουδιόσουν'},
                                        'ter': {'τραγουδιόταν', 'τραγουδιότανε'}}}}}

        )


    def test_verb_blepo(self):
        self.assertDictEqual(
            verb.create_all_forms('βλέπω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'βλέπω'}, 'sec': {'βλέπεις'}, 'ter': {'βλέπει'}},
                                            'pl': {'pri': {'βλέπουμε'}, 'sec': {'βλέπετε'},
                                                   'ter': {'βλέπουνε', 'βλέπουν'}}},
                                    'imp': {'sg': {'sec': {'βλέπε'}}, 'pl': {'sec': {'βλέπετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'βλέπομαι'}, 'sec': {'βλέπεσαι'}, 'ter': {'βλέπεται'}},
                        'pl': {'pri': {'βλεπόμαστε'}, 'sec': {'βλέπεστε', 'βλεπόσαστε'}, 'ter': {'βλέπονται'}}},
                'imp': {'pl': {'sec': {'βλέπεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'δω'}, 'sec': {'δεις'}, 'ter': {'δει'}},
                        'pl': {'pri': {'δούμε'}, 'sec': {'δείτε'}, 'ter': {'δουν', 'δούνε'}}},
                'imp': {'sg': {'sec': {'δες'}}, 'pl': {'sec': {'δέστε', 'δείτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ιδωθώ'}, 'sec': {'ιδωθείς'}, 'ter': {'ιδωθεί'}},
                        'pl': {'pri': {'ιδωθούμε'}, 'sec': {'ιδωθείτε'}, 'ter': {'ιδωθούνε', 'ιδωθούν'}}},
                'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'ιδωθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'είδα'}, 'sec': {'είδες'}, 'ter': {'είδε'}},
                        'pl': {'pri': {'είδαμε'}, 'sec': {'είδατε'}, 'ter': {'είδανε', 'είδαν'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ειδώθηκα'}, 'sec': {'ειδώθηκες'}, 'ter': {'ειδώθηκε'}},
                        'pl': {'pri': {'ειδωθήκαμε'}, 'sec': {'ειδωθήκατε'}, 'ter': {'ειδωθήκανε', 'ειδώθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έβλεπα'}, 'sec': {'έβλεπες'}, 'ter': {'έβλεπε'}},
                                                'pl': {'pri': {'βλέπαμε'}, 'sec': {'βλέπατε'},
                                                       'ter': {'έβλεπαν', 'βλέπανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'βλεπόμουνα', 'βλεπόμουν'}, 'sec': {'βλεπόσουν', 'βλεπόσουνα'},
                        'ter': {'βλεπόταν', 'βλεπότανε'}},
                 'pl': {'pri': {'βλεπόμαστε', 'βλεπόμασταν'}, 'sec': {'βλεπόσασταν', 'βλεπόσαστε'},
                        'ter': {'βλέπονταν', 'βλεπόντουσαν'}}}}}, 'act_pres_participle': {'βλέποντας'},
             'arch_act_pres_participle': {
                 'sg': {'masc': {'gen': {'βλέποντος'}, 'acc': {'βλέποντα'}, 'voc': {'βλέπων'}, 'nom': {'βλέπων'}},
                        'neut': {'gen': {'βλέποντος'}, 'acc': {'βλέπον'}, 'voc': {'βλέπον'}, 'nom': {'βλέπον'}},
                        'fem': {'gen': {'βλέπουσας'}, 'acc': {'βλέπουσα'}, 'voc': {'βλέπουσα'}, 'nom': {'βλέπουσα'}}},
                 'pl': {
                     'masc': {'gen': {'βλεπόντων'}, 'acc': {'βλέποντες'}, 'voc': {'βλέποντες'}, 'nom': {'βλέποντες'}},
                     'neut': {'gen': {'βλεπόντων'}, 'acc': {'βλέποντα'}, 'voc': {'βλέποντα'}, 'nom': {'βλέποντα'}},
                     'fem': {'gen': {'βλεπουσών'}, 'acc': {'βλέπουσες'}, 'voc': {'βλέπουσες'}, 'nom': {'βλέπουσες'}}}},
             'passive_perfect_participle': {
                 'sg': {'masc': {'gen': {'ιδωμένου'}, 'acc': {'ιδωμένο'}, 'voc': {'ιδωμένε'}, 'nom': {'ιδωμένος'}},
                        'neut': {'gen': {'ιδωμένου'}, 'acc': {'ιδωμένο'}, 'voc': {'ιδωμένο'}, 'nom': {'ιδωμένο'}},
                        'fem': {'gen': {'ιδωμένης'}, 'acc': {'ιδωμένη'}, 'voc': {'ιδωμένη'}, 'nom': {'ιδωμένη'}}},
                 'pl': {'masc': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένους'}, 'voc': {'ιδωμένοι'}, 'nom': {'ιδωμένοι'}},
                        'neut': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένα'}, 'voc': {'ιδωμένα'}, 'nom': {'ιδωμένα'}},
                        'fem': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένες'}, 'voc': {'ιδωμένες'}, 'nom': {'ιδωμένες'}}}}}
        )

    def test_verb_syggrafo(self):
        self.assertDictEqual(
            verb.create_all_forms('συγγράφω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'συγγράφω'}, 'sec': {'συγγράφεις'}, 'ter': {'συγγράφει'}},
                                            'pl': {'pri': {'συγγράφουμε'}, 'sec': {'συγγράφετε'},
                                                   'ter': {'συγγράφουνε', 'συγγράφουν'}}},
                                    'imp': {'sg': {'sec': {'σύγγραφε'}}, 'pl': {'sec': {'συγγράφετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'συγγράφομαι'}, 'sec': {'συγγράφεσαι'}, 'ter': {'συγγράφεται'}},
                        'pl': {'pri': {'συγγραφόμαστε'}, 'sec': {'συγγράφεστε', 'συγγραφόσαστε'},
                               'ter': {'συγγράφονται'}}}, 'imp': {'pl': {'sec': {'συγγράφεστε'}}}}}, 'conjunctive': {
                'active': {'ind': {'sg': {'pri': {'συγγράψω'}, 'sec': {'συγγράψεις'}, 'ter': {'συγγράψει'}},
                                   'pl': {'pri': {'συγγράψουμε'}, 'sec': {'συγγράψετε'},
                                          'ter': {'συγγράψουν', 'συγγράψουνε'}}},
                           'imp': {'sg': {'sec': {'σύγγραψε'}}, 'pl': {'sec': {'συγγράψτε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'συγγραφώ', 'συγγραφτώ'}, 'sec': {'συγγραφτείς', 'συγγραφείς'},
                           'ter': {'συγγραφεί', 'συγγραφτεί'}},
                    'pl': {'pri': {'συγγραφτούμε', 'συγγραφούμε'}, 'sec': {'συγγραφείτε', 'συγγραφτείτε'},
                           'ter': {'συγγραφούνε', 'συγγραφτούνε', 'συγγραφτούν', 'συγγραφούν'}}}, 'imp': {
                    'sg': {'sec': {'συγγράψου'}}, 'pl': {'sec': {'συγγραφείτε', 'συγγραφτείτε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'συνέγραψα'}, 'sec': {'συνέγραψες'}, 'ter': {'συνέγραψε'}},
                                   'pl': {'pri': {'συγγράψαμε'}, 'sec': {'συγγράψατε'},
                                          'ter': {'συνέγραψαν', 'συγγράψανε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'συνεγράφην', 'συγγράφηκα', 'συγγράφτηκα'},
                           'sec': {'συγγράφτηκες', 'συνεγράφης', 'συγγράφηκες'},
                           'ter': {'συγγράφτηκε', 'συγγράφηκε', 'συνεγράφη'}},
                    'pl': {'pri': {'συγγραφτήκαμε', 'συνεγράφημεν', 'συγγραφήκαμε'},
                           'sec': {'συγγραφτήκατε', 'συνεγράφητε', 'συγγραφήκατε'},
                           'ter': {'συγγράφτηκαν', 'συγγράφηκαν', 'συνεγράφησαν', 'συγγραφτήκανε', 'συγγραφήκανε'}}}}},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'συνέγραφα'}, 'sec': {'συνέγραφες'}, 'ter': {'συνέγραφε'}},
                         'pl': {'pri': {'συγγράφαμε'}, 'sec': {'συγγράφατε'}, 'ter': {'συνέγραφαν', 'συγγράφανε'}}}},
                 'passive': {'ind': {'sg': {'pri': {'συγγραφόμουν', 'συγγραφόμουνα'},
                                            'sec': {'συγγραφόσουνα', 'συγγραφόσουν'},
                                            'ter': {'συγγραφότανε', 'συγγραφόταν'}},
                                     'pl': {'pri': {'συγγραφόμαστε', 'συγγραφόμασταν'},
                                            'sec': {'συγγραφόσαστε', 'συγγραφόσασταν'},
                                            'ter': {'συγγράφονταν', 'συγγραφόντουσαν'}}}}},
             'act_pres_participle': {'συγγράφοντας'}, 'active_aorist_participle': {'pl': {
                'fem': {'nom': {'συγγράψασες'}, 'acc': {'συγγράψασες'}, 'voc': {'συγγράψασες'}, 'gen': {'συγγραψασών'}},
                'masc': {'nom': {'συγγράψαντες'}, 'acc': {'συγγράψαντες'}, 'voc': {'συγγράψαντες'},
                         'gen': {'συγγραψάντων'}},
                'neut': {'nom': {'συγγράψαντα'}, 'acc': {'συγγράψαντα'}, 'voc': {'συγγράψαντα'},
                         'gen': {'συγγραψάντων'}}}, 'sg': {
                'fem': {'nom': {'συγγράψασα'}, 'acc': {'συγγράψασα'}, 'voc': {'συγγράψασα'}, 'gen': {'συγγράψασας'}},
                'masc': {'nom': {'συγγράψας'}, 'acc': {'συγγράψαντα'}, 'voc': {'συγγράψας'}, 'gen': {'συγγράψαντος'}},
                'neut': {'nom': {'συγγράψαν'}, 'acc': {'συγγράψαν'}, 'voc': {'συγγράψαν'}, 'gen': {'συγγράψαντος'}}}},
             'pass_pres_participle': {'pl': {
                 'fem': {'nom': {'συγγραφόμενες'}, 'acc': {'συγγραφόμενες'}, 'voc': {'συγγραφόμενες'},
                         'gen': {'συγγραφόμενων'}},
                 'masc': {'nom': {'συγγραφόμενοι'}, 'acc': {'συγγραφόμενους'}, 'voc': {'συγγραφόμενοι'},
                          'gen': {'συγγραφόμενων'}},
                 'neut': {'nom': {'συγγραφόμενα'}, 'acc': {'συγγραφόμενα'}, 'voc': {'συγγραφόμενα'},
                          'gen': {'συγγραφόμενων'}}}, 'sg': {
                 'fem': {'nom': {'συγγραφόμενη'}, 'acc': {'συγγραφόμενη'}, 'voc': {'συγγραφόμενη'},
                         'gen': {'συγγραφόμενης'}},
                 'masc': {'nom': {'συγγραφόμενος'}, 'acc': {'συγγραφόμενο'}, 'voc': {'συγγραφόμενε'},
                          'gen': {'συγγραφόμενου'}},
                 'neut': {'nom': {'συγγραφόμενο'}, 'acc': {'συγγραφόμενο'}, 'voc': {'συγγραφόμενο'},
                          'gen': {'συγγραφόμενου'}}}}, 'passive_perfect_participle': {'pl': {
                'fem': {'nom': {'συγγεγραμμένες'}, 'acc': {'συγγεγραμμένες'}, 'voc': {'συγγεγραμμένες'},
                        'gen': {'συγγεγραμμένων'}},
                'masc': {'nom': {'συγγεγραμμένοι'}, 'acc': {'συγγεγραμμένους'}, 'voc': {'συγγεγραμμένοι'},
                         'gen': {'συγγεγραμμένων'}},
                'neut': {'nom': {'συγγεγραμμένα'}, 'acc': {'συγγεγραμμένα'}, 'voc': {'συγγεγραμμένα'},
                         'gen': {'συγγεγραμμένων'}}}, 'sg': {
                'fem': {'nom': {'συγγεγραμμένη'}, 'acc': {'συγγεγραμμένη'}, 'voc': {'συγγεγραμμένη'},
                        'gen': {'συγγεγραμμένης'}},
                'masc': {'nom': {'συγγεγραμμένος'}, 'acc': {'συγγεγραμμένο'}, 'voc': {'συγγεγραμμένε'},
                         'gen': {'συγγεγραμμένου'}},
                'neut': {'nom': {'συγγεγραμμένο'}, 'acc': {'συγγεγραμμένο'}, 'voc': {'συγγεγραμμένο'},
                         'gen': {'συγγεγραμμένου'}}}}}

        )

    def test_verb_syllambanw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συλλαμβάνω'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'συλλαμβάνω'}, 'sec': {'συλλαμβάνεις'}, 'ter': {'συλλαμβάνει'}},
                        'pl': {'pri': {'συλλαμβάνουμε'}, 'sec': {'συλλαμβάνετε'},
                               'ter': {'συλλαμβάνουν', 'συλλαμβάνουνε'}}},
                'imp': {'sg': {'sec': {'συλλάμβανε'}}, 'pl': {'sec': {'συλλαμβάνετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'συλλαμβάνομαι'}, 'sec': {'συλλαμβάνεσαι'}, 'ter': {'συλλαμβάνεται'}},
                        'pl': {'pri': {'συλλαμβανόμαστε'}, 'sec': {'συλλαμβάνεστε', 'συλλαμβανόσαστε'},
                               'ter': {'συλλαμβάνονται'}}}, 'imp': {'pl': {'sec': {'συλλαμβάνεστε'}}}}},
                'conjunctive': {
                    'active': {'ind': {'sg': {'pri': {'συλλάβω'}, 'sec': {'συλλάβεις'}, 'ter': {'συλλάβει'}},
                                       'pl': {'pri': {'συλλάβουμε'}, 'sec': {'συλλάβετε'},
                                              'ter': {'συλλάβουν', 'συλλάβουνε'}}},
                               'imp': {'sg': {'sec': {'σύλλαβε'}}, 'pl': {'sec': {'συλλάβετε'}}}},
                    'passive': {
                        'ind': {'sg': {'pri': {'συλληφθώ'}, 'sec': {'συλληφθείς'}, 'ter': {'συλληφθεί'}},
                                'pl': {'pri': {'συλληφθούμε'}, 'sec': {'συλληφθείτε'},
                                       'ter': {'συλληφθούν', 'συλληφθούνε'}}},
                        'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'συλληφθείτε'}}}}},
                'aorist': {'active': {
                    'ind': {'sg': {'pri': {'συνέλαβα'}, 'sec': {'συνέλαβες'}, 'ter': {'συνέλαβε'}},
                            'pl': {'pri': {'συλλάβαμε'}, 'sec': {'συλλάβατε'}, 'ter': {'συλλάβανε', 'συνέλαβαν'}}}},
                    'passive': {'ind': {'sg': {
                        'pri': {'συνελήφθην'}, 'sec': {'συνελήφθης'}, 'ter': {'συνελήφθη'}},
                        'pl': {'pri': {'συνελήφθημεν'}, 'sec': {'συνελήφθητε'}, 'ter': {'συνελήφθησαν'}}}}},
                'paratatikos': {'active': {'ind': {
                    'sg': {'pri': {'συνελάμβανα', 'συλλάμβανα'}, 'sec': {'συνελάμβανες', 'συλλάμβανες'},
                           'ter': {'συλλάμβανε', 'συνελάμβανε'}},
                    'pl': {'pri': {'συλλαμβάναμε'}, 'sec': {'συλλαμβάνατε'},
                           'ter': {'συλλαμβάνανε', 'συλλάμβαναν',
                                   'συνελάμβαναν'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'συλλαμβανόμουν', 'συλλαμβανόμουνα'}, 'sec': {'συλλαμβανόσουν', 'συλλαμβανόσουνα'},
                           'ter': {'συλλαμβανόταν', 'συλλαμβανότανε'}},
                    'pl': {'pri': {'συλλαμβανόμασταν', 'συλλαμβανόμαστε'},
                           'sec': {'συλλαμβανόσασταν', 'συλλαμβανόσαστε'},
                           'ter': {'συλλαμβάνονταν', 'συλλαμβανόντουσαν'}}}}},
                'act_pres_participle': {'συλλαμβάνοντας'},
                'passive_aorist_participle': {'sg': {
                    'masc': {'nom': {'συλληφθείς'}, 'gen': {'συλληφθέντος'}, 'voc': {'συλληφθείς'},
                             'acc': {'συλληφθέντα'}},
                    'fem': {'nom': {'συλληφθείσα'}, 'gen': {'συλληφθείσας'}, 'voc': {'συλληφθείσα'},
                            'acc': {'συλληφθείσα'}},
                    'neut': {'nom': {'συλληφθέν'}, 'gen': {'συλληφθέντος'}, 'voc': {'συλληφθέν'},
                             'acc': {'συλληφθέν'}}},
                    'pl': {'masc': {'nom': {'συλληφθέντες'}, 'gen': {'συλληφθέντων'},
                                    'voc': {'συλληφθέντες'}, 'acc': {'συλληφθέντες'}},
                           'fem': {'nom': {'συλληφθείσες'}, 'gen': {'συλληφθεισών'},
                                   'voc': {'συλληφθείσες'}, 'acc': {'συλληφθείσες'}},
                           'neut': {'nom': {'συλληφθέντα'}, 'gen': {'συλληφθέντων'},
                                    'voc': {'συλληφθέντα'}, 'acc': {'συλληφθέντα'}}}},
                'pass_pres_participle': {'sg': {
                    'masc': {'nom': {'συλλαμβανόμενος'}, 'gen': {'συλλαμβανόμενου'}, 'voc': {'συλλαμβανόμενε'},
                             'acc': {'συλλαμβανόμενο'}},
                    'fem': {'nom': {'συλλαμβανόμενη'}, 'gen': {'συλλαμβανόμενης'}, 'voc': {'συλλαμβανόμενη'},
                            'acc': {'συλλαμβανόμενη'}},
                    'neut': {'nom': {'συλλαμβανόμενο'}, 'gen': {'συλλαμβανόμενου'}, 'voc': {'συλλαμβανόμενο'},
                             'acc': {'συλλαμβανόμενο'}}}, 'pl': {
                    'masc': {'nom': {'συλλαμβανόμενοι'}, 'gen': {'συλλαμβανόμενων'}, 'voc': {'συλλαμβανόμενοι'},
                             'acc': {'συλλαμβανόμενους'}},
                    'fem': {'nom': {'συλλαμβανόμενες'}, 'gen': {'συλλαμβανόμενων'}, 'voc': {'συλλαμβανόμενες'},
                            'acc': {'συλλαμβανόμενες'}},
                    'neut': {'nom': {'συλλαμβανόμενα'}, 'gen': {'συλλαμβανόμενων'}, 'voc': {'συλλαμβανόμενα'},
                             'acc': {'συλλαμβανόμενα'}}}}}
        )

    def test_verb_engrafw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('εγγράφω'),
            {'act_pres_participle': {'εγγράφοντας'},
             'active_aorist_participle': {'pl': {'fem': {'acc': {'εγγράψασες'},
                                                         'gen': {'εγγραψασών'},
                                                         'nom': {'εγγράψασες'},
                                                         'voc': {'εγγράψασες'}},
                                                 'masc': {'acc': {'εγγράψαντες'},
                                                          'gen': {'εγγραψάντων'},
                                                          'nom': {'εγγράψαντες'},
                                                          'voc': {'εγγράψαντες'}},
                                                 'neut': {'acc': {'εγγράψαντα'},
                                                          'gen': {'εγγραψάντων'},
                                                          'nom': {'εγγράψαντα'},
                                                          'voc': {'εγγράψαντα'}}},
                                          'sg': {'fem': {'acc': {'εγγράψασα'},
                                                         'gen': {'εγγράψασας'},
                                                         'nom': {'εγγράψασα'},
                                                         'voc': {'εγγράψασα'}},
                                                 'masc': {'acc': {'εγγράψαντα'},
                                                          'gen': {'εγγράψαντος'},
                                                          'nom': {'εγγράψας'},
                                                          'voc': {'εγγράψας'}},
                                                 'neut': {'acc': {'εγγράψαν'},
                                                          'gen': {'εγγράψαντος'},
                                                          'nom': {'εγγράψαν'},
                                                          'voc': {'εγγράψαν'}}}},
             'aorist': {'active': {'ind': {'pl': {'pri': {'εγγράψαμε'},
                                                  'sec': {'εγγράψατε'},
                                                  'ter': {'ενέγραψαν', 'εγγράψανε'}},
                                           'sg': {'pri': {'ενέγραψα'},
                                                  'sec': {'ενέγραψες'},
                                                  'ter': {'ενέγραψε'}}}},
                        'passive': {'ind': {'pl': {'pri': {'εγγραφήκαμε',
                                                           'εγγραφτήκαμε',
                                                           'ενεγράφημεν'},
                                                   'sec': {'εγγραφήκατε',
                                                           'εγγραφτήκατε',
                                                           'ενεγράφητε'},
                                                   'ter': {'εγγράφηκαν',
                                                           'εγγράφτηκαν',
                                                           'εγγραφήκανε',
                                                           'εγγραφτήκανε',
                                                           'ενεγράφησαν'}},
                                            'sg': {'pri': {'εγγράφηκα',
                                                           'εγγράφτηκα',
                                                           'ενεγράφην'},
                                                   'sec': {'εγγράφηκες',
                                                           'εγγράφτηκες',
                                                           'ενεγράφης'},
                                                   'ter': {'εγγράφηκε',
                                                           'εγγράφτηκε',
                                                           'ενεγράφη'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'εγγράφουσες'},
                                                         'gen': {'εγγραφουσών'},
                                                         'nom': {'εγγράφουσες'},
                                                         'voc': {'εγγράφουσες'}},
                                                 'masc': {'acc': {'εγγράφοντες'},
                                                          'gen': {'εγγραφόντων'},
                                                          'nom': {'εγγράφοντες'},
                                                          'voc': {'εγγράφοντες'}},
                                                 'neut': {'acc': {'εγγράφοντα'},
                                                          'gen': {'εγγραφόντων'},
                                                          'nom': {'εγγράφοντα'},
                                                          'voc': {'εγγράφοντα'}}},
                                          'sg': {'fem': {'acc': {'εγγράφουσα'},
                                                         'gen': {'εγγράφουσας'},
                                                         'nom': {'εγγράφουσα'},
                                                         'voc': {'εγγράφουσα'}},
                                                 'masc': {'acc': {'εγγράφοντα'},
                                                          'gen': {'εγγράφοντος'},
                                                          'nom': {'εγγράφων'},
                                                          'voc': {'εγγράφων'}},
                                                 'neut': {'acc': {'εγγράφον'},
                                                          'gen': {'εγγράφοντος'},
                                                          'nom': {'εγγράφον'},
                                                          'voc': {'εγγράφον'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'εγγράψτε'}},
                                                'sg': {'sec': {'έγγραψε'}}},
                                        'ind': {'pl': {'pri': {'εγγράψουμε'},
                                                       'sec': {'εγγράψετε'},
                                                       'ter': {'εγγράψουνε', 'εγγράψουν'}},
                                                'sg': {'pri': {'εγγράψω'},
                                                       'sec': {'εγγράψεις'},
                                                       'ter': {'εγγράψει'}}}},
                             'passive': {'imp': {'pl': {'sec': {'εγγραφείτε',
                                                                'εγγραφτείτε'}},
                                                 'sg': {'sec': {'εγγράψου'}}},
                                         'ind': {'pl': {'pri': {'εγγραφούμε',
                                                                'εγγραφτούμε'},
                                                        'sec': {'εγγραφείτε',
                                                                'εγγραφτείτε'},
                                                        'ter': {'εγγραφούν',
                                                                'εγγραφούνε',
                                                                'εγγραφτούν',
                                                                'εγγραφτούνε'}},
                                                 'sg': {'pri': {'εγγραφώ', 'εγγραφτώ'},
                                                        'sec': {'εγγραφτείς', 'εγγραφείς'},
                                                        'ter': {'εγγραφεί',
                                                                'εγγραφτεί'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'εγγράφαμε'},
                                                       'sec': {'εγγράφατε'},
                                                       'ter': {'έγγραφαν',
                                                               'εγγράφανε',
                                                               'ενέγραφαν'}},
                                                'sg': {'pri': {'έγγραφα', 'ενέγραφα'},
                                                       'sec': {'ενέγραφες', 'έγγραφες'},
                                                       'ter': {'έγγραφε', 'ενέγραφε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'εγγραφόμασταν',
                                                                'εγγραφόμαστε'},
                                                        'sec': {'εγγραφόσασταν',
                                                                'εγγραφόσαστε'},
                                                        'ter': {'εγγράφονταν',
                                                                'εγγραφόντουσαν'}},
                                                 'sg': {'pri': {'εγγραφόμουν',
                                                                'εγγραφόμουνα'},
                                                        'sec': {'εγγραφόσουν',
                                                                'εγγραφόσουνα'},
                                                        'ter': {'εγγραφόταν',
                                                                'εγγραφότανε'}}}}},
             'pass_pres_participle': {'pl': {'fem': {'acc': {'εγγραφόμενες'},
                                                     'gen': {'εγγραφόμενων'},
                                                     'nom': {'εγγραφόμενες'},
                                                     'voc': {'εγγραφόμενες'}},
                                             'masc': {'acc': {'εγγραφόμενους'},
                                                      'gen': {'εγγραφόμενων'},
                                                      'nom': {'εγγραφόμενοι'},
                                                      'voc': {'εγγραφόμενοι'}},
                                             'neut': {'acc': {'εγγραφόμενα'},
                                                      'gen': {'εγγραφόμενων'},
                                                      'nom': {'εγγραφόμενα'},
                                                      'voc': {'εγγραφόμενα'}}},
                                      'sg': {'fem': {'acc': {'εγγραφόμενη'},
                                                     'gen': {'εγγραφόμενης'},
                                                     'nom': {'εγγραφόμενη'},
                                                     'voc': {'εγγραφόμενη'}},
                                             'masc': {'acc': {'εγγραφόμενο'},
                                                      'gen': {'εγγραφόμενου'},
                                                      'nom': {'εγγραφόμενος'},
                                                      'voc': {'εγγραφόμενε'}},
                                             'neut': {'acc': {'εγγραφόμενο'},
                                                      'gen': {'εγγραφόμενου'},
                                                      'nom': {'εγγραφόμενο'},
                                                      'voc': {'εγγραφόμενο'}}}},
             'passive_aorist_participle': {'pl': {'fem': {'acc': {'εγγραφείσες'},
                                                          'gen': {'εγγραφεισών'},
                                                          'nom': {'εγγραφείσες'},
                                                          'voc': {'εγγραφείσες'}},
                                                  'masc': {'acc': {'εγγραφέντες'},
                                                           'gen': {'εγγραφέντων'},
                                                           'nom': {'εγγραφέντες'},
                                                           'voc': {'εγγραφέντες'}},
                                                  'neut': {'acc': {'εγγραφέντα'},
                                                           'gen': {'εγγραφέντων'},
                                                           'nom': {'εγγραφέντα'},
                                                           'voc': {'εγγραφέντα'}}},
                                           'sg': {'fem': {'acc': {'εγγραφείσα'},
                                                          'gen': {'εγγραφείσας'},
                                                          'nom': {'εγγραφείσα'},
                                                          'voc': {'εγγραφείσα'}},
                                                  'masc': {'acc': {'εγγραφέντα'},
                                                           'gen': {'εγγραφέντος'},
                                                           'nom': {'εγγραφείς'},
                                                           'voc': {'εγγραφείς'}},
                                                  'neut': {'acc': {'εγγραφέν'},
                                                           'gen': {'εγγραφέντος'},
                                                           'nom': {'εγγραφέν'},
                                                           'voc': {'εγγραφέν'}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'εγγεγραμμένες',
                                                                   'εγγραμμένες'},
                                                           'gen': {'εγγεγραμμένων',
                                                                   'εγγραμμένων'},
                                                           'nom': {'εγγεγραμμένες',
                                                                   'εγγραμμένες'},
                                                           'voc': {'εγγεγραμμένες',
                                                                   'εγγραμμένες'}},
                                                   'masc': {'acc': {'εγγεγραμμένους',
                                                                    'εγγραμμένους'},
                                                            'gen': {'εγγεγραμμένων',
                                                                    'εγγραμμένων'},
                                                            'nom': {'εγγεγραμμένοι',
                                                                    'εγγραμμένοι'},
                                                            'voc': {'εγγεγραμμένοι',
                                                                    'εγγραμμένοι'}},
                                                   'neut': {'acc': {'εγγεγραμμένα',
                                                                    'εγγραμμένα'},
                                                            'gen': {'εγγεγραμμένων',
                                                                    'εγγραμμένων'},
                                                            'nom': {'εγγεγραμμένα',
                                                                    'εγγραμμένα'},
                                                            'voc': {'εγγεγραμμένα',
                                                                    'εγγραμμένα'}}},
                                            'sg': {'fem': {'acc': {'εγγεγραμμένη',
                                                                   'εγγραμμένη'},
                                                           'gen': {'εγγεγραμμένης',
                                                                   'εγγραμμένης'},
                                                           'nom': {'εγγεγραμμένη',
                                                                   'εγγραμμένη'},
                                                           'voc': {'εγγεγραμμένη',
                                                                   'εγγραμμένη'}},
                                                   'masc': {'acc': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'},
                                                            'gen': {'εγγεγραμμένου',
                                                                    'εγγραμμένου'},
                                                            'nom': {'εγγεγραμμένος',
                                                                    'εγγραμμένος'},
                                                            'voc': {'εγγεγραμμένε',
                                                                    'εγγραμμένε'}},
                                                   'neut': {'acc': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'},
                                                            'gen': {'εγγεγραμμένου',
                                                                    'εγγραμμένου'},
                                                            'nom': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'},
                                                            'voc': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'εγγράφετε'}},
                                            'sg': {'sec': {'έγγραφε'}}},
                                    'ind': {'pl': {'pri': {'εγγράφουμε'},
                                                   'sec': {'εγγράφετε'},
                                                   'ter': {'εγγράφουνε', 'εγγράφουν'}},
                                            'sg': {'pri': {'εγγράφω'},
                                                   'sec': {'εγγράφεις'},
                                                   'ter': {'εγγράφει'}}}},
                         'passive': {'imp': {'pl': {'sec': {'εγγράφεστε'}}},
                                     'ind': {'pl': {'pri': {'εγγραφόμαστε'},
                                                    'sec': {'εγγραφόσαστε', 'εγγράφεστε'},
                                                    'ter': {'εγγράφονται'}},
                                             'sg': {'pri': {'εγγράφομαι'},
                                                    'sec': {'εγγράφεσαι'},
                                                    'ter': {'εγγράφεται'}}}}}}

        )

    def test_verb_phgainw(self):
        self.assertDictEqual(
            verb.create_all_forms('πηγαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'πηγαίνω'}, 'sec': {'πηγαίνεις'}, 'ter': {'πηγαίνει'}},
                                            'pl': {'pri': {'πηγαίνουμε'}, 'sec': {'πηγαίνετε'},
                                                   'ter': {'πηγαίνουνε', 'πηγαίνουν'}}},
                                    'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                   'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'}, 'ter': {'πήγαν', 'πήγανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                                'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                       'ter': {'πηγαίνανε', 'πήγαιναν'}}}}},
             'act_pres_participle': {'πηγαίνοντας'}}
        )

    def test_verb_prokeitai(self):
        self.assertDictEqual(
            verb.create_all_forms('πρόκειται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'πρόκειται'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'επρόκειτο'}}}}}}
        )

    def test_verb_symbainei(self):
        self.assertDictEqual(
            verb.create_all_forms('συμβαίνει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'συμβαίνει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'συμβεί'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'συνέβη'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'συνέβαινε'}}}}}}
        )

    def test_verb_xairw_imper(self):
        self.assertDictEqual(
            verb.create_all_forms('χαίρω')['present']['active']['imp'],
            {'sg': {'sec': {'χαίρε'}}, 'pl': {'sec': {'χαίρετε'}}}

        )

    def test_verb_parkaro(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παρκάρω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παρκάρω'}, 'sec': {'παρκάρεις'}, 'ter': {'παρκάρει'}},
                                            'pl': {'pri': {'παρκάρουμε'}, 'sec': {'παρκάρετε'},
                                                   'ter': {'παρκάρουνε', 'παρκάρουν'}}},
                                    'imp': {'sg': {'sec': {'πάρκαρε'}}, 'pl': {'sec': {'παρκάρετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παρκάρομαι'}, 'sec': {'παρκάρεσαι'}, 'ter': {'παρκάρεται'}},
                        'pl': {'pri': {'παρκαρόμαστε'}, 'sec': {'παρκαρόσαστε', 'παρκάρεστε'}, 'ter': {'παρκάρονται'}}},
                'imp': {'pl': {'sec': {'παρκάρεστε'}}}}}, 'conjunctive': {'active': {'ind': {
                'sg': {'pri': {'παρκαρίσω', 'παρκάρω'}, 'sec': {'παρκάρεις', 'παρκαρίσεις'},
                       'ter': {'παρκάρει', 'παρκαρίσει'}},
                'pl': {'pri': {'παρκάρουμε', 'παρκαρίσουμε'}, 'sec': {'παρκαρίσετε', 'παρκάρετε'},
                       'ter': {'παρκαρίσουνε', 'παρκάρουνε', 'παρκάρουν', 'παρκαρίσουν'}}}, 'imp': {
                'sg': {'sec': {'παρκάρισε', 'πάρκαρε'}}, 'pl': {'sec': {'παρκαρίστε', 'παρκάρετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παρκαριστώ'}, 'sec': {'παρκαριστείς'}, 'ter': {'παρκαριστεί'}},
                        'pl': {'pri': {'παρκαριστούμε'}, 'sec': {'παρκαριστείτε'},
                               'ter': {'παρκαριστούν', 'παρκαριστούνε'}}},
                'imp': {'sg': {'sec': {'παρκαρίσου'}}, 'pl': {'sec': {'παρκαριστείτε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'παρκάρισα', 'πάρκαρα'}, 'sec': {'πάρκαρες', 'παρκάρισες'},
                                          'ter': {'παρκάρισε', 'πάρκαρε'}},
                                   'pl': {'pri': {'παρκάραμε', 'παρκαρίσαμε'}, 'sec': {'παρκάρατε', 'παρκαρίσατε'},
                                          'ter': {'παρκάρισαν', 'παρκαρίσανε', 'πάρκαραν', 'παρκάρανε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'παρκαρίστηκα'}, 'sec': {'παρκαρίστηκες'}, 'ter': {'παρκαρίστηκε'}},
                            'pl': {'pri': {'παρκαριστήκαμε'}, 'sec': {'παρκαριστήκατε'},
                                   'ter': {'παρκαριστήκανε', 'παρκαρίστηκαν'}}}}}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'πάρκαρα'}, 'sec': {'πάρκαρες'}, 'ter': {'πάρκαρε'}},
                        'pl': {'pri': {'παρκάραμε'}, 'sec': {'παρκάρατε'}, 'ter': {'πάρκαραν', 'παρκάρανε'}}}},
                'passive': {'ind': {
                    'sg': {'pri': {
                        'παρκαρόμουνα',
                        'παρκαρόμουν'},
                        'sec': {
                            'παρκαρόσουνα',
                            'παρκαρόσουν'},
                        'ter': {
                            'παρκαρόταν',
                            'παρκαρότανε'}},
                    'pl': {'pri': {
                        'παρκαρόμαστε',
                        'παρκαρόμασταν'},
                        'sec': {
                            'παρκαρόσασταν',
                            'παρκαρόσαστε'},
                        'ter': {
                            'παρκαρόντουσαν',
                            'παρκάρονταν'}}}}},
             'act_pres_participle': {'παρκάροντας'}, 'passive_perfect_participle': {'pl': {
                'neut': {'acc': {'παρκαρισμένα'}, 'nom': {'παρκαρισμένα'}, 'gen': {'παρκαρισμένων'},
                         'voc': {'παρκαρισμένα'}},
                'fem': {'acc': {'παρκαρισμένες'}, 'nom': {'παρκαρισμένες'}, 'gen': {'παρκαρισμένων'},
                        'voc': {'παρκαρισμένες'}},
                'masc': {'acc': {'παρκαρισμένους'}, 'nom': {'παρκαρισμένοι'}, 'gen': {'παρκαρισμένων'},
                         'voc': {'παρκαρισμένοι'}}}, 'sg': {
                'neut': {'acc': {'παρκαρισμένο'}, 'nom': {'παρκαρισμένο'}, 'gen': {'παρκαρισμένου'},
                         'voc': {'παρκαρισμένο'}},
                'fem': {'acc': {'παρκαρισμένη'}, 'nom': {'παρκαρισμένη'}, 'gen': {'παρκαρισμένης'},
                        'voc': {'παρκαρισμένη'}},
                'masc': {'acc': {'παρκαρισμένο'}, 'nom': {'παρκαρισμένος'}, 'gen': {'παρκαρισμένου'},
                         'voc': {'παρκαρισμένε'}}}}}

        )

    def test_verb_apexw(self):
        self.assertDictEqual(
            verb.create_all_forms('απέχω'),
            {'act_pres_participle': {'απέχοντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'απείχαμε'},
                                                  'sec': {'απείχατε'},
                                                  'ter': {'απείχαν', 'απείχανε'}},
                                           'sg': {'pri': {'απείχα'},
                                                  'sec': {'απείχες'},
                                                  'ter': {'απείχε'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'απέχουσες'},
                                                         'gen': {'απεχουσών'},
                                                         'nom': {'απέχουσες'},
                                                         'voc': {'απέχουσες'}},
                                                 'masc': {'acc': {'απέχοντες'},
                                                          'gen': {'απεχόντων'},
                                                          'nom': {'απέχοντες'},
                                                          'voc': {'απέχοντες'}},
                                                 'neut': {'acc': {'απέχοντα'},
                                                          'gen': {'απεχόντων'},
                                                          'nom': {'απέχοντα'},
                                                          'voc': {'απέχοντα'}}},
                                          'sg': {'fem': {'acc': {'απέχουσα'},
                                                         'gen': {'απέχουσας'},
                                                         'nom': {'απέχουσα'},
                                                         'voc': {'απέχουσα'}},
                                                 'masc': {'acc': {'απέχοντα'},
                                                          'gen': {'απέχοντος'},
                                                          'nom': {'απέχων'},
                                                          'voc': {'απέχων'}},
                                                 'neut': {'acc': {'απέχον'},
                                                          'gen': {'απέχοντος'},
                                                          'nom': {'απέχον'},
                                                          'voc': {'απέχον'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'απέχετε'}},
                                                'sg': {'sec': {'άπεχε'}}},
                                        'ind': {'pl': {'pri': {'απέχουμε'},
                                                       'sec': {'απέχετε'},
                                                       'ter': {'απέχουνε', 'απέχουν'}},
                                                'sg': {'pri': {'απέχω'},
                                                       'sec': {'απέχεις'},
                                                       'ter': {'απέχει'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'απείχαμε'},
                                                       'sec': {'απείχατε'},
                                                       'ter': {'απείχαν', 'απείχανε'}},
                                                'sg': {'pri': {'απείχα'},
                                                       'sec': {'απείχες'},
                                                       'ter': {'απείχε'}}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'απέχετε'}},
                                            'sg': {'sec': {'άπεχε'}}},
                                    'ind': {'pl': {'pri': {'απέχουμε'},
                                                   'sec': {'απέχετε'},
                                                   'ter': {'απέχουνε', 'απέχουν'}},
                                            'sg': {'pri': {'απέχω'},
                                                   'sec': {'απέχεις'},
                                                   'ter': {'απέχει'}}}}}}

        )

    def test_verb_kserw(self):
        self.assertDictEqual(
            verb.create_all_forms('ξέρω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'ξέρω'}, 'sec': {'ξέρεις'}, 'ter': {'ξέρει'}},
                                            'pl': {'pri': {'ξέρουμε'}, 'sec': {'ξέρετε'},
                                                   'ter': {'ξέρουν', 'ξέρουνε'}}},
                                    'imp': {'sg': {'sec': {'ξέρε'}}, 'pl': {'sec': {'ξέρετε'}}}}}, 'conjunctive': {},
             'aorist': {}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'ήξερα'}, 'sec': {'ήξερες'}, 'ter': {'ήξερε'}},
                        'pl': {'pri': {'ξέραμε'}, 'sec': {'ξέρατε'}, 'ter': {'ξέρανε', 'ήξεραν'}}}}},
             'act_pres_participle': {'ξέροντας'}}

        )

    def test_verb_synistwmai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συνιστώμαι')['conjunctive']["passive"],
            {'ind': {'sg': {'pri': {'συσταθώ'}, 'sec': {'συσταθείς'}, 'ter': {'συσταθεί'}},
                     'pl': {'pri': {'συσταθούμε'}, 'sec': {'συσταθείτε'}, 'ter': {'συσταθούν', 'συσταθούνε'}}},
             'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'συσταθείτε'}}}}

        )

    def test_verb_pairnw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παίρνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παίρνω'}, 'sec': {'παίρνεις'}, 'ter': {'παίρνει'}},
                                            'pl': {'pri': {'παίρνουμε'}, 'sec': {'παίρνετε'},
                                                   'ter': {'παίρνουνε', 'παίρνουν'}}},
                                    'imp': {'sg': {'sec': {'παίρνε'}}, 'pl': {'sec': {'παίρνετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παίρνομαι'}, 'sec': {'παίρνεσαι'}, 'ter': {'παίρνεται'}},
                        'pl': {'pri': {'παιρνόμαστε'}, 'sec': {'παίρνεστε', 'παιρνόσαστε'}, 'ter': {'παίρνονται'}}},
                'imp': {'pl': {'sec': {'παίρνεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'πάρω'}, 'sec': {'πάρεις'}, 'ter': {'πάρει'}},
                        'pl': {'pri': {'πάρουμε'}, 'sec': {'πάρετε'}, 'ter': {'πάρουνε', 'πάρουν'}}},
                'imp': {'sg': {'sec': {'πάρε'}}, 'pl': {'sec': {'πάρτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παρθώ'}, 'sec': {'παρθείς'}, 'ter': {'παρθεί'}},
                        'pl': {'pri': {'παρθούμε'}, 'sec': {'παρθείτε'}, 'ter': {'παρθούνε', 'παρθούν'}}},
                'imp': {'sg': {'sec': {'πάρσου'}}, 'pl': {'sec': {'παρθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'πήρα'}, 'sec': {'πήρες'}, 'ter': {'πήρε'}},
                        'pl': {'pri': {'πήραμε'}, 'sec': {'πήρατε'}, 'ter': {'πήραν', 'πήρανε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'πάρθηκα'}, 'sec': {'πάρθηκες'}, 'ter': {'πάρθηκε'}},
                        'pl': {'pri': {'παρθήκαμε'}, 'sec': {'παρθήκατε'}, 'ter': {'παρθήκανε', 'πάρθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έπαιρνα'}, 'sec': {'έπαιρνες'}, 'ter': {'έπαιρνε'}},
                                                'pl': {'pri': {'παίρναμε'}, 'sec': {'παίρνατε'},
                                                       'ter': {'έπαιρναν', 'παίρνανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'παιρνόμουνα', 'παιρνόμουν'}, 'sec': {'παιρνόσουνα', 'παιρνόσουν'},
                        'ter': {'παιρνότανε', 'παιρνόταν'}},
                 'pl': {'pri': {'παιρνόμαστε', 'παιρνόμασταν'}, 'sec': {'παιρνόσασταν', 'παιρνόσαστε'},
                        'ter': {'παίρνονταν', 'παιρνόντουσαν'}}}}}, 'act_pres_participle': {'παίρνοντας'},
             'passive_perfect_participle': {
                 'sg': {'fem': {'gen': {'παρμένης'}, 'acc': {'παρμένη'}, 'voc': {'παρμένη'}, 'nom': {'παρμένη'}},
                        'masc': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένε'}, 'nom': {'παρμένος'}},
                        'neut': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένο'}, 'nom': {'παρμένο'}}},
                 'pl': {'fem': {'gen': {'παρμένων'}, 'acc': {'παρμένες'}, 'voc': {'παρμένες'}, 'nom': {'παρμένες'}},
                        'masc': {'gen': {'παρμένων'}, 'acc': {'παρμένους'}, 'voc': {'παρμένοι'}, 'nom': {'παρμένοι'}},
                        'neut': {'gen': {'παρμένων'}, 'acc': {'παρμένα'}, 'voc': {'παρμένα'}, 'nom': {'παρμένα'}}}}},

        )

    def test_verb_spaw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('σπάω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'σπάω'}, 'sec': {'σπας'}, 'ter': {'σπάει'}},
                                            'pl': {'pri': {'σπάμε'}, 'sec': {'σπάτε'}, 'ter': {'σπαν', 'σπάνε'}}},
                                    'imp': {'sg': {'sec': {'σπάγε'}}, 'pl': {'sec': {'σπάγετε', 'σπάτε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'σπάσω'}, 'sec': {'σπάσεις'}, 'ter': {'σπάσει'}},
                                                'pl': {'pri': {'σπάσουμε'}, 'sec': {'σπάσετε'},
                                                       'ter': {'σπάσουνε', 'σπάσουν'}}},
                                        'imp': {'sg': {'sec': {'σπάσε'}}, 'pl': {'sec': {'σπάστε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'σπαστώ', 'σπασθώ'}, 'sec': {'σπασθείς', 'σπαστείς'},
                                'ter': {'σπασθεί', 'σπαστεί'}},
                         'pl': {'pri': {'σπαστούμε', 'σπασθούμε'}, 'sec': {'σπαστείτε', 'σπασθείτε'},
                                'ter': {'σπασθούνε', 'σπαστούνε', 'σπασθούν', 'σπαστούν'}}},
                 'imp': {'sg': {'sec': {'σπάσου'}}, 'pl': {'sec': {'σπαστείτε', 'σπασθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'έσπασα'}, 'sec': {'έσπασες'}, 'ter': {'έσπασε'}},
                        'pl': {'pri': {'σπάσαμε'}, 'sec': {'σπάσατε'}, 'ter': {'έσπασαν', 'σπάσανε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'σπάστηκα', 'σπάσθηκα'}, 'sec': {'σπάσθηκες', 'σπάστηκες'},
                               'ter': {'σπάσθηκε', 'σπάστηκε'}},
                        'pl': {'pri': {'σπασθήκαμε', 'σπαστήκαμε'}, 'sec': {'σπαστήκατε', 'σπασθήκατε'},
                               'ter': {'σπαστήκανε', 'σπασθήκανε', 'σπάστηκαν', 'σπάσθηκαν'}}}}}, 'paratatikos': {
                'active': {'ind': {'sg': {'pri': {'έσπαγα'}, 'sec': {'έσπαγες'}, 'ter': {'έσπαγε'}},
                                   'pl': {'pri': {'σπάγαμε'}, 'sec': {'σπάγατε'}, 'ter': {'σπάγανε', 'έσπαγαν'}}}}},
             'act_pres_participle': {'σπάγοντας'}, 'passive_perfect_participle': {
                'pl': {'fem': {'gen': {'σπασμένων'}, 'nom': {'σπασμένες'}, 'voc': {'σπασμένες'}, 'acc': {'σπασμένες'}},
                       'neut': {'gen': {'σπασμένων'}, 'nom': {'σπασμένα'}, 'voc': {'σπασμένα'}, 'acc': {'σπασμένα'}},
                       'masc': {'gen': {'σπασμένων'}, 'nom': {'σπασμένοι'}, 'voc': {'σπασμένοι'},
                                'acc': {'σπασμένους'}}},
                'sg': {'fem': {'gen': {'σπασμένης'}, 'nom': {'σπασμένη'}, 'voc': {'σπασμένη'}, 'acc': {'σπασμένη'}},
                       'neut': {'gen': {'σπασμένου'}, 'nom': {'σπασμένο'}, 'voc': {'σπασμένο'}, 'acc': {'σπασμένο'}},
                       'masc': {'gen': {'σπασμένου'}, 'nom': {'σπασμένος'}, 'voc': {'σπασμένε'}, 'acc': {'σπασμένο'}}}}}

        )

    def test_verb_plhttw(self):
        self.assertDictEqual(
            verb.create_all_forms('εκπλήττω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'εκπλήττω'}, 'sec': {'εκπλήττεις'}, 'ter': {'εκπλήττει'}},
                                            'pl': {'pri': {'εκπλήττουμε'}, 'sec': {'εκπλήττετε'},
                                                   'ter': {'εκπλήττουν', 'εκπλήττουνε'}}},
                                    'imp': {'sg': {'sec': {'έκπληττε'}}, 'pl': {'sec': {'εκπλήττετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'εκπλήττομαι'}, 'sec': {'εκπλήττεσαι'}, 'ter': {'εκπλήττεται'}},
                        'pl': {'pri': {'εκπληττόμαστε'}, 'sec': {'εκπλήττεστε', 'εκπληττόσαστε'},
                               'ter': {'εκπλήττονται'}}}, 'imp': {'pl': {'sec': {'εκπλήττεστε'}}}}}, 'conjunctive': {
                'active': {'ind': {'sg': {'pri': {'εκπλήξω'}, 'sec': {'εκπλήξεις'}, 'ter': {'εκπλήξει'}},
                                   'pl': {'pri': {'εκπλήξουμε'}, 'sec': {'εκπλήξετε'},
                                          'ter': {'εκπλήξουν', 'εκπλήξουνε'}}},
                           'imp': {'sg': {'sec': {'έκπληξε'}}, 'pl': {'sec': {'εκπλήξτε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'εκπλαγώ'}, 'sec': {'εκπλαγείς'}, 'ter': {'εκπλαγεί'}},
                            'pl': {'pri': {'εκπλαγούμε'}, 'sec': {'εκπλαγείτε'}, 'ter': {'εκπλαγούν', 'εκπλαγούνε'}}},
                    'imp': {'sg': {'sec': {'εκπλήξου'}}, 'pl': {'sec': {'εκπλαγείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'εξέπληξα'}, 'sec': {'εξέπληξες'}, 'ter': {'εξέπληξε'}},
                        'pl': {'pri': {'εκπλήξαμε'}, 'sec': {'εκπλήξατε'}, 'ter': {'εξέπληξαν', 'εκπλήξανε'}}}},
                'passive': {
                    'ind': {
                        'sg': {
                            'pri': {
                                'εξεπλάγην'},
                            'sec': {
                                'εξεπλάγης'},
                            'ter': {
                                'εξεπλάγη'}},
                        'pl': {
                            'pri': {
                                'εξεπλάγημεν'},
                            'sec': {
                                'εξεπλάγητε'},
                            'ter': {
                                'εξεπλάγησαν'}}}}},
             'paratatikos': {'active': {'ind': {
                 'sg': {'pri': {'έκπληττα', 'εξέπληττα'}, 'sec': {'εξέπληττες', 'έκπληττες'},
                        'ter': {'έκπληττε', 'εξέπληττε'}}, 'pl': {'pri': {'εκπλήτταμε'}, 'sec': {'εκπλήττατε'},
                                                                  'ter': {'εκπλήττανε', 'εξέπλητταν', 'έκπλητταν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'εκπληττόμουν', 'εκπληττόμουνα'},
                                            'sec': {'εκπληττόσουν', 'εκπληττόσουνα'},
                                            'ter': {'εκπληττόταν', 'εκπληττότανε'}},
                                     'pl': {'pri': {'εκπληττόμαστε', 'εκπληττόμασταν'},
                                            'sec': {'εκπληττόσασταν', 'εκπληττόσαστε'},
                                            'ter': {'εκπλήττονταν', 'εκπληττόντουσαν'}}}}},
             'act_pres_participle': {'εκπλήττοντας'}, 'passive_aorist_participle': {'sg': {
                'masc': {'nom': {'εκπλαγείς'}, 'gen': {'εκπλαγέντος'}, 'acc': {'εκπλαγέντα'}, 'voc': {'εκπλαγείς'}},
                'fem': {'nom': {'εκπλαγείσα'}, 'gen': {'εκπλαγείσας'}, 'acc': {'εκπλαγείσα'}, 'voc': {'εκπλαγείσα'}},
                'neut': {'nom': {'εκπλαγέν'}, 'gen': {'εκπλαγέντος'}, 'acc': {'εκπλαγέν'}, 'voc': {'εκπλαγέν'}}},
                'pl': {
                    'masc': {'nom': {'εκπλαγέντες'},
                             'gen': {'εκπλαγέντων'},
                             'acc': {'εκπλαγέντες'},
                             'voc': {
                                 'εκπλαγέντες'}},
                    'fem': {'nom': {'εκπλαγείσες'},
                            'gen': {'εκπλαγεισών'},
                            'acc': {'εκπλαγείσες'},
                            'voc': {'εκπλαγείσες'}},
                    'neut': {'nom': {'εκπλαγέντα'},
                             'gen': {'εκπλαγέντων'},
                             'acc': {'εκπλαγέντα'},
                             'voc': {
                                 'εκπλαγέντα'}}}},
             'pass_pres_participle': {'sg': {
                 'masc': {'nom': {'εκπληττόμενος'}, 'gen': {'εκπληττόμενου'}, 'acc': {'εκπληττόμενο'},
                          'voc': {'εκπληττόμενε'}},
                 'fem': {'nom': {'εκπληττόμενη'}, 'gen': {'εκπληττόμενης'}, 'acc': {'εκπληττόμενη'},
                         'voc': {'εκπληττόμενη'}},
                 'neut': {'nom': {'εκπληττόμενο'}, 'gen': {'εκπληττόμενου'}, 'acc': {'εκπληττόμενο'},
                          'voc': {'εκπληττόμενο'}}}, 'pl': {
                 'masc': {'nom': {'εκπληττόμενοι'}, 'gen': {'εκπληττόμενων'}, 'acc': {'εκπληττόμενους'},
                          'voc': {'εκπληττόμενοι'}},
                 'fem': {'nom': {'εκπληττόμενες'}, 'gen': {'εκπληττόμενων'}, 'acc': {'εκπληττόμενες'},
                         'voc': {'εκπληττόμενες'}},
                 'neut': {'nom': {'εκπληττόμενα'}, 'gen': {'εκπληττόμενων'}, 'acc': {'εκπληττόμενα'},
                          'voc': {'εκπληττόμενα'}}}}, 'passive_perfect_participle': {'sg': {
                'masc': {'nom': {'εκπεπληγμένος'}, 'gen': {'εκπεπληγμένου'}, 'acc': {'εκπεπληγμένο'},
                         'voc': {'εκπεπληγμένε'}},
                'fem': {'nom': {'εκπεπληγμένη'}, 'gen': {'εκπεπληγμένης'}, 'acc': {'εκπεπληγμένη'},
                        'voc': {'εκπεπληγμένη'}},
                'neut': {'nom': {'εκπεπληγμένο'}, 'gen': {'εκπεπληγμένου'}, 'acc': {'εκπεπληγμένο'},
                         'voc': {'εκπεπληγμένο'}}}, 'pl': {
                'masc': {'nom': {'εκπεπληγμένοι'}, 'gen': {'εκπεπληγμένων'}, 'acc': {'εκπεπληγμένους'},
                         'voc': {'εκπεπληγμένοι'}},
                'fem': {'nom': {'εκπεπληγμένες'}, 'gen': {'εκπεπληγμένων'}, 'acc': {'εκπεπληγμένες'},
                        'voc': {'εκπεπληγμένες'}},
                'neut': {'nom': {'εκπεπληγμένα'}, 'gen': {'εκπεπληγμένων'}, 'acc': {'εκπεπληγμένα'},
                         'voc': {'εκπεπληγμένα'}}}}}

        )

    def test_verb_paraballo_con(self):
        self.assertDictEqual(
            verb.create_all_forms('παραβάλλω')['conjunctive']['passive'],
            {'ind': {'sg': {'pri': {'παραβληθώ'}, 'sec': {'παραβληθείς'}, 'ter': {'παραβληθεί'}},
                     'pl': {'pri': {'παραβληθούμε'}, 'sec': {'παραβληθείτε'}, 'ter': {'παραβληθούνε', 'παραβληθούν'}}},
             'imp': {'sg': {'sec': {'παραβλήσου'}}, 'pl': {'sec': {'παραβληθείτε'}}}}

        )

    def test_verb_symmetexo_aorist(self):
        self.assertDictEqual(
            verb.create_all_forms('συμμετέχω')['conjunctive'],
            {'active': {'imp': {'pl': {'sec': {'συμμετέχετε', 'συμμετάσχετε'}},
                                'sg': {'sec': {'συμμέτασχε', 'συμμέτεχε'}}},
                        'ind': {'pl': {'pri': {'συμμετέχουμε', 'συμμετάσχουμε'},
                                       'sec': {'συμμετέχετε', 'συμμετάσχετε'},
                                       'ter': {'συμμετάσχουν',
                                               'συμμετάσχουνε',
                                               'συμμετέχουν',
                                               'συμμετέχουνε'}},
                                'sg': {'pri': {'συμμετάσχω', 'συμμετέχω'},
                                       'sec': {'συμμετάσχεις', 'συμμετέχεις'},
                                       'ter': {'συμμετάσχει', 'συμμετέχει'}}}}}

        )

    def test_verb_sympitw_aor(self):
        self.assertDictEqual(
            verb.create_all_forms('συμπίπτω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'συνέπεσα'}, 'sec': {'συνέπεσες'}, 'ter': {'συνέπεσε'}},
                                'pl': {'pri': {'συμπέσαμε'}, 'sec': {'συμπέσατε'}, 'ter': {'συνέπεσαν', 'συμπέσανε'}}}}},

        )

    def test_verb_anameignuw(self):
        self.assertDictEqual(
            verb.create_all_forms('αναμειγνύω'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'αναμειγνύω'}, 'sec': {'αναμειγνύεις'}, 'ter': {'αναμειγνύει'}},
                        'pl': {'pri': {'αναμειγνύουμε'}, 'sec': {'αναμειγνύετε'},
                               'ter': {'αναμειγνύουνε', 'αναμειγνύουν'}}},
                'imp': {'sg': {'sec': {'αναμείγνυε'}}, 'pl': {'sec': {'αναμειγνύετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'αναμειγνύομαι'}, 'sec': {'αναμειγνύεσαι'}, 'ter': {'αναμειγνύεται'}},
                        'pl': {'pri': {'αναμειγνυόμαστε'}, 'sec': {'αναμειγνύεστε', 'αναμειγνυόσαστε'},
                               'ter': {'αναμειγνύονται'}}}, 'imp': {'pl': {'sec': {'αναμειγνύεστε'}}}}},
                'conjunctive': {'active': {
                    'ind': {'sg': {'pri': {'αναμείξω'}, 'sec': {'αναμείξεις'}, 'ter': {'αναμείξει'}},
                            'pl': {'pri': {'αναμείξουμε'}, 'sec': {'αναμείξετε'},
                                   'ter': {'αναμείξουν', 'αναμείξουνε'}}},
                    'imp': {'sg': {'sec': {'ανάμειξε'}}, 'pl': {'sec': {'αναμείξτε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'αναμειχθώ'}, 'sec': {'αναμειχθείς'}, 'ter': {'αναμειχθεί'}},
                            'pl': {'pri': {'αναμειχθούμε'}, 'sec': {'αναμειχθείτε'},
                                   'ter': {'αναμειχθούνε', 'αναμειχθούν'}}},
                    'imp': {'sg': {'sec': {'αναμείξου'}}, 'pl': {'sec': {'αναμειχθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'ανέμειξα', 'ανάμειξα'}, 'sec': {'ανάμειξες', 'ανέμειξες'},
                               'ter': {'ανέμειξε', 'ανάμειξε'}}, 'pl': {'pri': {'αναμείξαμε'}, 'sec': {'αναμείξατε'},
                                                                        'ter': {'ανέμειξαν', 'αναμείξανε',
                                                                                'ανάμειξαν'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'αναμείχθηκα'}, 'sec': {'αναμείχθηκες'}, 'ter': {'αναμείχθηκε'}},
                        'pl': {'pri': {'αναμειχθήκαμε'}, 'sec': {'αναμειχθήκατε'},
                               'ter': {'αναμειχθήκανε', 'αναμείχθηκαν'}}}}}, 'paratatikos': {'active': {'ind': {
                'sg': {'pri': {'αναμείγνυα'}, 'sec': {'αναμείγνυες'},
                       'ter': {'αναμείγνυε'}},
                'pl': {'pri': {'αναμειγνύαμε'}, 'sec': {'αναμειγνύατε'},
                       'ter': {'αναμείγνυαν', 'αναμειγνύανε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'αναμειγνυόμουν', 'αναμειγνυόμουνα'}, 'sec': {'αναμειγνυόσουν', 'αναμειγνυόσουνα'},
                       'ter': {'αναμειγνυότανε', 'αναμειγνυόταν'}},
                'pl': {'pri': {'αναμειγνυόμασταν', 'αναμειγνυόμαστε'}, 'sec': {'αναμειγνυόσασταν', 'αναμειγνυόσαστε'},
                       'ter': {'αναμειγνυόντουσαν', 'αναμείγνυονταν'}}}}}, 'act_pres_participle': {'αναμειγνύοντας'},
                'passive_aorist_participle': {'sg': {
                    'neut': {'acc': {'αναμειχθέν'}, 'voc': {'αναμειχθέν'}, 'gen': {'αναμειχθέντος'},
                             'nom': {'αναμειχθέν'}},
                    'fem': {'acc': {'αναμειχθείσα'}, 'voc': {'αναμειχθείσα'}, 'gen': {'αναμειχθείσας'},
                            'nom': {'αναμειχθείσα'}},
                    'masc': {'acc': {'αναμειχθέντα'}, 'voc': {'αναμειχθείς'}, 'gen': {'αναμειχθέντος'},
                             'nom': {'αναμειχθείς'}}}, 'pl': {
                    'neut': {'acc': {'αναμειχθέντα'}, 'voc': {'αναμειχθέντα'}, 'gen': {'αναμειχθέντων'},
                             'nom': {'αναμειχθέντα'}},
                    'fem': {'acc': {'αναμειχθείσες'}, 'voc': {'αναμειχθείσες'}, 'gen': {'αναμειχθεισών'},
                            'nom': {'αναμειχθείσες'}},
                    'masc': {'acc': {'αναμειχθέντες'}, 'voc': {'αναμειχθέντες'}, 'gen': {'αναμειχθέντων'},
                             'nom': {'αναμειχθέντες'}}}}, 'pass_pres_participle': {'sg': {
                'neut': {'acc': {'αναμειγνυόμενο'}, 'voc': {'αναμειγνυόμενο'}, 'gen': {'αναμειγνυόμενου'},
                         'nom': {'αναμειγνυόμενο'}},
                'fem': {'acc': {'αναμειγνυόμενη'}, 'voc': {'αναμειγνυόμενη'}, 'gen': {'αναμειγνυόμενης'},
                        'nom': {'αναμειγνυόμενη'}},
                'masc': {'acc': {'αναμειγνυόμενο'}, 'voc': {'αναμειγνυόμενε'}, 'gen': {'αναμειγνυόμενου'},
                         'nom': {'αναμειγνυόμενος'}}}, 'pl': {
                'neut': {'acc': {'αναμειγνυόμενα'}, 'voc': {'αναμειγνυόμενα'}, 'gen': {'αναμειγνυόμενων'},
                         'nom': {'αναμειγνυόμενα'}},
                'fem': {'acc': {'αναμειγνυόμενες'}, 'voc': {'αναμειγνυόμενες'}, 'gen': {'αναμειγνυόμενων'},
                        'nom': {'αναμειγνυόμενες'}},
                'masc': {'acc': {'αναμειγνυόμενους'}, 'voc': {'αναμειγνυόμενοι'}, 'gen': {'αναμειγνυόμενων'},
                         'nom': {'αναμειγνυόμενοι'}}}}, 'passive_perfect_participle': {'sg': {
                'neut': {'acc': {'αναμεμειγμένο', 'αναμειγμένο'}, 'voc': {'αναμεμειγμένο', 'αναμειγμένο'},
                         'gen': {'αναμειγμένου', 'αναμεμειγμένου'}, 'nom': {'αναμεμειγμένο', 'αναμειγμένο'}},
                'fem': {'acc': {'αναμεμειγμένη', 'αναμειγμένη'}, 'voc': {'αναμεμειγμένη', 'αναμειγμένη'},
                        'gen': {'αναμεμειγμένης', 'αναμειγμένης'}, 'nom': {'αναμεμειγμένη', 'αναμειγμένη'}},
                'masc': {'acc': {'αναμεμειγμένο', 'αναμειγμένο'}, 'voc': {'αναμεμειγμένε', 'αναμειγμένε'},
                         'gen': {'αναμειγμένου', 'αναμεμειγμένου'}, 'nom': {'αναμειγμένος', 'αναμεμειγμένος'}}}, 'pl': {
                'neut': {'acc': {'αναμειγμένα', 'αναμεμειγμένα'}, 'voc': {'αναμειγμένα', 'αναμεμειγμένα'},
                         'gen': {'αναμειγμένων', 'αναμεμειγμένων'}, 'nom': {'αναμειγμένα', 'αναμεμειγμένα'}},
                'fem': {'acc': {'αναμεμειγμένες', 'αναμειγμένες'}, 'voc': {'αναμεμειγμένες', 'αναμειγμένες'},
                        'gen': {'αναμειγμένων', 'αναμεμειγμένων'}, 'nom': {'αναμεμειγμένες', 'αναμειγμένες'}},
                'masc': {'acc': {'αναμεμειγμένους', 'αναμειγμένους'}, 'voc': {'αναμειγμένοι', 'αναμεμειγμένοι'},
                         'gen': {'αναμειγμένων', 'αναμεμειγμένων'}, 'nom': {'αναμειγμένοι', 'αναμεμειγμένοι'}}}}}

        )

    def test_verb_antilambanomai_imp(self):
        self.assertDictEqual(
            verb.create_all_forms('αντιλαμβάνομαι')['conjunctive']['passive']['imp'],
            {'sg': {'sec': {'αντιλήψου'}}, 'pl': {'sec': {'αντιληφθείτε'}}}

        )

    def test_verb_teleiwnw(self):
        self.assertDictEqual(

            verb.create_all_forms('τελειώνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'τελειώνω'}, 'sec': {'τελειώνεις'}, 'ter': {'τελειώνει'}},
                                            'pl': {'pri': {'τελειώνουμε'}, 'sec': {'τελειώνετε'},
                                                   'ter': {'τελειώνουνε', 'τελειώνουν'}}},
                                    'imp': {'sg': {'sec': {'τελείωνε', 'τέλειωνε'}}, 'pl': {'sec': {'τελειώνετε'}}}},
                         'passive': {
                             'ind': {'sg': {'pri': {'τελειώνομαι'}, 'sec': {'τελειώνεσαι'}, 'ter': {'τελειώνεται'}},
                                     'pl': {'pri': {'τελειωνόμαστε'}, 'sec': {'τελειωνόσαστε', 'τελειώνεστε'},
                                            'ter': {'τελειώνονται'}}}, 'imp': {'pl': {'sec': {'τελειώνεστε'}}}}},
             'conjunctive': {'active': {
                 'ind': {'sg': {'pri': {'τελειώσω'}, 'sec': {'τελειώσεις'}, 'ter': {'τελειώσει'}},
                         'pl': {'pri': {'τελειώσουμε'}, 'sec': {'τελειώσετε'}, 'ter': {'τελειώσουν', 'τελειώσουνε'}}},
                 'imp': {'sg': {'sec': {'τελείωσε', 'τέλειωσε'}}, 'pl': {'sec': {'τελειώστε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'τελειωθώ'}, 'sec': {'τελειωθείς'}, 'ter': {'τελειωθεί'}},
                         'pl': {'pri': {'τελειωθούμε'}, 'sec': {'τελειωθείτε'}, 'ter': {'τελειωθούν', 'τελειωθούνε'}}},
                 'imp': {'sg': {'sec': {'τελειώσου'}}, 'pl': {'sec': {'τελειωθείτε'}}}}}, 'aorist': {'active': {'ind': {
                'sg': {'pri': {'τέλειωσα', 'τελείωσα'}, 'sec': {'τέλειωσες', 'τελείωσες'},
                       'ter': {'τελείωσε', 'τέλειωσε'}},
                'pl': {'pri': {'τελειώσαμε'}, 'sec': {'τελειώσατε'}, 'ter': {'τελείωσαν', 'τέλειωσαν', 'τελειώσανε'}}}},
                'passive': {
                    'ind': {'sg': {
                        'pri': {
                            'τελειώθηκα'},
                        'sec': {
                            'τελειώθηκες'},
                        'ter': {
                            'τελειώθηκε'}},
                        'pl': {
                            'pri': {
                                'τελειωθήκαμε'},
                            'sec': {
                                'τελειωθήκατε'},
                            'ter': {
                                'τελειώθηκαν',
                                'τελειωθήκανε'}}}}},
             'paratatikos': {'active': {'ind': {
                 'sg': {'pri': {'τέλειωνα', 'τελείωνα'}, 'sec': {'τέλειωνες', 'τελείωνες'},
                        'ter': {'τελείωνε', 'τέλειωνε'}}, 'pl': {'pri': {'τελειώναμε'}, 'sec': {'τελειώνατε'},
                                                                 'ter': {'τέλειωναν', 'τελειώνανε', 'τελείωναν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'τελειωνόμουνα', 'τελειωνόμουν'},
                                            'sec': {'τελειωνόσουνα', 'τελειωνόσουν'},
                                            'ter': {'τελειωνόταν', 'τελειωνότανε'}},
                                     'pl': {'pri': {'τελειωνόμαστε', 'τελειωνόμασταν'},
                                            'sec': {'τελειωνόσαστε', 'τελειωνόσασταν'},
                                            'ter': {'τελειώνονταν', 'τελειωνόντουσαν'}}}}},
             'act_pres_participle': {'τελειώνοντας'}, 'passive_perfect_participle': {'sg': {
                'masc': {'nom': {'τελειωμένος'}, 'acc': {'τελειωμένο'}, 'voc': {'τελειωμένε'}, 'gen': {'τελειωμένου'}},
                'fem': {'nom': {'τελειωμένη'}, 'acc': {'τελειωμένη'}, 'voc': {'τελειωμένη'}, 'gen': {'τελειωμένης'}},
                'neut': {'nom': {'τελειωμένο'}, 'acc': {'τελειωμένο'}, 'voc': {'τελειωμένο'}, 'gen': {'τελειωμένου'}}},
                'pl': {'masc': {
                    'nom': {'τελειωμένοι'},
                    'acc': {'τελειωμένους'},
                    'voc': {'τελειωμένοι'},
                    'gen': {'τελειωμένων'}},
                    'fem': {
                        'nom': {'τελειωμένες'},
                        'acc': {'τελειωμένες'},
                        'voc': {'τελειωμένες'},
                        'gen': {'τελειωμένων'}},
                    'neut': {
                        'nom': {'τελειωμένα'},
                        'acc': {'τελειωμένα'},
                        'voc': {'τελειωμένα'},
                        'gen': {
                            'τελειωμένων'}}}}}

        )

    def test_verb_epitithemai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('επιτίθεμαι'),
            {'present': {'passive': {
                'ind': {'sg': {'pri': {'επιτίθεμαι'}, 'sec': {'επιτίθεσαι'}, 'ter': {'επιτίθεται'}},
                        'pl': {'pri': {'επιτιθέμεθα'}, 'sec': {'επιτίθεσθε'}, 'ter': {'επιτίθενται'}}},
                'imp': {'sg': {'sec': {'επιτίθεσο'}}, 'pl': {'sec': {'επιτίθεσθε'}}}}}, 'conjunctive': {'passive': {
                'ind': {'sg': {'pri': {'επιτεθώ'}, 'sec': {'επιτεθείς'}, 'ter': {'επιτεθεί'}},
                        'pl': {'pri': {'επιτεθούμε'}, 'sec': {'επιτεθείτε'}, 'ter': {'επιτεθούν', 'επιτεθούνε'}}},
                'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'επιτεθείτε'}}}}}, 'aorist': {'passive': {'ind': {
                'sg': {'pri': {'επετέθην', 'επιτέθηκα'}, 'sec': {'επιτέθηκες', 'επετέθης'},
                       'ter': {'επιτέθηκε', 'επετέθη'}},
                'pl': {'pri': {'επιτεθήκαμε', 'επετέθημεν'}, 'sec': {'επετέθητε', 'επιτεθήκατε'},
                       'ter': {'επετέθησαν', 'επιτεθήκανε', 'επιτέθηκαν'}}}}}, 'paratatikos': {'passive': {'ind': {
                'sg': {'pri': {'επιτιθέμην', 'επιτιθόμουν'}, 'sec': {'επιτιθόσουν', 'επιτίθεσο'},
                       'ter': {'επιτίθετο', 'επιτιθόταν', 'επετίθετο'}},
                'pl': {'pri': {'επιτιθέμεθα', 'επιτιθόμασταν'}, 'sec': {'επιτιθόσασταν', 'επιτίθεσθε'},
                       'ter': {'επιτιθούνταν', 'επιτίθεντο'}}}}}, 'passive_aorist_participle': {'pl': {
                'masc': {'gen': {'επιτεθέντων'}, 'nom': {'επιτεθέντες'}, 'voc': {'επιτεθέντες'},
                         'acc': {'επιτεθέντες'}},
                'fem': {'gen': {'επιτεθεισών'}, 'nom': {'επιτεθείσες'}, 'voc': {'επιτεθείσες'}, 'acc': {'επιτεθείσες'}},
                'neut': {'gen': {'επιτεθέντων'}, 'nom': {'επιτεθέντα'}, 'voc': {'επιτεθέντα'}, 'acc': {'επιτεθέντα'}}},
                'sg': {'masc': {'gen': {
                    'επιτεθέντος'},
                    'nom': {
                        'επιτεθείς'},
                    'voc': {
                        'επιτεθείς'},
                    'acc': {
                        'επιτεθέντα'}},
                    'fem': {'gen': {
                        'επιτεθείσας'},
                        'nom': {
                            'επιτεθείσα'},
                        'voc': {
                            'επιτεθείσα'},
                        'acc': {
                            'επιτεθείσα'}},
                    'neut': {'gen': {
                        'επιτεθέντος'},
                        'nom': {
                            'επιτεθέν'},
                        'voc': {
                            'επιτεθέν'},
                        'acc': {
                            'επιτεθέν'}}}},
                'pass_pres_participle': {'pl': {
                    'masc': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενοι'}, 'voc': {'επιτιθέμενοι'},
                             'acc': {'επιτιθέμενους'}},
                    'fem': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενες'}, 'voc': {'επιτιθέμενες'},
                            'acc': {'επιτιθέμενες'}},
                    'neut': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενα'}, 'voc': {'επιτιθέμενα'},
                             'acc': {'επιτιθέμενα'}}}, 'sg': {
                    'masc': {'gen': {'επιτιθέμενου'}, 'nom': {'επιτιθέμενος'}, 'voc': {'επιτιθέμενε'},
                             'acc': {'επιτιθέμενο'}},
                    'fem': {'gen': {'επιτιθέμενης'}, 'nom': {'επιτιθέμενη'}, 'voc': {'επιτιθέμενη'},
                            'acc': {'επιτιθέμενη'}},
                    'neut': {'gen': {'επιτιθέμενου'}, 'nom': {'επιτιθέμενο'}, 'voc': {'επιτιθέμενο'},
                             'acc': {'επιτιθέμενο'}}}}, 'passive_perfect_participle': {'pl': {
                'masc': {'gen': {'επιτεθειμένων'}, 'nom': {'επιτεθειμένοι'}, 'voc': {'επιτεθειμένοι'},
                         'acc': {'επιτεθειμένους'}},
                'fem': {'gen': {'επιτεθειμένων'}, 'nom': {'επιτεθειμένες'}, 'voc': {'επιτεθειμένες'},
                        'acc': {'επιτεθειμένες'}},
                'neut': {'gen': {'επιτεθειμένων'}, 'nom': {'επιτεθειμένα'}, 'voc': {'επιτεθειμένα'},
                         'acc': {'επιτεθειμένα'}}}, 'sg': {
                'masc': {'gen': {'επιτεθειμένου'}, 'nom': {'επιτεθειμένος'}, 'voc': {'επιτεθειμένε'},
                         'acc': {'επιτεθειμένο'}},
                'fem': {'gen': {'επιτεθειμένης'}, 'nom': {'επιτεθειμένη'}, 'voc': {'επιτεθειμένη'},
                        'acc': {'επιτεθειμένη'}},
                'neut': {'gen': {'επιτεθειμένου'}, 'nom': {'επιτεθειμένο'}, 'voc': {'επιτεθειμένο'},
                         'acc': {'επιτεθειμένο'}}}}}

        )

    def test_verb_leo(self):
        self.assertDictEqual(
            verb.create_all_forms('λέω'),
            {'act_pres_participle': {'λέγοντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'είπαμε'},
                                                  'sec': {'είπατε'},
                                                  'ter': {'είπανε', 'είπαν'}},
                                           'sg': {'pri': {'είπα'},
                                                  'sec': {'είπες'},
                                                  'ter': {'είπε'}}}},
                        'passive': {'ind': {'pl': {'pri': {'ειπωθήκαμε',
                                                           'ελέχθημεν',
                                                           'λεχθήκαμε'},
                                                   'sec': {'ειπωθήκατε',
                                                           'ελέχθητε',
                                                           'λεχθήκατε'},
                                                   'ter': {'ειπωθήκανε',
                                                           'ειπώθηκαν',
                                                           'ελέχθησαν',
                                                           'λέχθηκαν',
                                                           'λεχθήκανε'}},
                                            'sg': {'pri': {'ειπώθηκα',
                                                           'ελέχθην',
                                                           'λέχθηκα'},
                                                   'sec': {'ειπώθηκες',
                                                           'ελέχθης',
                                                           'λέχθηκες'},
                                                   'ter': {'ειπώθηκε',
                                                           'ελέχθη',
                                                           'λέχθηκε'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'λέγουσες'},
                                                         'gen': {'λεγουσών'},
                                                         'nom': {'λέγουσες'},
                                                         'voc': {'λέγουσες'}},
                                                 'masc': {'acc': {'λέγοντες'},
                                                          'gen': {'λεγόντων'},
                                                          'nom': {'λέγοντες'},
                                                          'voc': {'λέγοντες'}},
                                                 'neut': {'acc': {'λέγοντα'},
                                                          'gen': {'λεγόντων'},
                                                          'nom': {'λέγοντα'},
                                                          'voc': {'λέγοντα'}}},
                                          'sg': {'fem': {'acc': {'λέγουσα'},
                                                         'gen': {'λέγουσας'},
                                                         'nom': {'λέγουσα'},
                                                         'voc': {'λέγουσα'}},
                                                 'masc': {'acc': {'λέγοντα'},
                                                          'gen': {'λέγοντος'},
                                                          'nom': {'λέγων'},
                                                          'voc': {'λέγων'}},
                                                 'neut': {'acc': {'λέγον'},
                                                          'gen': {'λέγοντος'},
                                                          'nom': {'λέγον'},
                                                          'voc': {'λέγον'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'πέστε', 'πείτε'}},
                                                'sg': {'sec': {'πες'}}},
                                        'ind': {'pl': {'pri': {'πούμε'},
                                                       'sec': {'πείτε'},
                                                       'ter': {'πουν', 'πούνε'}},
                                                'sg': {'pri': {'πω'},
                                                       'sec': {'πεις'},
                                                       'ter': {'πει'}}}},
                             'passive': {'imp': {'pl': {'sec': {'ειπωθείτε', 'λεχθείτε'}},
                                                 'sg': {'sec': {''}}},
                                         'ind': {'pl': {'pri': {'ειπωθούμε', 'λεχθούμε'},
                                                        'sec': {'ειπωθείτε', 'λεχθείτε'},
                                                        'ter': {'ειπωθούν',
                                                                'ειπωθούνε',
                                                                'λεχθούν',
                                                                'λεχθούνε'}},
                                                 'sg': {'pri': {'λεχθώ', 'ειπωθώ'},
                                                        'sec': {'ειπωθείς', 'λεχθείς'},
                                                        'ter': {'λεχθεί', 'ειπωθεί'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'λέγαμε'},
                                                       'sec': {'λέγατε'},
                                                       'ter': {'λέγανε', 'έλεγαν'}},
                                                'sg': {'pri': {'έλεγα'},
                                                       'sec': {'έλεγες'},
                                                       'ter': {'έλεγε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'λεγόμαστε', 'λεγόμασταν'},
                                                        'sec': {'λεγόσασταν', 'λεγόσαστε'},
                                                        'ter': {'λεγόντουσαν', 'λέγονταν'}},
                                                 'sg': {'pri': {'λεγόμουν', 'λεγόμουνα'},
                                                        'sec': {'λεγόσουνα', 'λεγόσουν'},
                                                        'ter': {'λεγόταν', 'λεγότανε'}}}}},
             'pass_pres_participle': {'pl': {'fem': {'acc': {'λεγόμενες'},
                                                     'gen': {'λεγόμενων'},
                                                     'nom': {'λεγόμενες'},
                                                     'voc': {'λεγόμενες'}},
                                             'masc': {'acc': {'λεγόμενους'},
                                                      'gen': {'λεγόμενων'},
                                                      'nom': {'λεγόμενοι'},
                                                      'voc': {'λεγόμενοι'}},
                                             'neut': {'acc': {'λεγόμενα'},
                                                      'gen': {'λεγόμενων'},
                                                      'nom': {'λεγόμενα'},
                                                      'voc': {'λεγόμενα'}}},
                                      'sg': {'fem': {'acc': {'λεγόμενη'},
                                                     'gen': {'λεγόμενης'},
                                                     'nom': {'λεγόμενη'},
                                                     'voc': {'λεγόμενη'}},
                                             'masc': {'acc': {'λεγόμενο'},
                                                      'gen': {'λεγόμενου'},
                                                      'nom': {'λεγόμενος'},
                                                      'voc': {'λεγόμενε'}},
                                             'neut': {'acc': {'λεγόμενο'},
                                                      'gen': {'λεγόμενου'},
                                                      'nom': {'λεγόμενο'},
                                                      'voc': {'λεγόμενο'}}}},
             'passive_aorist_participle': {'pl': {'fem': {'acc': {'λεχθείσες'},
                                                          'gen': {'λεχθεισών'},
                                                          'nom': {'λεχθείσες'},
                                                          'voc': {'λεχθείσες'}},
                                                  'masc': {'acc': {'λεχθέντες'},
                                                           'gen': {'λεχθέντων'},
                                                           'nom': {'λεχθέντες'},
                                                           'voc': {'λεχθέντες'}},
                                                  'neut': {'acc': {'λεχθέντα'},
                                                           'gen': {'λεχθέντων'},
                                                           'nom': {'λεχθέντα'},
                                                           'voc': {'λεχθέντα'}}},
                                           'sg': {'fem': {'acc': {'λεχθείσα'},
                                                          'gen': {'λεχθείσας'},
                                                          'nom': {'λεχθείσα'},
                                                          'voc': {'λεχθείσα'}},
                                                  'masc': {'acc': {'λεχθέντα'},
                                                           'gen': {'λεχθέντος'},
                                                           'nom': {'λεχθείς'},
                                                           'voc': {'λεχθείς'}},
                                                  'neut': {'acc': {'λεχθέν'},
                                                           'gen': {'λεχθέντος'},
                                                           'nom': {'λεχθέν'},
                                                           'voc': {'λεχθέν'}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'ειπωμένες'},
                                                           'gen': {'ειπωμένων'},
                                                           'nom': {'ειπωμένες'},
                                                           'voc': {'ειπωμένες'}},
                                                   'masc': {'acc': {'ειπωμένους'},
                                                            'gen': {'ειπωμένων'},
                                                            'nom': {'ειπωμένοι'},
                                                            'voc': {'ειπωμένοι'}},
                                                   'neut': {'acc': {'ειπωμένα'},
                                                            'gen': {'ειπωμένων'},
                                                            'nom': {'ειπωμένα'},
                                                            'voc': {'ειπωμένα'}}},
                                            'sg': {'fem': {'acc': {'ειπωμένη'},
                                                           'gen': {'ειπωμένης'},
                                                           'nom': {'ειπωμένη'},
                                                           'voc': {'ειπωμένη'}},
                                                   'masc': {'acc': {'ειπωμένο'},
                                                            'gen': {'ειπωμένου'},
                                                            'nom': {'ειπωμένος'},
                                                            'voc': {'ειπωμένε'}},
                                                   'neut': {'acc': {'ειπωμένο'},
                                                            'gen': {'ειπωμένου'},
                                                            'nom': {'ειπωμένο'},
                                                            'voc': {'ειπωμένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'λέγετε', 'λέτε'}},
                                            'sg': {'sec': {'λέγε'}}},
                                    'ind': {'pl': {'pri': {'λέμε'},
                                                   'sec': {'λέτε'},
                                                   'ter': {'λεν', 'λένε'}},
                                            'sg': {'pri': {'λέω'},
                                                   'sec': {'λες'},
                                                   'ter': {'λέει'}}}},
                         'passive': {'imp': {'pl': {'sec': {'λέγεστε'}}},
                                     'ind': {'pl': {'pri': {'λεγόμαστε'},
                                                    'sec': {'λεγόσαστε', 'λέγεστε'},
                                                    'ter': {'λέγονται'}},
                                             'sg': {'pri': {'λέγομαι'},
                                                    'sec': {'λέγεσαι'},
                                                    'ter': {'λέγεται'}}}}}}

        )

    def test_verb_synisto(self):
        self.assertDictEqual(
            verb.create_all_forms('συνιστώ')['aorist'],
            {'active': {'ind': {'pl': {'pri': {'συστήσαμε'},
                                       'sec': {'συστήσατε'},
                                       'ter': {'συνέστησαν', 'συστήσανε', 'σύστησαν'}},
                                'sg': {'pri': {'συνέστησα', 'σύστησα'},
                                       'sec': {'σύστησες', 'συνέστησες'},
                                       'ter': {'συνέστησε', 'σύστησε'}}}},
             'passive': {'ind': {'pl': {'pri': {'συσταθήκαμε', 'συνεστάθημεν'},
                                        'sec': {'συνεστάθητε', 'συσταθήκατε'},
                                        'ter': {'συνεστάθησαν',
                                                'συστάθηκαν',
                                                'συσταθήκανε'}},
                                 'sg': {'pri': {'συστάθηκα', 'συνεστάθην'},
                                        'sec': {'συνεστάθης', 'συστάθηκες'},
                                        'ter': {'συστάθηκε', 'συνεστάθη'}}}}}

        )

    def test_verb_katebainw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('κατεβαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'κατεβαίνω'}, 'sec': {'κατεβαίνεις'}, 'ter': {'κατεβαίνει'}},
                                            'pl': {'pri': {'κατεβαίνουμε'}, 'sec': {'κατεβαίνετε'},
                                                   'ter': {'κατεβαίνουνε', 'κατεβαίνουν'}}},
                                    'imp': {'sg': {'sec': {'κατέβαινε'}}, 'pl': {'sec': {'κατεβαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {
                 'sg': {'pri': {'κατέβω', 'κατεβώ'}, 'sec': {'κατεβείς', 'κατέβεις'}, 'ter': {'κατέβει', 'κατεβεί'}},
                 'pl': {'pri': {'κατέβουμε', 'κατεβούμε'}, 'sec': {'κατέβετε', 'κατεβείτε'},
                        'ter': {'κατέβουν', 'κατεβούν', 'κατεβούνε', 'κατέβουνε'}}},
                 'imp': {'sg': {'sec': {'κατέβα'}}, 'pl': {'sec': {'κατεβείτε'}}}}},
             'aorist': {'active': {'ind': {
                 'sg': {'pri': {'κατέβηκα', 'κατέβην'}, 'sec': {'κατέβης', 'κατέβηκες'}, 'ter': {'κατέβη', 'κατέβηκε'}},
                 'pl': {'pri': {'κατεβήκαμε', 'κατέβημεν'}, 'sec': {'κατέβητε', 'κατεβήκατε'},
                        'ter': {'κατεβήκανε', 'κατέβηκαν', 'κατέβησαν'}}}}}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'κατέβαινα'}, 'sec': {'κατέβαινες'}, 'ter': {'κατέβαινε'}},
                        'pl': {'pri': {'καταβαίναμε'}, 'sec': {'καταβαίνατε'}, 'ter': {'κατέβαιναν', 'καταβαίνανε'}}}}},
             'act_pres_participle': {'κατεβαίνοντας'}}

        )

    def test_verb_symbainw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συμβαίνω')['aorist'],
            {'active': {'ind': {'pl': {'pri': {'συνέβημεν'},
                                       'sec': {'συνέβητε'},
                                       'ter': {'συνέβησαν'}},
                                'sg': {'pri': {'συνέβην'},
                                       'sec': {'συνέβης'},
                                       'ter': {'συνέβη'}}}}}

        )

    def test_verb_pao(self):
        self.assertDictEqual(
            verb.create_all_forms('πάω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                            'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                    'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                   'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'}, 'ter': {'πήγαν', 'πήγανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                                'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                       'ter': {'πήγαιναν', 'πηγαίνανε'}}}}}}

        )

    def test_verb_paraeimai(self):
        self.assertDictEqual(
            verb.create_all_forms('παραείμαι'),
            {'act_pres_participle': {'παραόντας'},
             'aorist': {},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'παραούσες'},
                                                         'gen': {'παραουσών'},
                                                         'nom': {'παραούσες'},
                                                         'voc': {'παραούσες'}},
                                                 'masc': {'acc': {'παραόντες'},
                                                          'gen': {'παραόντων'},
                                                          'nom': {'παραόντες'},
                                                          'voc': {'παραόντες'}},
                                                 'neut': {'acc': {'παραόντα'},
                                                          'gen': {'παραόντων'},
                                                          'nom': {'παραόντα'},
                                                          'voc': {'παραόντα'}}},
                                          'sg': {'fem': {'acc': {'παραούσα'},
                                                         'gen': {'παραούσας'},
                                                         'nom': {'παραούσα'},
                                                         'voc': {'παραούσα'}},
                                                 'masc': {'acc': {'παραόντα'},
                                                          'gen': {'παραόντος'},
                                                          'nom': {'παράων'},
                                                          'voc': {'παράων'}},
                                                 'neut': {'acc': {'παράον'},
                                                          'gen': {'παραόντος'},
                                                          'nom': {'παράον'},
                                                          'voc': {'παράον'}}}},
             'conjunctive': {},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'παραήμαστε', 'παραήμασταν'},
                                                       'sec': {'παραήσαστε', 'παραήσασταν'},
                                                       'ter': {'παραήτανε', 'παραήταν'}},
                                                'sg': {'pri': {'παραήμουνα', 'παραήμουν'},
                                                       'sec': {'παραήσουνα', 'παραήσουν'},
                                                       'ter': {'παραήτανε', 'παραήταν'}}}}},
             'present': {'active': {'ind': {'pl': {'pri': {'παραείμαστε'},
                                                   'sec': {'παραείστε', 'παραείσαστε'},
                                                   'ter': {'παραείναι'}},
                                            'sg': {'pri': {'παραείμαι'},
                                                   'sec': {'παραείσαι'},
                                                   'ter': {'παραείναι'}}}}}}

        )

    def test_verb_eimai(self):
        self.assertDictEqual(
            verb.create_all_forms('είμαι'),
            {'present': {'active': {'ind': {'sg': {'pri': {'είμαι'}, 'sec': {'είσαι'}, 'ter': {'είναι'}},
                                            'pl': {'pri': {'είμαστε'}, 'sec': {'είστε', 'είσαστε'}, 'ter': {'είναι'}}},
                                    'imp': {'sg': {'ter': {'έστω'}}}}}, 'conjunctive': {}, 'aorist': {},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'ήμουν', 'ήμουνα'}, 'sec': {'ήσουν', 'ήσουνα'}, 'ter': {'ήταν', 'ήτανε'}},
                         'pl': {'pri': {'ήμασταν', 'ήμαστε'}, 'sec': {'ήσασταν', 'ήσαστε'},
                                'ter': {'ήταν', 'ήτανε'}}}}}, 'act_pres_participle': {'όντας'},
             'arch_act_pres_participle': {
                 'pl': {'neut': {'acc': {'όντα'}, 'nom': {'όντα'}, 'gen': {'όντων'}, 'voc': {'όντα'}},
                        'fem': {'acc': {'ούσες'}, 'nom': {'ούσες'}, 'gen': {'ουσών'}, 'voc': {'ούσες'}},
                        'masc': {'acc': {'όντες'}, 'nom': {'όντες'}, 'gen': {'όντων'}, 'voc': {'όντες'}}},
                 'sg': {'neut': {'acc': {'ον'}, 'nom': {'ον'}, 'gen': {'όντος'}, 'voc': {'ον'}},
                        'fem': {'acc': {'ούσα'}, 'nom': {'ούσα'}, 'gen': {'ούσας'}, 'voc': {'ούσα'}},
                        'masc': {'acc': {'όντα'}, 'nom': {'ων'}, 'gen': {'όντος'}, 'voc': {'ων'}}}}}

        )

    def test_aorist_verb_anago(self):
        self.assertDictEqual(
            verb.create_all_forms('ανάγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'ανήγαγα'}, 'sec': {'ανήγαγες'}, 'ter': {'ανήγαγε'}},
                                'pl': {'pri': {'αναγάγαμε'}, 'sec': {'αναγάγατε'}, 'ter': {'ανήγαγαν', 'αναγάγανε'}}}},
             'passive': {'ind': {
                 'sg': {'pri': {'ανήχθην', 'ανάχθηκα'}, 'sec': {'ανήχθης', 'ανάχθηκες'}, 'ter': {'ανάχθηκε', 'ανήχθη'}},
                 'pl': {'pri': {'ανήχθημεν', 'αναχθήκαμε'}, 'sec': {'αναχθήκατε', 'ανήχθητε'},
                        'ter': {'ανήχθησαν', 'ανάχθηκαν', 'αναχθήκανε'}}}}}

        )

    def test_present_verb_thumoumai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('θυμούμαι'),
            {'present':
                 {'passive':
                      {'ind': {'sg': {'pri': {'θυμούμαι'}, 'sec': {'θυμείσαι'}, 'ter': {'θυμείται'}},
                               'pl': {'pri': {'θυμούμεθα', 'θυμούμαστε'}, 'sec': {'θυμείσθε', 'θυμείστε'},
                                      'ter': {'θυμούνται'}}},
                       'imp': {'pl': {'sec': {'θυμείστε'}}}}},
             'conjunctive': {'passive': {'ind': {'sg': {'pri': {'θυμηθώ'}, 'sec': {'θυμηθείς'}, 'ter': {'θυμηθεί'}},
                                                 'pl': {'pri': {'θυμηθούμε'}, 'sec': {'θυμηθείτε'},
                                                        'ter': {'θυμηθούν', 'θυμηθούνε'}}},
                                         'imp': {'sg': {'sec': {'θυμήσου'}}, 'pl': {'sec': {'θυμηθείτε'}}}}},
             'aorist': {'passive': {'ind': {'sg': {'pri': {'θυμήθηκα'}, 'sec': {'θυμήθηκες'}, 'ter': {'θυμήθηκε'}},
                                            'pl': {'pri': {'θυμηθήκαμε'}, 'sec': {'θυμηθήκατε'},
                                                   'ter': {'θυμηθήκανε', 'θυμήθηκαν'}}}}},

              'paratatikos': {'passive': {'ind': {'pl': {'pri': {'θυμούμασταν',
                                                     'θυμούμαστε'},
                                             'sec': {'θυμούσασταν',
                                                     'θυμούσαστε'},
                                             'ter': {'θυμούνταν',
                                                     'θυμούντανε',
                                                     'θυμούντο'}},
                                      'sg': {'pri': {'θυμούμουν'},
                                             'sec': {'θυμούσουν'},
                                             'ter': {'θυμείτο',
                                                     'θυμούνταν',
                                                     'θυμούντανε'}}}}},

             'pass_pres_participle': {'sg': {
                 'masc': {'nom': {'θυμούμενος'}, 'gen': {'θυμούμενου'}, 'acc': {'θυμούμενο'}, 'voc': {'θυμούμενε'}},
                 'fem': {'nom': {'θυμούμενη'}, 'gen': {'θυμούμενης'}, 'acc': {'θυμούμενη'}, 'voc': {'θυμούμενη'}},
                 'neut': {'nom': {'θυμούμενο'}, 'gen': {'θυμούμενου'}, 'acc': {'θυμούμενο'}, 'voc': {'θυμούμενο'}}},
                 'pl': {
                     'masc': {'nom': {'θυμούμενοι'}, 'gen': {'θυμούμενων'}, 'acc': {'θυμούμενους'},
                              'voc': {'θυμούμενοι'}},
                     'fem': {'nom': {'θυμούμενες'}, 'gen': {'θυμούμενων'}, 'acc': {'θυμούμενες'},
                             'voc': {'θυμούμενες'}},
                     'neut': {'nom': {'θυμούμενα'}, 'gen': {'θυμούμενων'}, 'acc': {'θυμούμενα'},
                              'voc': {'θυμούμενα'}}}}}

        )

    def test_present_verb_drw(self):
        self.assertDictEqual(
            verb.create_all_forms('δρω')['present'],
            {'active': {'ind': {'sg': {'pri': {'δράω', 'δρω'}, 'sec': {'δρας'},
                                       'ter': {'δράει', 'δρα'}},
                                'pl': {'pri': {'δράμε', 'δρούμε'}, 'sec': {'δράτε'},
                                       'ter': {'δρούνε', 'δράνε', 'δραν', 'δρουν'}}},
                        'imp': {'sg': {'sec': {'δρα'}}, 'pl': {'sec': {'δράτε'}}}}},
        )

    def test_aorist_verb_eisago(self):
        self.assertDictEqual(
            verb.create_all_forms('εισάγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'εισήγαγα'}, 'sec': {'εισήγαγες'}, 'ter': {'εισήγαγε'}},
                                'pl': {'pri': {'εισαγάγαμε'}, 'sec': {'εισαγάγατε'},
                                       'ter': {'εισήγαγαν', 'εισαγάγανε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'εισάχθηκα', 'εισήχθην'}, 'sec': {'εισάχθηκες', 'εισήχθης'},
                       'ter': {'εισάχθηκε', 'εισήχθη'}},
                'pl': {'pri': {'εισαχθήκαμε', 'εισήχθημεν'}, 'sec': {'εισήχθητε', 'εισαχθήκατε'},
                       'ter': {'εισάχθηκαν', 'εισαχθήκανε', 'εισήχθησαν'}}}}}

        )

    def test_aorist_verb_ago(self):
        self.assertDictEqual(
            verb.create_all_forms('άγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'ήγαγα'}, 'sec': {'ήγαγες'}, 'ter': {'ήγαγε'}},
                                'pl': {'pri': {'αγάγαμε'}, 'sec': {'αγάγατε'}, 'ter': {'ήγαγαν', 'αγάγανε'}}}},
             'passive': {'ind': {'sg': {'pri': {'ήχθην'}, 'sec': {'ήχθης'}, 'ter': {'ήχθη'}},
                                 'pl': {'pri': {'ήχθημεν'}, 'sec': {'ήχθητε'}, 'ter': {'ήχθησαν'}}}}}

        )

    def test_verb_antitasso(self):
        self.assertDictEqual(
            verb.create_all_forms('αντιτάσσω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'αντιτάσσω'}, 'sec': {'αντιτάσσεις'}, 'ter': {'αντιτάσσει'}},
                                            'pl': {'pri': {'αντιτάσσουμε'}, 'sec': {'αντιτάσσετε'},
                                                   'ter': {'αντιτάσσουν', 'αντιτάσσουνε'}}},
                                    'imp': {'sg': {'sec': {'αντίτασσε'}}, 'pl': {'sec': {'αντιτάσσετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'αντιτάσσομαι'}, 'sec': {'αντιτάσσεσαι'}, 'ter': {'αντιτάσσεται'}},
                        'pl': {'pri': {'αντιτασσόμαστε'}, 'sec': {'αντιτασσόσαστε', 'αντιτάσσεστε'},
                               'ter': {'αντιτάσσονται'}}}, 'imp': {'pl': {'sec': {'αντιτάσσεστε'}}}}}, 'conjunctive': {
                'active': {'ind': {'sg': {'pri': {'αντιτάξω'}, 'sec': {'αντιτάξεις'}, 'ter': {'αντιτάξει'}},
                                   'pl': {'pri': {'αντιτάξουμε'}, 'sec': {'αντιτάξετε'},
                                          'ter': {'αντιτάξουνε', 'αντιτάξουν'}}},
                           'imp': {'sg': {'sec': {'αντίταξε'}}, 'pl': {'sec': {'αντιτάξτε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'αντιταχθώ', 'αντιταχτώ'}, 'sec': {'αντιταχτείς', 'αντιταχθείς'},
                           'ter': {'αντιταχθεί', 'αντιταχτεί'}},
                    'pl': {'pri': {'αντιταχθούμε', 'αντιταχτούμε'}, 'sec': {'αντιταχτείτε', 'αντιταχθείτε'},
                           'ter': {'αντιταχτούνε', 'αντιταχθούνε', 'αντιταχθούν', 'αντιταχτούν'}}}, 'imp': {
                    'sg': {'sec': {'αντιτάξου'}}, 'pl': {'sec': {'αντιταχτείτε', 'αντιταχθείτε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'αντέταξα'}, 'sec': {'αντέταξες'}, 'ter': {'αντέταξε'}},
                                   'pl': {'pri': {'αντιτάξαμε'}, 'sec': {'αντιτάξατε'},
                                          'ter': {'αντέταξαν', 'αντιτάξανε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'αντιτάχτηκα', 'αντιτάχθηκα'}, 'sec': {'αντιτάχτηκες', 'αντιτάχθηκες'},
                           'ter': {'αντιτάχτηκε', 'αντιτάχθηκε'}},
                    'pl': {'pri': {'αντιταχθήκαμε', 'αντιταχτήκαμε'}, 'sec': {'αντιταχτήκατε', 'αντιταχθήκατε'},
                           'ter': {'αντιταχθήκανε', 'αντιτάχθηκαν', 'αντιτάχτηκαν', 'αντιταχτήκανε'}}}}},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'αντέτασσα'}, 'sec': {'αντέτασσες'}, 'ter': {'αντέτασσε'}},
                         'pl': {'pri': {'αντιτάσσαμε'}, 'sec': {'αντιτάσσατε'}, 'ter': {'αντιτάσσανε', 'αντέτασσαν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'αντιτασσόμουνα', 'αντιτασσόμουν'},
                                            'sec': {'αντιτασσόσουν', 'αντιτασσόσουνα'},
                                            'ter': {'αντιτασσόταν', 'αντιτασσότανε'}},
                                     'pl': {'pri': {'αντιτασσόμαστε', 'αντιτασσόμασταν'},
                                            'sec': {'αντιτασσόσαστε', 'αντιτασσόσασταν'},
                                            'ter': {'αντιτάσσονταν', 'αντιτασσόντουσαν'}}}}},
             'act_pres_participle': {'αντιτάσσοντας'}, 'pass_pres_participle': {'sg': {
                'fem': {'acc': {'αντιτασσόμενη'}, 'nom': {'αντιτασσόμενη'}, 'gen': {'αντιτασσόμενης'},
                        'voc': {'αντιτασσόμενη'}},
                'neut': {'acc': {'αντιτασσόμενο'}, 'nom': {'αντιτασσόμενο'}, 'gen': {'αντιτασσόμενου'},
                         'voc': {'αντιτασσόμενο'}},
                'masc': {'acc': {'αντιτασσόμενο'}, 'nom': {'αντιτασσόμενος'}, 'gen': {'αντιτασσόμενου'},
                         'voc': {'αντιτασσόμενε'}}}, 'pl': {
                'fem': {'acc': {'αντιτασσόμενες'}, 'nom': {'αντιτασσόμενες'}, 'gen': {'αντιτασσόμενων'},
                        'voc': {'αντιτασσόμενες'}},
                'neut': {'acc': {'αντιτασσόμενα'}, 'nom': {'αντιτασσόμενα'}, 'gen': {'αντιτασσόμενων'},
                         'voc': {'αντιτασσόμενα'}},
                'masc': {'acc': {'αντιτασσόμενους'}, 'nom': {'αντιτασσόμενοι'}, 'gen': {'αντιτασσόμενων'},
                         'voc': {'αντιτασσόμενοι'}}}}}

        )
