from unittest import TestCase
from modern_greek_inflexion.exceptions import NotLegalVerbException, NotInGreekException
from modern_greek_inflexion import verb


class VerbTestAll(TestCase):

    def test_not_in_greek_exception(self):
        self.assertRaises(NotInGreekException, verb.create_all_forms, 'gamao')

    def test_not_legal_verb_exception(self):
        self.assertRaises(NotLegalVerbException, verb.create_all_forms, 'βλέπουμε')

    def test_verb_modal_pass_fainetai(self):
        self.assertDictEqual(
            verb.create_all_forms('φαίνεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'φαίνεται'}}}}},
             'conjunctive': {'passive': {'ind': {'sg': {'ter': {'φανεί'}}}}},
             'aorist': {'passive': {'ind': {'sg': {'ter': {'φάνηκε'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'φαινόταν'}}}}}},
        )



    def test_verb_modal_brexei(self):
        self.assertDictEqual(
            verb.create_all_forms('βρέχει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'βρέχει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'βρέξει'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'έβρεξε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'έβρεχε'}}}}}}
        )

    def test_verb_antikathistw(self):
        self.assertDictEqual(
            verb.create_all_forms('αντικαθιστώ')['present']['active'],
            {'ind': {'sg': {'pri': {'αντικαθιστώ'}, 'sec': {'αντικαθιστάς'},
                            'ter': {'αντικαθιστά'}},
                     'pl': {'pri': {'αντικαθιστούμε', 'αντικαθιστάμε'}, 'sec': {'αντικαθιστάτε'},
                            'ter': {'αντικαθιστούν'}}},
             'imp': {'sg': {'sec': {'αντικαθίστα'}}, 'pl': {'sec': {'αντικαθιστάτε'}}}},

        )

    def test_verb_antipernw(self):
        self.assertDictEqual(
            verb.create_all_forms('αντιπερνώ'),
            {'act_pres_participle': {'αντιπερνώντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'αντιπεράσαμε'},
                                                  'sec': {'αντιπεράσατε'},
                                                  'ter': {'αντιπέρασαν', 'αντιπεράσανε'}},
                                           'sg': {'pri': {'αντιπέρασα'},
                                                  'sec': {'αντιπέρασες'},
                                                  'ter': {'αντιπέρασε'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'αντιπερνώσες'},
                                                         'gen': {'αντιπερνωσών'},
                                                         'nom': {'αντιπερνώσες'},
                                                         'voc': {'αντιπερνώσες'}},
                                                 'masc': {'acc': {'αντιπερνώντες'},
                                                          'gen': {'αντιπερνώντων'},
                                                          'nom': {'αντιπερνώντες'},
                                                          'voc': {'αντιπερνώντες'}},
                                                 'neut': {'acc': {'αντιπερνώντα'},
                                                          'gen': {'αντιπερνώντων'},
                                                          'nom': {'αντιπερνώντα'},
                                                          'voc': {'αντιπερνώντα'}}},
                                          'sg': {'fem': {'acc': {'αντιπερνώσα'},
                                                         'gen': {'αντιπερνώσας'},
                                                         'nom': {'αντιπερνώσα'},
                                                         'voc': {'αντιπερνώσα'}},
                                                 'masc': {'acc': {'αντιπερνώντα'},
                                                          'gen': {'αντιπερνώντος'},
                                                          'nom': {'αντιπερνών'},
                                                          'voc': {'αντιπερνών'}},
                                                 'neut': {'acc': {'αντιπερνών'},
                                                          'gen': {'αντιπερνώντος'},
                                                          'nom': {'αντιπερνών'},
                                                          'voc': {'αντιπερνών'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'αντιπεράστε'}},
                                                'sg': {'sec': {'αντιπέρασε'}}},
                                        'ind': {'pl': {'pri': {'αντιπεράσουμε', 'αντιπεράσομε'},
                                                       'sec': {'αντιπεράσετε'},
                                                       'ter': {'αντιπεράσουν',
                                                               'αντιπεράσουνε'}},
                                                'sg': {'pri': {'αντιπεράσω'},
                                                       'sec': {'αντιπεράσεις'},
                                                       'ter': {'αντιπεράσει'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'αντιπερνούσαμε'},
                                                       'sec': {'αντιπερνούσατε'},
                                                       'ter': {'αντιπερνούσαν', 'αντιπερνούσανε'}},
                                                'sg': {'pri': {'αντιπερνούσα'},
                                                       'sec': {'αντιπερνούσες'},
                                                       'ter': {'αντιπερνούσε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'αντιπερνιόμασταν', 'αντιπερνιόμαστε'},
                                                        'sec': {'αντιπερνιόσαστε', 'αντιπερνιόσασταν'},
                                                        'ter': {'αντιπερνιούνταν',
                                                                'αντιπερνιόνταν',
                                                                'αντιπερνιόντουσαν'}},
                                                 'sg': {'pri': {'αντιπερνιόμουνα', 'αντιπερνιόμουν'},
                                                        'sec': {'αντιπερνιόσουνα', 'αντιπερνιόσουν'},
                                                        'ter': {'αντιπερνιότανε', 'αντιπερνιόταν'}}}}}
                ,
             'present': {'active': {'imp': {'pl': {'sec': {'αντιπερνάτε'}},
                                            'sg': {'sec': {'αντιπέρνα'}}},
                                    'ind': {'pl': {'pri': {'αντιπερνούμε', 'αντιπερνάμε'},
                                                   'sec': {'αντιπερνάτε'},
                                                   'ter': {'αντιπερνούν'}},
                                            'sg': {'pri': {'αντιπερνώ'},
                                                   'sec': {'αντιπερνάς'},
                                                   'ter': {'αντιπερνά'}}}},
                         'passive': {'imp': {'pl': {'sec': {'αντιπερνιέστε'}}},
                                     'ind': {'pl': {'pri': {'αντιπερνιόμαστε'},
                                                    'sec': {'αντιπερνιέστε',
                                                            'αντιπερνιόσαστε'},
                                                    'ter': {'αντιπερνιούνται',
                                                            'αντιπερνιόνται'}},
                                             'sg': {'pri': {'αντιπερνιέμαι'},
                                                    'sec': {'αντιπερνιέσαι'},
                                                    'ter': {'αντιπερνιέται'}}}}}},

        )

    def test_verb_modal_pass_melletai(self):
        self.assertDictEqual(
            verb.create_all_forms('μέλλεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'μέλλεται'}}}}},
             'aorist': {},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'μελλόταν'}}}}}}
        )




    def test_verb_aksiw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('αξιώ'),
            {'act_pres_participle': {'αξιώντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'αξιώσαμε'},
                                                  'sec': {'αξιώσατε'},
                                                  'ter': {'αξίωσαν', 'αξιώσανε'}},
                                           'sg': {'pri': {'αξίωσα'},
                                                  'sec': {'αξίωσες'},
                                                  'ter': {'αξίωσε'}}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'αξιώστε'}},
                                                'sg': {'sec': {'αξίωσε'}}},
                                        'ind': {'pl': {'pri': {'αξιώσουμε', 'αξιώσομε'},
                                                       'sec': {'αξιώσετε'},
                                                       'ter': {'αξιώσουν', 'αξιώσουνε'}},
                                                'sg': {'pri': {'αξιώσω'},
                                                       'sec': {'αξιώσεις'},
                                                       'ter': {'αξιώσει'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'αξιούσαμε'},
                                                       'sec': {'αξιούσατε'},
                                                       'ter': {'αξιούσανε', 'αξιούσαν'}},
                                                'sg': {'pri': {'αξιούσα'},
                                                       'sec': {'αξιούσες'},
                                                       'ter': {'αξιούσε'}}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'αξιωμένες'},
                                                           'gen': {'αξιωμένων'},
                                                           'nom': {'αξιωμένες'},
                                                           'voc': {'αξιωμένες'}},
                                                   'masc': {'acc': {'αξιωμένους'},
                                                            'gen': {'αξιωμένων'},
                                                            'nom': {'αξιωμένοι'},
                                                            'voc': {'αξιωμένοι'}},
                                                   'neut': {'acc': {'αξιωμένα'},
                                                            'gen': {'αξιωμένων'},
                                                            'nom': {'αξιωμένα'},
                                                            'voc': {'αξιωμένα'}}},
                                            'sg': {'fem': {'acc': {'αξιωμένη'},
                                                           'gen': {'αξιωμένης'},
                                                           'nom': {'αξιωμένη'},
                                                           'voc': {'αξιωμένη'}},
                                                   'masc': {'acc': {'αξιωμένο'},
                                                            'gen': {'αξιωμένου'},
                                                            'nom': {'αξιωμένος'},
                                                            'voc': {'αξιωμένε'}},
                                                   'neut': {'acc': {'αξιωμένο'},
                                                            'gen': {'αξιωμένου'},
                                                            'nom': {'αξιωμένο'},
                                                            'voc': {'αξιωμένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'αξιούτε'}}},
                                    'ind': {'pl': {'pri': {'αξιούμε'},
                                                   'sec': {'αξιούτε'},
                                                   'ter': {'αξιούν'}},
                                            'sg': {'pri': {'αξιώ'},
                                                   'sec': {'αξιοίς'},
                                                   'ter': {'αξιοί'}}}}}}

        )


    def test_thewrw(self):
        self.assertDictEqual(
            verb.create_all_forms('θεωρώ')['paratatikos'],
            {'active': {'ind': {'pl': {'pri': {'θεωρούσαμε'},
                                       'sec': {'θεωρούσατε'},
                                       'ter': {'θεωρούσαν', 'θεωρούσανε'}},
                                'sg': {'pri': {'θεωρούσα'},
                                       'sec': {'θεωρούσες'},
                                       'ter': {'θεωρούσε'}}}},
             'passive': {'ind': {'pl': {'pri': {'θεωρούμαστε', 'θεωρούμασταν'},
                                        'sec': {'θεωρούσαστε', 'θεωρούσασταν'},
                                        'ter': {'εθεωρούντο', 'θεωρούνταν', 'θεωρούντο'}},
                                 'sg': {'pri': {'θεωρούμουν'},
                                        'sec': {'θεωρούσουν'},
                                        'ter': {'θεωρείτο', 'εθεωρείτο', 'θεωρούνταν'}}}}}

        )

    def test_verb_opsomai(self):
        self.assertDictEqual(

            verb.create_all_forms('όψομαι'),
            {'present': {'passive': {'imp': {'pl': {'sec': {'όψεστε'}}, 'sg': {'sec': {'όψου'}}},
                                     'ind': {'pl': {'pri': {'οψόμεθα', 'οψόμαστε'},
                                                    'sec': {'όψεσθε', 'οψόσαστε', 'όψεστε'},
                                                    'ter': {'όψονται'}},
                                             'sg': {'pri': {'όψομαι'},
                                                    'sec': {'όψεσαι'},
                                                    'ter': {'όψεται'}}}}}}

        )



    def test_verb_erxomai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('έρχομαι'),
            {'present':
                {'passive':
                    {'ind': {
                        'sg':
                            {'pri': {'έρχομαι'}, 'sec': {'έρχεσαι'}, 'ter': {'έρχεται'}},
                        'pl': {'pri': {'ερχόμαστε'}, 'sec': {'έρχεστε', 'ερχόσαστε'},
                               'ter': {'έρχονται'}}},
                        'imp': {'pl': {'sec': {'έρχεστε'}},
                                'sg': {'sec': {'έρχου'}}}}},
                'conjunctive': {
                    'active': {
                        'ind': {
                            'sg': {'pri': {'έρθω', 'έλθω'},
                                   'sec': {'έρθεις', 'έλθεις'},
                                   'ter': {'έλθει', 'έρθει'}},
                            'pl': {'pri': {'έρθουμε', 'έλθουμε', 'έρθομε', 'έλθομε'},
                                   'sec': {'έρθετε', 'έλθετε'},
                                   'ter': {'έρθουνε', 'έρθουν', 'έλθουν', 'έλθουνε'}}},
                        'imp': {'sg': {'sec': {'έλα'}},
                                'pl': {'sec': {'έλθετε', 'έρθετε', 'ελάτε'}}}}},
                'aorist': {
                    'active': {
                        'ind': {'sg': {'pri': {'ήρθα', 'ήλθα'}, 'sec': {'ήλθες', 'ήρθες'}, 'ter': {'ήλθε', 'ήρθε'}},
                                'pl': {'pri': {'ήλθαμε', 'ήρθαμε'}, 'sec': {'ήλθατε', 'ήρθατε'},
                                       'ter': {'ήρθανε', 'ήρθαν', 'ήλθαν', 'ήλθανε'}}}}},
                'paratatikos': {
                    'passive': {
                        'ind': {
                            'sg': {'pri': {'ερχόμουνα', 'ερχόμουν'}, 'sec': {'ερχόσουνα', 'ερχόσουν'},
                                   'ter': {'ερχότανε', 'ερχόταν'}},
                            'pl': {'pri': {'ερχόμασταν', 'ερχόμαστε'}, 'sec': {'ερχόσαστε', 'ερχόσασταν'},
                                   'ter': {'ερχόντουσαν', 'έρχονταν'}}}}},
                'pass_pres_participle': {
                    'sg': {
                        'masc': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενε'}, 'nom': {'ερχόμενος'}, 'acc': {'ερχόμενο'}},
                        'fem': {'gen': {'ερχόμενης'}, 'voc': {'ερχόμενη'}, 'nom': {'ερχόμενη'}, 'acc': {'ερχόμενη'}},
                        'neut': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενο'}, 'nom': {'ερχόμενο'}, 'acc': {'ερχόμενο'}}},
                    'pl': {'masc': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενοι'}, 'nom': {'ερχόμενοι'},
                                    'acc': {'ερχόμενους'}},
                           'fem': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενες'}, 'nom': {'ερχόμενες'},
                                   'acc': {'ερχόμενες'}},
                           'neut': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενα'}, 'nom': {'ερχόμενα'},
                                    'acc': {'ερχόμενα'}}}}}
        )

    def test_verb_tragoudo(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('τραγουδώ')['paratatikos'],
            {'active': {'ind': {'pl': {'pri': {'τραγουδούσαμε', 'τραγουδάγαμε'},
                                       'sec': {'τραγουδούσατε', 'τραγουδάγατε'},
                                       'ter': {'τραγουδάγανε',
                                               'τραγουδούσαν',
                                               'τραγουδούσανε',
                                               'τραγούδαγαν'}},
                                'sg': {'pri': {'τραγούδαγα', 'τραγουδούσα'},
                                       'sec': {'τραγούδαγες', 'τραγουδούσες'},
                                       'ter': {'τραγουδούσε', 'τραγούδαγε'}}}},
             'passive': {'ind': {'pl': {'pri': {'τραγουδιόμασταν', 'τραγουδιόμαστε'},
                                        'sec': {'τραγουδιόσαστε', 'τραγουδιόσασταν'},
                                        'ter': {'τραγουδιούνταν',
                                                'τραγουδιόνταν',
                                                'τραγουδιόντουσαν'}},
                                 'sg': {'pri': {'τραγουδιόμουν', 'τραγουδιόμουνα'},
                                        'sec': {'τραγουδιόσουνα', 'τραγουδιόσουν'},
                                        'ter': {'τραγουδιόταν', 'τραγουδιότανε'}}}}}

        )



    def test_verb_engrafw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('εγγράφω'),
            {'act_pres_participle': {'εγγράφοντας'},
             'active_aorist_participle': {'pl': {'fem': {'acc': {'εγγράψασες'},
                                                         'gen': {'εγγραψασών'},
                                                         'nom': {'εγγράψασες'},
                                                         'voc': {'εγγράψασες'}},
                                                 'masc': {'acc': {'εγγράψαντες'},
                                                          'gen': {'εγγραψάντων'},
                                                          'nom': {'εγγράψαντες'},
                                                          'voc': {'εγγράψαντες'}},
                                                 'neut': {'acc': {'εγγράψαντα'},
                                                          'gen': {'εγγραψάντων'},
                                                          'nom': {'εγγράψαντα'},
                                                          'voc': {'εγγράψαντα'}}},
                                          'sg': {'fem': {'acc': {'εγγράψασα'},
                                                         'gen': {'εγγράψασας'},
                                                         'nom': {'εγγράψασα'},
                                                         'voc': {'εγγράψασα'}},
                                                 'masc': {'acc': {'εγγράψαντα'},
                                                          'gen': {'εγγράψαντος', 'εγγράψαντα'},
                                                          'nom': {'εγγράψας', 'εγγράψαντας'},
                                                          'voc': {'εγγράψας', 'εγγράψαντα'}},
                                                 'neut': {'acc': {'εγγράψαν'},
                                                          'gen': {'εγγράψαντος'},
                                                          'nom': {'εγγράψαν'},
                                                          'voc': {'εγγράψαν'}}}},
             'aorist': {'active': {'ind': {'pl': {'pri': {'εγγράψαμε'},
                                                  'sec': {'εγγράψατε'},
                                                  'ter': {'ενέγραψαν', 'εγγράψανε'}},
                                           'sg': {'pri': {'ενέγραψα'},
                                                  'sec': {'ενέγραψες'},
                                                  'ter': {'ενέγραψε'}}}},
                        'passive': {'ind': {'pl': {'pri': {'εγγραφήκαμε',
                                                           'εγγραφτήκαμε',
                                                           'ενεγράφημεν'},
                                                   'sec': {'εγγραφήκατε',
                                                           'εγγραφτήκατε',
                                                           'ενεγράφητε'},
                                                   'ter': {'εγγράφηκαν',
                                                           'εγγράφτηκαν',
                                                           'εγγραφήκανε',
                                                           'εγγραφτήκανε',
                                                           'ενεγράφησαν'}},
                                            'sg': {'pri': {'εγγράφηκα',
                                                           'εγγράφτηκα',
                                                           'ενεγράφην'},
                                                   'sec': {'εγγράφηκες',
                                                           'εγγράφτηκες',
                                                           'ενεγράφης'},
                                                   'ter': {'εγγράφηκε',
                                                           'εγγράφτηκε',
                                                           'ενεγράφη'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'εγγράφουσες'},
                                                         'gen': {'εγγραφουσών'},
                                                         'nom': {'εγγράφουσες'},
                                                         'voc': {'εγγράφουσες'}},
                                                 'masc': {'acc': {'εγγράφοντες'},
                                                          'gen': {'εγγραφόντων'},
                                                          'nom': {'εγγράφοντες'},
                                                          'voc': {'εγγράφοντες'}},
                                                 'neut': {'acc': {'εγγράφοντα'},
                                                          'gen': {'εγγραφόντων'},
                                                          'nom': {'εγγράφοντα'},
                                                          'voc': {'εγγράφοντα'}}},
                                          'sg': {'fem': {'acc': {'εγγράφουσα'},
                                                         'gen': {'εγγράφουσας'},
                                                         'nom': {'εγγράφουσα'},
                                                         'voc': {'εγγράφουσα'}},
                                                 'masc': {'acc': {'εγγράφοντα'},
                                                          'gen': {'εγγράφοντος'},
                                                          'nom': {'εγγράφων'},
                                                          'voc': {'εγγράφων'}},
                                                 'neut': {'acc': {'εγγράφον'},
                                                          'gen': {'εγγράφοντος'},
                                                          'nom': {'εγγράφον'},
                                                          'voc': {'εγγράφον'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'εγγράψτε'}},
                                                'sg': {'sec': {'έγγραψε'}}},
                                        'ind': {'pl': {'pri': {'εγγράψουμε', 'εγγράψομε'},
                                                       'sec': {'εγγράψετε'},
                                                       'ter': {'εγγράψουνε', 'εγγράψουν'}},
                                                'sg': {'pri': {'εγγράψω'},
                                                       'sec': {'εγγράψεις'},
                                                       'ter': {'εγγράψει'}}}},
                             'passive': {'imp': {'pl': {'sec': {'εγγραφείτε',
                                                                'εγγραφτείτε'}},
                                                 'sg': {'sec': {'εγγράψου'}}},
                                         'ind': {'pl': {'pri': {'εγγραφούμε',
                                                                'εγγραφτούμε'},
                                                        'sec': {'εγγραφείτε',
                                                                'εγγραφτείτε'},
                                                        'ter': {'εγγραφούν',
                                                                'εγγραφούνε',
                                                                'εγγραφτούν',
                                                                'εγγραφτούνε'}},
                                                 'sg': {'pri': {'εγγραφώ', 'εγγραφτώ'},
                                                        'sec': {'εγγραφτείς', 'εγγραφείς'},
                                                        'ter': {'εγγραφεί',
                                                                'εγγραφτεί'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'εγγράφαμε'},
                                                       'sec': {'εγγράφατε'},
                                                       'ter': {'έγγραφαν',
                                                               'εγγράφανε',
                                                               'ενέγραφαν'}},
                                                'sg': {'pri': {'έγγραφα', 'ενέγραφα'},
                                                       'sec': {'ενέγραφες', 'έγγραφες'},
                                                       'ter': {'έγγραφε', 'ενέγραφε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'εγγραφόμασταν',
                                                                'εγγραφόμαστε'},
                                                        'sec': {'εγγραφόσασταν',
                                                                'εγγραφόσαστε'},
                                                        'ter': {'εγγράφονταν',
                                                                'εγγραφόντουσαν'}},
                                                 'sg': {'pri': {'εγγραφόμουν',
                                                                'εγγραφόμουνα'},
                                                        'sec': {'εγγραφόσουν',
                                                                'εγγραφόσουνα'},
                                                        'ter': {'εγγραφόταν',
                                                                'εγγραφότανε'}}}}},
             'pass_pres_participle': {'pl': {'fem': {'acc': {'εγγραφόμενες'},
                                                     'gen': {'εγγραφόμενων'},
                                                     'nom': {'εγγραφόμενες'},
                                                     'voc': {'εγγραφόμενες'}},
                                             'masc': {'acc': {'εγγραφόμενους'},
                                                      'gen': {'εγγραφόμενων'},
                                                      'nom': {'εγγραφόμενοι'},
                                                      'voc': {'εγγραφόμενοι'}},
                                             'neut': {'acc': {'εγγραφόμενα'},
                                                      'gen': {'εγγραφόμενων'},
                                                      'nom': {'εγγραφόμενα'},
                                                      'voc': {'εγγραφόμενα'}}},
                                      'sg': {'fem': {'acc': {'εγγραφόμενη'},
                                                     'gen': {'εγγραφόμενης'},
                                                     'nom': {'εγγραφόμενη'},
                                                     'voc': {'εγγραφόμενη'}},
                                             'masc': {'acc': {'εγγραφόμενο'},
                                                      'gen': {'εγγραφόμενου'},
                                                      'nom': {'εγγραφόμενος'},
                                                      'voc': {'εγγραφόμενε'}},
                                             'neut': {'acc': {'εγγραφόμενο'},
                                                      'gen': {'εγγραφόμενου'},
                                                      'nom': {'εγγραφόμενο'},
                                                      'voc': {'εγγραφόμενο'}}}},
             'passive_aorist_participle': {'pl': {'fem': {'acc': {'εγγραφείσες'},
                                                          'gen': {'εγγραφεισών'},
                                                          'nom': {'εγγραφείσες'},
                                                          'voc': {'εγγραφείσες'}},
                                                  'masc': {'acc': {'εγγραφέντες'},
                                                           'gen': {'εγγραφέντων'},
                                                           'nom': {'εγγραφέντες'},
                                                           'voc': {'εγγραφέντες'}},
                                                  'neut': {'acc': {'εγγραφέντα'},
                                                           'gen': {'εγγραφέντων'},
                                                           'nom': {'εγγραφέντα'},
                                                           'voc': {'εγγραφέντα'}}},
                                           'sg': {'fem': {'acc': {'εγγραφείσα'},
                                                          'gen': {'εγγραφείσας'},
                                                          'nom': {'εγγραφείσα'},
                                                          'voc': {'εγγραφείσα'}},
                                                  'masc': {'acc': {'εγγραφέντα'},
                                                           'gen': {'εγγραφέντος'},
                                                           'nom': {'εγγραφείς'},
                                                           'voc': {'εγγραφείς'}},
                                                  'neut': {'acc': {'εγγραφέν'},
                                                           'gen': {'εγγραφέντος'},
                                                           'nom': {'εγγραφέν'},
                                                           'voc': {'εγγραφέν'}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'εγγεγραμμένες',
                                                                   'εγγραμμένες'},
                                                           'gen': {'εγγεγραμμένων',
                                                                   'εγγραμμένων'},
                                                           'nom': {'εγγεγραμμένες',
                                                                   'εγγραμμένες'},
                                                           'voc': {'εγγεγραμμένες',
                                                                   'εγγραμμένες'}},
                                                   'masc': {'acc': {'εγγεγραμμένους',
                                                                    'εγγραμμένους'},
                                                            'gen': {'εγγεγραμμένων',
                                                                    'εγγραμμένων'},
                                                            'nom': {'εγγεγραμμένοι',
                                                                    'εγγραμμένοι'},
                                                            'voc': {'εγγεγραμμένοι',
                                                                    'εγγραμμένοι'}},
                                                   'neut': {'acc': {'εγγεγραμμένα',
                                                                    'εγγραμμένα'},
                                                            'gen': {'εγγεγραμμένων',
                                                                    'εγγραμμένων'},
                                                            'nom': {'εγγεγραμμένα',
                                                                    'εγγραμμένα'},
                                                            'voc': {'εγγεγραμμένα',
                                                                    'εγγραμμένα'}}},
                                            'sg': {'fem': {'acc': {'εγγεγραμμένη',
                                                                   'εγγραμμένη'},
                                                           'gen': {'εγγεγραμμένης',
                                                                   'εγγραμμένης'},
                                                           'nom': {'εγγεγραμμένη',
                                                                   'εγγραμμένη'},
                                                           'voc': {'εγγεγραμμένη',
                                                                   'εγγραμμένη'}},
                                                   'masc': {'acc': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'},
                                                            'gen': {'εγγεγραμμένου',
                                                                    'εγγραμμένου'},
                                                            'nom': {'εγγεγραμμένος',
                                                                    'εγγραμμένος'},
                                                            'voc': {'εγγεγραμμένε',
                                                                    'εγγραμμένε'}},
                                                   'neut': {'acc': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'},
                                                            'gen': {'εγγεγραμμένου',
                                                                    'εγγραμμένου'},
                                                            'nom': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'},
                                                            'voc': {'εγγεγραμμένο',
                                                                    'εγγραμμένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'εγγράφετε'}},
                                            'sg': {'sec': {'έγγραφε'}}},
                                    'ind': {'pl': {'pri': {'εγγράφουμε', 'εγγράφομε'},
                                                   'sec': {'εγγράφετε'},
                                                   'ter': {'εγγράφουνε', 'εγγράφουν'}},
                                            'sg': {'pri': {'εγγράφω'},
                                                   'sec': {'εγγράφεις'},
                                                   'ter': {'εγγράφει'}}}},
                         'passive': {'imp': {'pl': {'sec': {'εγγράφεστε'}},
                                             'sg': {'sec': {'εγγράφου'}}},
                                     'ind': {'pl': {'pri': {'εγγραφόμαστε'},
                                                    'sec': {'εγγραφόσαστε', 'εγγράφεστε'},
                                                    'ter': {'εγγράφονται'}},
                                             'sg': {'pri': {'εγγράφομαι'},
                                                    'sec': {'εγγράφεσαι'},
                                                    'ter': {'εγγράφεται'}}}}}}

        )

    def test_verb_phgainw(self):
        self.assertDictEqual(
            verb.create_all_forms('πηγαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'πηγαίνω'}, 'sec': {'πηγαίνεις'}, 'ter': {'πηγαίνει'}},
                                            'pl': {'pri': {'πηγαίνουμε', 'πηγαίνομε'}, 'sec': {'πηγαίνετε'},
                                                   'ter': {'πηγαίνουνε', 'πηγαίνουν'}}},
                                    'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                   'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'}, 'ter': {'πήγαν', 'πήγανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                                'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                       'ter': {'πηγαίνανε', 'πήγαιναν'}}}}},
             'act_pres_participle': {'πηγαίνοντας'}}
        )

    def test_verb_prokeitai(self):
        self.assertDictEqual(
            verb.create_all_forms('πρόκειται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'πρόκειται'}}}}},
             'aorist': {},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'επρόκειτο'}}}}}},
        )

    def test_verb_symbainei(self):
        self.assertDictEqual(
            verb.create_all_forms('συμβαίνει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'συμβαίνει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'συμβεί'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'συνέβη'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'συνέβαινε'}}}}}}
        )

    def test_verb_xairw_imper(self):
        self.assertDictEqual(
            verb.create_all_forms('χαίρω')['present']['active']['imp'],
            {'sg': {'sec': {'χαίρε'}}, 'pl': {'sec': {'χαίρετε'}}}

        )


    def test_verb_parkaro(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παρκάρω'),
            {'act_pres_participle': {'παρκάροντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'παρκαρίσαμε', 'παρκάραμε'},
                                                  'sec': {'παρκαρίσατε', 'παρκάρατε'},
                                                  'ter': {'πάρκαραν',
                                                          'παρκάρανε',
                                                          'παρκάρισαν',
                                                          'παρκαρίσανε'}},
                                           'sg': {'pri': {'παρκάρισα', 'πάρκαρα'},
                                                  'sec': {'παρκάρισες', 'πάρκαρες'},
                                                  'ter': {'παρκάρισε', 'πάρκαρε'}}}},
                        'passive': {'ind': {'pl': {'pri': {'παρκαριστήκαμε'},
                                                   'sec': {'παρκαριστήκατε'},
                                                   'ter': {'παρκαρίστηκαν',
                                                           'παρκαριστήκανε'}},
                                            'sg': {'pri': {'παρκαρίστηκα'},
                                                   'sec': {'παρκαρίστηκες'},
                                                   'ter': {'παρκαρίστηκε'}}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'παρκάρετε', 'παρκαρίστε'}},
                                                'sg': {'sec': {'παρκάρισε', 'πάρκαρε'}}},
                                        'ind': {'pl': {'pri': {'παρκάρομε',
                                                               'παρκάρουμε',
                                                               'παρκαρίσομε',
                                                               'παρκαρίσουμε'},
                                                       'sec': {'παρκαρίσετε', 'παρκάρετε'},
                                                       'ter': {'παρκάρουν',
                                                               'παρκάρουνε',
                                                               'παρκαρίσουν',
                                                               'παρκαρίσουνε'}},
                                                'sg': {'pri': {'παρκαρίσω', 'παρκάρω'},
                                                       'sec': {'παρκάρεις', 'παρκαρίσεις'},
                                                       'ter': {'παρκαρίσει', 'παρκάρει'}}}},
                             'passive': {'imp': {'pl': {'sec': {'παρκαριστείτε'}},
                                                 'sg': {'sec': {'παρκαρίσου'}}},
                                         'ind': {'pl': {'pri': {'παρκαριστούμε'},
                                                        'sec': {'παρκαριστείτε'},
                                                        'ter': {'παρκαριστούν',
                                                                'παρκαριστούνε'}},
                                                 'sg': {'pri': {'παρκαριστώ'},
                                                        'sec': {'παρκαριστείς'},
                                                        'ter': {'παρκαριστεί'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'παρκαρίζαμε', 'παρκάραμε'},
                                                       'sec': {'παρκαρίζατε', 'παρκάρατε'},
                                                       'ter': {'πάρκαραν',
                                                               'παρκάρανε',
                                                               'παρκάριζαν',
                                                               'παρκαρίζανε'}},
                                                'sg': {'pri': {'πάρκαρα', 'παρκάριζα'},
                                                       'sec': {'παρκάριζες', 'πάρκαρες'},
                                                       'ter': {'παρκάριζε', 'πάρκαρε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'παρκαρόμασταν',
                                                                'παρκαρόμαστε'},
                                                        'sec': {'παρκαρόσασταν',
                                                                'παρκαρόσαστε'},
                                                        'ter': {'παρκάρονταν',
                                                                'παρκαρόντουσαν'}},
                                                 'sg': {'pri': {'παρκαρόμουν',
                                                                'παρκαρόμουνα'},
                                                        'sec': {'παρκαρόσουν',
                                                                'παρκαρόσουνα'},
                                                        'ter': {'παρκαρόταν',
                                                                'παρκαρότανε'}}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'παρκαρισμένες'},
                                                           'gen': {'παρκαρισμένων'},
                                                           'nom': {'παρκαρισμένες'},
                                                           'voc': {'παρκαρισμένες'}},
                                                   'masc': {'acc': {'παρκαρισμένους'},
                                                            'gen': {'παρκαρισμένων'},
                                                            'nom': {'παρκαρισμένοι'},
                                                            'voc': {'παρκαρισμένοι'}},
                                                   'neut': {'acc': {'παρκαρισμένα'},
                                                            'gen': {'παρκαρισμένων'},
                                                            'nom': {'παρκαρισμένα'},
                                                            'voc': {'παρκαρισμένα'}}},
                                            'sg': {'fem': {'acc': {'παρκαρισμένη'},
                                                           'gen': {'παρκαρισμένης'},
                                                           'nom': {'παρκαρισμένη'},
                                                           'voc': {'παρκαρισμένη'}},
                                                   'masc': {'acc': {'παρκαρισμένο'},
                                                            'gen': {'παρκαρισμένου'},
                                                            'nom': {'παρκαρισμένος'},
                                                            'voc': {'παρκαρισμένε'}},
                                                   'neut': {'acc': {'παρκαρισμένο'},
                                                            'gen': {'παρκαρισμένου'},
                                                            'nom': {'παρκαρισμένο'},
                                                            'voc': {'παρκαρισμένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'παρκάρετε'}},
                                            'sg': {'sec': {'πάρκαρε'}}},
                                    'ind': {'pl': {'pri': {'παρκάρομε', 'παρκάρουμε'},
                                                   'sec': {'παρκάρετε'},
                                                   'ter': {'παρκάρουνε', 'παρκάρουν'}},
                                            'sg': {'pri': {'παρκάρω'},
                                                   'sec': {'παρκάρεις'},
                                                   'ter': {'παρκάρει'}}}},
                         'passive': {'imp': {'pl': {'sec': {'παρκάρεστε'}},
                                             'sg': {'sec': {'παρκάρου'}}},
                                     'ind': {'pl': {'pri': {'παρκαρόμαστε'},
                                                    'sec': {'παρκαρόσαστε', 'παρκάρεστε'},
                                                    'ter': {'παρκάρονται'}},
                                             'sg': {'pri': {'παρκάρομαι'},
                                                    'sec': {'παρκάρεσαι'},
                                                    'ter': {'παρκάρεται'}}}}}}

        )

    def test_verb_apexw(self):
        self.assertDictEqual(
            verb.create_all_forms('απέχω'),
            {'act_pres_participle': {'απέχοντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'απείχαμε'},
                                                  'sec': {'απείχατε'},
                                                  'ter': {'απείχαν', 'απείχανε'}},
                                           'sg': {'pri': {'απείχα'},
                                                  'sec': {'απείχες'},
                                                  'ter': {'απείχε'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'απέχουσες'},
                                                         'gen': {'απεχουσών'},
                                                         'nom': {'απέχουσες'},
                                                         'voc': {'απέχουσες'}},
                                                 'masc': {'acc': {'απέχοντες'},
                                                          'gen': {'απεχόντων'},
                                                          'nom': {'απέχοντες'},
                                                          'voc': {'απέχοντες'}},
                                                 'neut': {'acc': {'απέχοντα'},
                                                          'gen': {'απεχόντων'},
                                                          'nom': {'απέχοντα'},
                                                          'voc': {'απέχοντα'}}},
                                          'sg': {'fem': {'acc': {'απέχουσα'},
                                                         'gen': {'απέχουσας'},
                                                         'nom': {'απέχουσα'},
                                                         'voc': {'απέχουσα'}},
                                                 'masc': {'acc': {'απέχοντα'},
                                                          'gen': {'απέχοντος'},
                                                          'nom': {'απέχων'},
                                                          'voc': {'απέχων'}},
                                                 'neut': {'acc': {'απέχον'},
                                                          'gen': {'απέχοντος'},
                                                          'nom': {'απέχον'},
                                                          'voc': {'απέχον'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'απέχετε'}},
                                                'sg': {'sec': {'άπεχε'}}},
                                        'ind': {'pl': {'pri': {'απέχουμε', 'απέχομε'},
                                                       'sec': {'απέχετε'},
                                                       'ter': {'απέχουνε', 'απέχουν'}},
                                                'sg': {'pri': {'απέχω'},
                                                       'sec': {'απέχεις'},
                                                       'ter': {'απέχει'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'απείχαμε'},
                                                       'sec': {'απείχατε'},
                                                       'ter': {'απείχαν', 'απείχανε'}},
                                                'sg': {'pri': {'απείχα'},
                                                       'sec': {'απείχες'},
                                                       'ter': {'απείχε'}}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'απέχετε'}},
                                            'sg': {'sec': {'άπεχε'}}},
                                    'ind': {'pl': {'pri': {'απέχουμε', 'απέχομε'},
                                                   'sec': {'απέχετε'},
                                                   'ter': {'απέχουνε', 'απέχουν'}},
                                            'sg': {'pri': {'απέχω'},
                                                   'sec': {'απέχεις'},
                                                   'ter': {'απέχει'}}}}}}

        )

    def test_verb_kserw(self):
        self.assertDictEqual(
            verb.create_all_forms('ξέρω'),
            {'present':
                 {'active':
                      {'ind':
                           {'sg': {'pri': {'ξέρω'}, 'sec': {'ξέρεις', 'ξες'}, 'ter': {'ξέρει'}},
                            'pl': {'pri': {'ξέρουμε', 'ξέρομε'}, 'sec': {'ξέρετε'},
                                   'ter': {'ξέρουν', 'ξέρουνε'}}},
                       'imp': {'sg': {'sec': {'ξέρε'}}, 'pl': {'sec': {'ξέρετε'}}}}},
             'conjunctive': {},
             'aorist': {},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'ήξερα'}, 'sec': {'ήξερες'}, 'ter': {'ήξερε'}},
                         'pl': {'pri': {'ξέραμε'}, 'sec': {'ξέρατε'}, 'ter': {'ξέρανε', 'ήξεραν'}}}}},
             'act_pres_participle': {'ξέροντας'}}

        )

    def test_verb_synistwmai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συνιστώμαι')['conjunctive']["passive"],
            {'ind': {'sg': {'pri': {'συσταθώ'}, 'sec': {'συσταθείς'}, 'ter': {'συσταθεί'}},
                     'pl': {'pri': {'συσταθούμε'}, 'sec': {'συσταθείτε'}, 'ter': {'συσταθούν', 'συσταθούνε'}}},
             'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'συσταθείτε'}}}}

        )

    def test_verb_pairnw(self):

        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παίρνω'),
            {'present':
                 {'active': {'ind': {'sg': {'pri': {'παίρνω'}, 'sec': {'παίρνεις'}, 'ter': {'παίρνει'}},
                                     'pl': {'pri': {'παίρνουμε', 'παίρνομε'}, 'sec': {'παίρνετε'},
                                            'ter': {'παίρνουνε', 'παίρνουν'}}},
                             'imp': {'sg': {'sec': {'παίρνε'}},
                                     'pl': {'sec': {'παίρνετε'}}}},
                  'passive': {
                      'ind': {'sg': {'pri': {'παίρνομαι'}, 'sec': {'παίρνεσαι'}, 'ter': {'παίρνεται'}},
                              'pl': {'pri': {'παιρνόμαστε'}, 'sec': {'παίρνεστε', 'παιρνόσαστε'},
                                     'ter': {'παίρνονται'}}},
                      'imp': {'pl': {'sec': {'παίρνεστε'}}, 'sg': {'sec': {'παίρνου'}}}}},
             'conjunctive': {'active': {
                 'ind': {'sg': {'pri': {'πάρω'}, 'sec': {'πάρεις'}, 'ter': {'πάρει'}},
                         'pl': {'pri': {'πάρουμε', 'πάρομε'}, 'sec': {'πάρετε'}, 'ter': {'πάρουνε', 'πάρουν'}}},
                 'imp': {'sg': {'sec': {'πάρε'}}, 'pl': {'sec': {'πάρτε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'παρθώ'}, 'sec': {'παρθείς'}, 'ter': {'παρθεί'}},
                         'pl': {'pri': {'παρθούμε'}, 'sec': {'παρθείτε'}, 'ter': {'παρθούνε', 'παρθούν'}}},
                 'imp': {'sg': {'sec': {'πάρσου'}}, 'pl': {'sec': {'παρθείτε'}}}}},
             'aorist': {'active': {
                 'ind': {'sg': {'pri': {'πήρα'}, 'sec': {'πήρες'}, 'ter': {'πήρε'}},
                         'pl': {'pri': {'πήραμε'}, 'sec': {'πήρατε'}, 'ter': {'πήραν', 'πήρανε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'πάρθηκα'}, 'sec': {'πάρθηκες'}, 'ter': {'πάρθηκε'}},
                         'pl': {'pri': {'παρθήκαμε'}, 'sec': {'παρθήκατε'}, 'ter': {'παρθήκανε', 'πάρθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έπαιρνα'}, 'sec': {'έπαιρνες'}, 'ter': {'έπαιρνε'}},
                                                'pl': {'pri': {'παίρναμε'}, 'sec': {'παίρνατε'},
                                                       'ter': {'έπαιρναν', 'παίρνανε'}}}},
                             'passive': {'ind': {
                                 'sg': {'pri': {'παιρνόμουνα', 'παιρνόμουν'}, 'sec': {'παιρνόσουνα', 'παιρνόσουν'},
                                        'ter': {'παιρνότανε', 'παιρνόταν'}},
                                 'pl': {'pri': {'παιρνόμαστε', 'παιρνόμασταν'}, 'sec': {'παιρνόσασταν', 'παιρνόσαστε'},
                                        'ter': {'παίρνονταν', 'παιρνόντουσαν'}}}}},
             'act_pres_participle': {'παίρνοντας'},
             'passive_perfect_participle': {
                 'sg': {'fem': {'gen': {'παρμένης'}, 'acc': {'παρμένη'}, 'voc': {'παρμένη'}, 'nom': {'παρμένη'}},
                        'masc': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένε'}, 'nom': {'παρμένος'}},
                        'neut': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένο'}, 'nom': {'παρμένο'}}},
                 'pl': {'fem': {'gen': {'παρμένων'}, 'acc': {'παρμένες'}, 'voc': {'παρμένες'}, 'nom': {'παρμένες'}},
                        'masc': {'gen': {'παρμένων'}, 'acc': {'παρμένους'}, 'voc': {'παρμένοι'}, 'nom': {'παρμένοι'}},
                        'neut': {'gen': {'παρμένων'}, 'acc': {'παρμένα'}, 'voc': {'παρμένα'}, 'nom': {'παρμένα'}}}}},

        )

    def test_verb_spaw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('σπάω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'σπάω'}, 'sec': {'σπας'}, 'ter': {'σπάει'}},
                                            'pl': {'pri': {'σπάμε'}, 'sec': {'σπάτε'}, 'ter': {'σπαν', 'σπάνε'}}},
                                    'imp': {'sg': {'sec': {'σπάγε'}}, 'pl': {'sec': {'σπάγετε', 'σπάτε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'σπάσω'}, 'sec': {'σπάσεις'}, 'ter': {'σπάσει'}},
                                                'pl': {'pri': {'σπάσουμε', 'σπάσομε'}, 'sec': {'σπάσετε'},
                                                       'ter': {'σπάσουνε', 'σπάσουν'}}},
                                        'imp': {'sg': {'sec': {'σπάσε'}}, 'pl': {'sec': {'σπάστε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'σπαστώ', 'σπασθώ'}, 'sec': {'σπασθείς', 'σπαστείς'},
                                'ter': {'σπασθεί', 'σπαστεί'}},
                         'pl': {'pri': {'σπαστούμε', 'σπασθούμε'}, 'sec': {'σπαστείτε', 'σπασθείτε'},
                                'ter': {'σπασθούνε', 'σπαστούνε', 'σπασθούν', 'σπαστούν'}}},
                 'imp': {'sg': {'sec': {'σπάσου'}}, 'pl': {'sec': {'σπαστείτε', 'σπασθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'έσπασα'}, 'sec': {'έσπασες'}, 'ter': {'έσπασε'}},
                        'pl': {'pri': {'σπάσαμε'}, 'sec': {'σπάσατε'}, 'ter': {'έσπασαν', 'σπάσανε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'σπάστηκα', 'σπάσθηκα'}, 'sec': {'σπάσθηκες', 'σπάστηκες'},
                               'ter': {'σπάσθηκε', 'σπάστηκε'}},
                        'pl': {'pri': {'σπασθήκαμε', 'σπαστήκαμε'}, 'sec': {'σπαστήκατε', 'σπασθήκατε'},
                               'ter': {'σπαστήκανε', 'σπασθήκανε', 'σπάστηκαν', 'σπάσθηκαν'}}}}}, 'paratatikos': {
                'active': {'ind': {'sg': {'pri': {'έσπαγα'}, 'sec': {'έσπαγες'}, 'ter': {'έσπαγε'}},
                                   'pl': {'pri': {'σπάγαμε'}, 'sec': {'σπάγατε'}, 'ter': {'σπάγανε', 'έσπαγαν'}}}}},
             'act_pres_participle': {'σπάγοντας'}, 'passive_perfect_participle': {
                'pl': {'fem': {'gen': {'σπασμένων'}, 'nom': {'σπασμένες'}, 'voc': {'σπασμένες'}, 'acc': {'σπασμένες'}},
                       'neut': {'gen': {'σπασμένων'}, 'nom': {'σπασμένα'}, 'voc': {'σπασμένα'}, 'acc': {'σπασμένα'}},
                       'masc': {'gen': {'σπασμένων'}, 'nom': {'σπασμένοι'}, 'voc': {'σπασμένοι'},
                                'acc': {'σπασμένους'}}},
                'sg': {'fem': {'gen': {'σπασμένης'}, 'nom': {'σπασμένη'}, 'voc': {'σπασμένη'}, 'acc': {'σπασμένη'}},
                       'neut': {'gen': {'σπασμένου'}, 'nom': {'σπασμένο'}, 'voc': {'σπασμένο'}, 'acc': {'σπασμένο'}},
                       'masc': {'gen': {'σπασμένου'}, 'nom': {'σπασμένος'}, 'voc': {'σπασμένε'}, 'acc': {'σπασμένο'}}}}}

        )


    def test_verb_paraballo_con(self):
        self.assertDictEqual(
            verb.create_all_forms('παραβάλλω')['conjunctive']['passive'],
            {'ind': {'sg': {'pri': {'παραβληθώ'}, 'sec': {'παραβληθείς'}, 'ter': {'παραβληθεί'}},
                     'pl': {'pri': {'παραβληθούμε'}, 'sec': {'παραβληθείτε'}, 'ter': {'παραβληθούνε', 'παραβληθούν'}}},
             'imp': {'sg': {'sec': {'παραβλήσου'}}, 'pl': {'sec': {'παραβληθείτε'}}}}

        )

    def test_verb_symmetexo_aorist(self):
        self.assertDictEqual(
            verb.create_all_forms('συμμετέχω')['conjunctive'],
            {'active': {'imp': {'pl': {'sec': {'συμμετέχετε', 'συμμετάσχετε'}},
                                'sg': {'sec': {'συμμέτασχε', 'συμμέτεχε'}}},
                        'ind': {'pl': {'pri': {'συμμετέχουμε', 'συμμετάσχουμε', 'συμμετέχομε', 'συμμετάσχομε'},
                                       'sec': {'συμμετέχετε', 'συμμετάσχετε'},
                                       'ter': {'συμμετάσχουν',
                                               'συμμετάσχουνε',
                                               'συμμετέχουν',
                                               'συμμετέχουνε'}},
                                'sg': {'pri': {'συμμετάσχω', 'συμμετέχω'},
                                       'sec': {'συμμετάσχεις', 'συμμετέχεις'},
                                       'ter': {'συμμετάσχει', 'συμμετέχει'}}}}}

        )

    def test_verb_sympitw_aor(self):
        self.assertDictEqual(
            verb.create_all_forms('συμπίπτω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'συνέπεσα'}, 'sec': {'συνέπεσες'}, 'ter': {'συνέπεσε'}},
                                'pl': {'pri': {'συμπέσαμε'}, 'sec': {'συμπέσατε'},
                                       'ter': {'συνέπεσαν', 'συμπέσανε'}}}}},

        )

    def test_verb_anameignuw(self):
        self.assertDictEqual(
            verb.create_all_forms('αναμειγνύω'),
            {'act_pres_participle': {'αναμειγνύοντας'},
             'active_aorist_participle': {'pl': {'fem': {'acc': {'αναμείξασες'},
                                                         'gen': {'αναμειξασών'},
                                                         'nom': {'αναμείξασες'},
                                                         'voc': {'αναμείξασες'}},
                                                 'masc': {'acc': {'αναμείξαντες'},
                                                          'gen': {'αναμειξάντων'},
                                                          'nom': {'αναμείξαντες'},
                                                          'voc': {'αναμείξαντες'}},
                                                 'neut': {'acc': {'αναμείξαντα'},
                                                          'gen': {'αναμειξάντων'},
                                                          'nom': {'αναμείξαντα'},
                                                          'voc': {'αναμείξαντα'}}},
                                          'sg': {'fem': {'acc': {'αναμείξασα'},
                                                         'gen': {'αναμείξασας'},
                                                         'nom': {'αναμείξασα'},
                                                         'voc': {'αναμείξασα'}},
                                                 'masc': {'acc': {'αναμείξαντα'},
                                                          'gen': {'αναμείξαντος'},
                                                          'nom': {'αναμείξας'},
                                                          'voc': {'αναμείξας'}},
                                                 'neut': {'acc': {'αναμείξαν'},
                                                          'gen': {'αναμείξαντος'},
                                                          'nom': {'αναμείξαν'},
                                                          'voc': {'αναμείξαν'}}}},
             'aorist': {'active': {'ind': {'pl': {'pri': {'αναμείξαμε'},
                                                  'sec': {'αναμείξατε'},
                                                  'ter': {'ανάμειξαν',
                                                          'ανέμειξαν',
                                                          'αναμείξανε'}},
                                           'sg': {'pri': {'ανάμειξα', 'ανέμειξα'},
                                                  'sec': {'ανέμειξες', 'ανάμειξες'},
                                                  'ter': {'ανάμειξε', 'ανέμειξε'}}}},
                        'passive': {'ind': {'pl': {'pri': {'αναμειχθήκαμε'},
                                                   'sec': {'αναμειχθήκατε'},
                                                   'ter': {'αναμείχθηκαν',
                                                           'αναμειχθήκανε'}},
                                            'sg': {'pri': {'αναμείχθηκα'},
                                                   'sec': {'αναμείχθηκες'},
                                                   'ter': {'αναμείχθηκε'}}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'αναμείξτε'}},
                                                'sg': {'sec': {'ανάμειξε'}}},
                                        'ind': {'pl': {'pri': {'αναμείξουμε', 'αναμείξομε'},
                                                       'sec': {'αναμείξετε'},
                                                       'ter': {'αναμείξουν',
                                                               'αναμείξουνε'}},
                                                'sg': {'pri': {'αναμείξω'},
                                                       'sec': {'αναμείξεις'},
                                                       'ter': {'αναμείξει'}}}},
                             'passive': {'imp': {'pl': {'sec': {'αναμειχθείτε'}},
                                                 'sg': {'sec': {'αναμείξου'}}},
                                         'ind': {'pl': {'pri': {'αναμειχθούμε'},
                                                        'sec': {'αναμειχθείτε'},
                                                        'ter': {'αναμειχθούν',
                                                                'αναμειχθούνε'}},
                                                 'sg': {'pri': {'αναμειχθώ'},
                                                        'sec': {'αναμειχθείς'},
                                                        'ter': {'αναμειχθεί'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'αναμειγνύαμε'},
                                                       'sec': {'αναμειγνύατε'},
                                                       'ter': {'αναμείγνυαν',
                                                               'αναμειγνύανε'}},
                                                'sg': {'pri': {'αναμείγνυα'},
                                                       'sec': {'αναμείγνυες'},
                                                       'ter': {'αναμείγνυε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'αναμειγνυόμασταν',
                                                                'αναμειγνυόμαστε'},
                                                        'sec': {'αναμειγνυόσασταν',
                                                                'αναμειγνυόσαστε'},
                                                        'ter': {'αναμειγνύονταν',
                                                                'αναμειγνυόντουσαν'}},
                                                 'sg': {'pri': {'αναμειγνυόμουν',
                                                                'αναμειγνυόμουνα'},
                                                        'sec': {'αναμειγνυόσουν',
                                                                'αναμειγνυόσουνα'},
                                                        'ter': {'αναμειγνυόταν',
                                                                'αναμειγνυότανε'}}}}},
             'pass_pres_participle': {'pl': {'fem': {'acc': {'αναμειγνυόμενες'},
                                                     'gen': {'αναμειγνυόμενων'},
                                                     'nom': {'αναμειγνυόμενες'},
                                                     'voc': {'αναμειγνυόμενες'}},
                                             'masc': {'acc': {'αναμειγνυόμενους'},
                                                      'gen': {'αναμειγνυόμενων'},
                                                      'nom': {'αναμειγνυόμενοι'},
                                                      'voc': {'αναμειγνυόμενοι'}},
                                             'neut': {'acc': {'αναμειγνυόμενα'},
                                                      'gen': {'αναμειγνυόμενων'},
                                                      'nom': {'αναμειγνυόμενα'},
                                                      'voc': {'αναμειγνυόμενα'}}},
                                      'sg': {'fem': {'acc': {'αναμειγνυόμενη'},
                                                     'gen': {'αναμειγνυόμενης'},
                                                     'nom': {'αναμειγνυόμενη'},
                                                     'voc': {'αναμειγνυόμενη'}},
                                             'masc': {'acc': {'αναμειγνυόμενο'},
                                                      'gen': {'αναμειγνυόμενου'},
                                                      'nom': {'αναμειγνυόμενος'},
                                                      'voc': {'αναμειγνυόμενε'}},
                                             'neut': {'acc': {'αναμειγνυόμενο'},
                                                      'gen': {'αναμειγνυόμενου'},
                                                      'nom': {'αναμειγνυόμενο'},
                                                      'voc': {'αναμειγνυόμενο'}}}},
             'passive_aorist_participle': {'pl': {'fem': {'acc': {'αναμειχθείσες'},
                                                          'gen': {'αναμειχθεισών'},
                                                          'nom': {'αναμειχθείσες'},
                                                          'voc': {'αναμειχθείσες'}},
                                                  'masc': {'acc': {'αναμειχθέντες'},
                                                           'gen': {'αναμειχθέντων'},
                                                           'nom': {'αναμειχθέντες'},
                                                           'voc': {'αναμειχθέντες'}},
                                                  'neut': {'acc': {'αναμειχθέντα'},
                                                           'gen': {'αναμειχθέντων'},
                                                           'nom': {'αναμειχθέντα'},
                                                           'voc': {'αναμειχθέντα'}}},
                                           'sg': {'fem': {'acc': {'αναμειχθείσα'},
                                                          'gen': {'αναμειχθείσας'},
                                                          'nom': {'αναμειχθείσα'},
                                                          'voc': {'αναμειχθείσα'}},
                                                  'masc': {'acc': {'αναμειχθέντα'},
                                                           'gen': {'αναμειχθέντος'},
                                                           'nom': {'αναμειχθείς'},
                                                           'voc': {'αναμειχθείς'}},
                                                  'neut': {'acc': {'αναμειχθέν'},
                                                           'gen': {'αναμειχθέντος'},
                                                           'nom': {'αναμειχθέν'},
                                                           'voc': {'αναμειχθέν'}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'αναμειγμένες',
                                                                   'αναμεμειγμένες'},
                                                           'gen': {'αναμειγμένων',
                                                                   'αναμεμειγμένων'},
                                                           'nom': {'αναμειγμένες',
                                                                   'αναμεμειγμένες'},
                                                           'voc': {'αναμειγμένες',
                                                                   'αναμεμειγμένες'}},
                                                   'masc': {'acc': {'αναμειγμένους',
                                                                    'αναμεμειγμένους'},
                                                            'gen': {'αναμειγμένων',
                                                                    'αναμεμειγμένων'},
                                                            'nom': {'αναμειγμένοι',
                                                                    'αναμεμειγμένοι'},
                                                            'voc': {'αναμειγμένοι',
                                                                    'αναμεμειγμένοι'}},
                                                   'neut': {'acc': {'αναμειγμένα',
                                                                    'αναμεμειγμένα'},
                                                            'gen': {'αναμειγμένων',
                                                                    'αναμεμειγμένων'},
                                                            'nom': {'αναμειγμένα',
                                                                    'αναμεμειγμένα'},
                                                            'voc': {'αναμειγμένα',
                                                                    'αναμεμειγμένα'}}},
                                            'sg': {'fem': {'acc': {'αναμειγμένη',
                                                                   'αναμεμειγμένη'},
                                                           'gen': {'αναμειγμένης',
                                                                   'αναμεμειγμένης'},
                                                           'nom': {'αναμειγμένη',
                                                                   'αναμεμειγμένη'},
                                                           'voc': {'αναμειγμένη',
                                                                   'αναμεμειγμένη'}},
                                                   'masc': {'acc': {'αναμειγμένο',
                                                                    'αναμεμειγμένο'},
                                                            'gen': {'αναμειγμένου',
                                                                    'αναμεμειγμένου'},
                                                            'nom': {'αναμειγμένος',
                                                                    'αναμεμειγμένος'},
                                                            'voc': {'αναμειγμένε',
                                                                    'αναμεμειγμένε'}},
                                                   'neut': {'acc': {'αναμειγμένο',
                                                                    'αναμεμειγμένο'},
                                                            'gen': {'αναμειγμένου',
                                                                    'αναμεμειγμένου'},
                                                            'nom': {'αναμειγμένο',
                                                                    'αναμεμειγμένο'},
                                                            'voc': {'αναμειγμένο',
                                                                    'αναμεμειγμένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'αναμειγνύετε'}},
                                            'sg': {'sec': {'αναμείγνυε'}}},
                                    'ind': {'pl': {'pri': {'αναμειγνύουμε', 'αναμειγνύομε'},
                                                   'sec': {'αναμειγνύετε'},
                                                   'ter': {'αναμειγνύουν',
                                                           'αναμειγνύουνε'}},
                                            'sg': {'pri': {'αναμειγνύω'},
                                                   'sec': {'αναμειγνύεις'},
                                                   'ter': {'αναμειγνύει'}}}},
                         'passive': {'imp': {'pl': {'sec': {'αναμειγνύεστε'}},
                                             'sg': {'sec': {'αναμειγνύου'}}},
                                     'ind': {'pl': {'pri': {'αναμειγνυόμαστε'},
                                                    'sec': {'αναμειγνυόσαστε',
                                                            'αναμειγνύεστε'},
                                                    'ter': {'αναμειγνύονται'}},
                                             'sg': {'pri': {'αναμειγνύομαι'},
                                                    'sec': {'αναμειγνύεσαι'},
                                                    'ter': {'αναμειγνύεται'}}}}}}

        )

    def test_verb_antilambanomai_imp(self):
        self.assertDictEqual(
            verb.create_all_forms('αντιλαμβάνομαι')['conjunctive']['passive']['imp'],
            {'sg': {'sec': {'αντιλήψου'}}, 'pl': {'sec': {'αντιληφθείτε'}}}

        )

    def test_verb_teleiwnw(self):
        self.assertDictEqual(

            verb.create_all_forms('τελειώνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'τελειώνω'}, 'sec': {'τελειώνεις'}, 'ter': {'τελειώνει'}},
                                            'pl': {'pri': {'τελειώνουμε', 'τελειώνομε'}, 'sec': {'τελειώνετε'},
                                                   'ter': {'τελειώνουνε', 'τελειώνουν'}}},
                                    'imp': {'sg': {'sec': {'τελείωνε', 'τέλειωνε'}}, 'pl': {'sec': {'τελειώνετε'}}}},
                         'passive': {
                             'ind': {'sg': {'pri': {'τελειώνομαι'}, 'sec': {'τελειώνεσαι'}, 'ter': {'τελειώνεται'}},
                                     'pl': {'pri': {'τελειωνόμαστε'}, 'sec': {'τελειωνόσαστε', 'τελειώνεστε'},
                                            'ter': {'τελειώνονται'}}}, 'imp': {
                                 'pl': {'sec': {'τελειώνεστε'}},
                                 'sg': {'sec': {'τελειώνου'}}
                             }
                         }},
             'conjunctive': {'active': {
                 'ind': {'sg': {'pri': {'τελειώσω'}, 'sec': {'τελειώσεις'}, 'ter': {'τελειώσει'}},
                         'pl': {'pri': {'τελειώσουμε', 'τελειώσομε'}, 'sec': {'τελειώσετε'},
                                'ter': {'τελειώσουν', 'τελειώσουνε'}}},
                 'imp': {'sg': {'sec': {'τελείωσε', 'τέλειωσε'}}, 'pl': {'sec': {'τελειώστε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'τελειωθώ'}, 'sec': {'τελειωθείς'}, 'ter': {'τελειωθεί'}},
                         'pl': {'pri': {'τελειωθούμε'}, 'sec': {'τελειωθείτε'}, 'ter': {'τελειωθούν', 'τελειωθούνε'}}},
                 'imp': {'sg': {'sec': {'τελειώσου'}}, 'pl': {'sec': {'τελειωθείτε'}}}}}, 'aorist': {'active': {'ind': {
                'sg': {'pri': {'τέλειωσα', 'τελείωσα'}, 'sec': {'τέλειωσες', 'τελείωσες'},
                       'ter': {'τελείωσε', 'τέλειωσε'}},
                'pl': {'pri': {'τελειώσαμε'}, 'sec': {'τελειώσατε'}, 'ter': {'τελείωσαν', 'τέλειωσαν', 'τελειώσανε'}}}},
                'passive': {
                    'ind': {'sg': {
                        'pri': {
                            'τελειώθηκα'},
                        'sec': {
                            'τελειώθηκες'},
                        'ter': {
                            'τελειώθηκε'}},
                        'pl': {
                            'pri': {
                                'τελειωθήκαμε'},
                            'sec': {
                                'τελειωθήκατε'},
                            'ter': {
                                'τελειώθηκαν',
                                'τελειωθήκανε'}}}}},
             'paratatikos': {'active': {'ind': {
                 'sg': {'pri': {'τέλειωνα', 'τελείωνα'}, 'sec': {'τέλειωνες', 'τελείωνες'},
                        'ter': {'τελείωνε', 'τέλειωνε'}}, 'pl': {'pri': {'τελειώναμε'}, 'sec': {'τελειώνατε'},
                                                                 'ter': {'τέλειωναν', 'τελειώνανε', 'τελείωναν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'τελειωνόμουνα', 'τελειωνόμουν'},
                                            'sec': {'τελειωνόσουνα', 'τελειωνόσουν'},
                                            'ter': {'τελειωνόταν', 'τελειωνότανε'}},
                                     'pl': {'pri': {'τελειωνόμαστε', 'τελειωνόμασταν'},
                                            'sec': {'τελειωνόσαστε', 'τελειωνόσασταν'},
                                            'ter': {'τελειώνονταν', 'τελειωνόντουσαν'}}}}},
             'act_pres_participle': {'τελειώνοντας'}, 'passive_perfect_participle': {'sg': {
                'masc': {'nom': {'τελειωμένος'}, 'acc': {'τελειωμένο'}, 'voc': {'τελειωμένε'}, 'gen': {'τελειωμένου'}},
                'fem': {'nom': {'τελειωμένη'}, 'acc': {'τελειωμένη'}, 'voc': {'τελειωμένη'}, 'gen': {'τελειωμένης'}},
                'neut': {'nom': {'τελειωμένο'}, 'acc': {'τελειωμένο'}, 'voc': {'τελειωμένο'}, 'gen': {'τελειωμένου'}}},
                'pl': {'masc': {
                    'nom': {'τελειωμένοι'},
                    'acc': {'τελειωμένους'},
                    'voc': {'τελειωμένοι'},
                    'gen': {'τελειωμένων'}},
                    'fem': {
                        'nom': {'τελειωμένες'},
                        'acc': {'τελειωμένες'},
                        'voc': {'τελειωμένες'},
                        'gen': {'τελειωμένων'}},
                    'neut': {
                        'nom': {'τελειωμένα'},
                        'acc': {'τελειωμένα'},
                        'voc': {'τελειωμένα'},
                        'gen': {
                            'τελειωμένων'}}}}}

        )


    def test_verb_leo(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('λέω'),
            {'act_pres_participle': {'λέγοντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'είπαμε'},
                                                  'sec': {'είπατε'},
                                                  'ter': {'είπανε', 'είπαν'}},
                                           'sg': {'pri': {'είπα'},
                                                  'sec': {'είπες'},
                                                  'ter': {'είπε'}}}},
                        'passive': {'ind': {'pl': {'pri': {'ειπωθήκαμε',
                                                           'ελέχθημεν',
                                                           'λεχθήκαμε'},
                                                   'sec': {'ειπωθήκατε',
                                                           'ελέχθητε',
                                                           'λεχθήκατε'},
                                                   'ter': {'ειπωθήκανε',
                                                           'ειπώθηκαν',
                                                           'ελέχθησαν',
                                                           'λέχθηκαν',
                                                           'λεχθήκανε'}},
                                            'sg': {'pri': {'ειπώθηκα',
                                                           'ελέχθην',
                                                           'λέχθηκα'},
                                                   'sec': {'ειπώθηκες',
                                                           'ελέχθης',
                                                           'λέχθηκες'},
                                                   'ter': {'ειπώθηκε',
                                                           'ελέχθη',
                                                           'λέχθηκε'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'λέγουσες'},
                                                         'gen': {'λεγουσών'},
                                                         'nom': {'λέγουσες'},
                                                         'voc': {'λέγουσες'}},
                                                 'masc': {'acc': {'λέγοντες'},
                                                          'gen': {'λεγόντων'},
                                                          'nom': {'λέγοντες'},
                                                          'voc': {'λέγοντες'}},
                                                 'neut': {'acc': {'λέγοντα'},
                                                          'gen': {'λεγόντων'},
                                                          'nom': {'λέγοντα'},
                                                          'voc': {'λέγοντα'}}},
                                          'sg': {'fem': {'acc': {'λέγουσα'},
                                                         'gen': {'λέγουσας'},
                                                         'nom': {'λέγουσα'},
                                                         'voc': {'λέγουσα'}},
                                                 'masc': {'acc': {'λέγοντα'},
                                                          'gen': {'λέγοντος'},
                                                          'nom': {'λέγων'},
                                                          'voc': {'λέγων'}},
                                                 'neut': {'acc': {'λέγον'},
                                                          'gen': {'λέγοντος'},
                                                          'nom': {'λέγον'},
                                                          'voc': {'λέγον'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'πέστε', 'πείτε'}},
                                                'sg': {'sec': {'πες'}}},
                                        'ind': {'pl': {'pri': {'πούμε'},
                                                       'sec': {'πείτε'},
                                                       'ter': {'πουν', 'πούνε'}},
                                                'sg': {'pri': {'πω'},
                                                       'sec': {'πεις'},
                                                       'ter': {'πει'}}}},
                             'passive': {'imp': {'pl': {'sec': {'ειπωθείτε', 'λεχθείτε'}},
                                                 'sg': {'sec': {''}}},
                                         'ind': {'pl': {'pri': {'ειπωθούμε', 'λεχθούμε'},
                                                        'sec': {'ειπωθείτε', 'λεχθείτε'},
                                                        'ter': {'ειπωθούν',
                                                                'ειπωθούνε',
                                                                'λεχθούν',
                                                                'λεχθούνε'}},
                                                 'sg': {'pri': {'λεχθώ', 'ειπωθώ'},
                                                        'sec': {'ειπωθείς', 'λεχθείς'},
                                                        'ter': {'λεχθεί', 'ειπωθεί'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'λέγαμε'},
                                                       'sec': {'λέγατε'},
                                                       'ter': {'λέγανε', 'έλεγαν'}},
                                                'sg': {'pri': {'έλεγα'},
                                                       'sec': {'έλεγες'},
                                                       'ter': {'έλεγε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'λεγόμαστε', 'λεγόμασταν'},
                                                        'sec': {'λεγόσασταν', 'λεγόσαστε'},
                                                        'ter': {'λεγόντουσαν', 'λέγονταν'}},
                                                 'sg': {'pri': {'λεγόμουν', 'λεγόμουνα'},
                                                        'sec': {'λεγόσουνα', 'λεγόσουν'},
                                                        'ter': {'λεγόταν', 'λεγότανε'}}}}},
             'pass_pres_participle': {'pl': {'fem': {'acc': {'λεγόμενες'},
                                                     'gen': {'λεγόμενων'},
                                                     'nom': {'λεγόμενες'},
                                                     'voc': {'λεγόμενες'}},
                                             'masc': {'acc': {'λεγόμενους'},
                                                      'gen': {'λεγόμενων'},
                                                      'nom': {'λεγόμενοι'},
                                                      'voc': {'λεγόμενοι'}},
                                             'neut': {'acc': {'λεγόμενα'},
                                                      'gen': {'λεγόμενων'},
                                                      'nom': {'λεγόμενα'},
                                                      'voc': {'λεγόμενα'}}},
                                      'sg': {'fem': {'acc': {'λεγόμενη'},
                                                     'gen': {'λεγόμενης'},
                                                     'nom': {'λεγόμενη'},
                                                     'voc': {'λεγόμενη'}},
                                             'masc': {'acc': {'λεγόμενο'},
                                                      'gen': {'λεγόμενου'},
                                                      'nom': {'λεγόμενος'},
                                                      'voc': {'λεγόμενε'}},
                                             'neut': {'acc': {'λεγόμενο'},
                                                      'gen': {'λεγόμενου'},
                                                      'nom': {'λεγόμενο'},
                                                      'voc': {'λεγόμενο'}}}},
             'passive_aorist_participle': {'pl': {'fem': {'acc': {'λεχθείσες'},
                                                          'gen': {'λεχθεισών'},
                                                          'nom': {'λεχθείσες'},
                                                          'voc': {'λεχθείσες'}},
                                                  'masc': {'acc': {'λεχθέντες'},
                                                           'gen': {'λεχθέντων'},
                                                           'nom': {'λεχθέντες'},
                                                           'voc': {'λεχθέντες'}},
                                                  'neut': {'acc': {'λεχθέντα'},
                                                           'gen': {'λεχθέντων'},
                                                           'nom': {'λεχθέντα'},
                                                           'voc': {'λεχθέντα'}}},
                                           'sg': {'fem': {'acc': {'λεχθείσα'},
                                                          'gen': {'λεχθείσας'},
                                                          'nom': {'λεχθείσα'},
                                                          'voc': {'λεχθείσα'}},
                                                  'masc': {'acc': {'λεχθέντα'},
                                                           'gen': {'λεχθέντος'},
                                                           'nom': {'λεχθείς'},
                                                           'voc': {'λεχθείς'}},
                                                  'neut': {'acc': {'λεχθέν'},
                                                           'gen': {'λεχθέντος'},
                                                           'nom': {'λεχθέν'},
                                                           'voc': {'λεχθέν'}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'ειπωμένες'},
                                                           'gen': {'ειπωμένων'},
                                                           'nom': {'ειπωμένες'},
                                                           'voc': {'ειπωμένες'}},
                                                   'masc': {'acc': {'ειπωμένους'},
                                                            'gen': {'ειπωμένων'},
                                                            'nom': {'ειπωμένοι'},
                                                            'voc': {'ειπωμένοι'}},
                                                   'neut': {'acc': {'ειπωμένα'},
                                                            'gen': {'ειπωμένων'},
                                                            'nom': {'ειπωμένα'},
                                                            'voc': {'ειπωμένα'}}},
                                            'sg': {'fem': {'acc': {'ειπωμένη'},
                                                           'gen': {'ειπωμένης'},
                                                           'nom': {'ειπωμένη'},
                                                           'voc': {'ειπωμένη'}},
                                                   'masc': {'acc': {'ειπωμένο'},
                                                            'gen': {'ειπωμένου'},
                                                            'nom': {'ειπωμένος'},
                                                            'voc': {'ειπωμένε'}},
                                                   'neut': {'acc': {'ειπωμένο'},
                                                            'gen': {'ειπωμένου'},
                                                            'nom': {'ειπωμένο'},
                                                            'voc': {'ειπωμένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'λέγετε', 'λέτε'}},
                                            'sg': {'sec': {'λέγε'}}},
                                    'ind': {'pl': {'pri': {'λέμε'},
                                                   'sec': {'λέτε'},
                                                   'ter': {'λεν', 'λένε'}},
                                            'sg': {'pri': {'λέω'},
                                                   'sec': {'λες'},
                                                   'ter': {'λέει'}}}},
                         'passive': {'imp': {'pl': {'sec': {'λέγεστε'}},
                                             'sg': {'sec': {'λέγου'}}},
                                     'ind': {'pl': {'pri': {'λεγόμαστε'},
                                                    'sec': {'λεγόσαστε', 'λέγεστε'},
                                                    'ter': {'λέγονται'}},
                                             'sg': {'pri': {'λέγομαι'},
                                                    'sec': {'λέγεσαι'},
                                                    'ter': {'λέγεται'}}}}}},
            # ic(verb.create_all_forms('λέω'))

        )

    def test_verb_synisto(self):
        self.assertDictEqual(
            verb.create_all_forms('συνιστώ')['aorist'],
            {'active': {'ind': {'pl': {'pri': {'συστήσαμε'},
                                       'sec': {'συστήσατε'},
                                       'ter': {'συνέστησαν', 'συστήσανε', 'σύστησαν'}},
                                'sg': {'pri': {'συνέστησα', 'σύστησα'},
                                       'sec': {'σύστησες', 'συνέστησες'},
                                       'ter': {'συνέστησε', 'σύστησε'}}}},
             'passive': {'ind': {'pl': {'pri': {'συσταθήκαμε', 'συνεστάθημεν'},
                                        'sec': {'συνεστάθητε', 'συσταθήκατε'},
                                        'ter': {'συνεστάθησαν',
                                                'συστάθηκαν',
                                                'συσταθήκανε'}},
                                 'sg': {'pri': {'συστάθηκα', 'συνεστάθην'},
                                        'sec': {'συνεστάθης', 'συστάθηκες'},
                                        'ter': {'συστάθηκε', 'συνεστάθη'}}}}}

        )

    def test_verb_katebainw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('κατεβαίνω'),
            {'present':
                 {'active': {'ind':
                                 {'sg': {'pri': {'κατεβαίνω'}, 'sec': {'κατεβαίνεις'}, 'ter': {'κατεβαίνει'}},
                                  'pl': {'pri': {'κατεβαίνουμε', 'κατεβαίνομε'}, 'sec': {'κατεβαίνετε'},
                                         'ter': {'κατεβαίνουνε', 'κατεβαίνουν'}}},
                             'imp': {'sg': {'sec': {'κατέβαινε'}}, 'pl': {'sec': {'κατεβαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {
                 'sg': {'pri': {'κατέβω', 'κατεβώ'}, 'sec': {'κατεβείς', 'κατέβεις'}, 'ter': {'κατέβει', 'κατεβεί'}},
                 'pl': {'pri': {'κατέβουμε', 'κατεβούμε', 'κατέβομε'}, 'sec': {'κατέβετε', 'κατεβείτε'},
                        'ter': {'κατέβουν', 'κατεβούν', 'κατεβούνε', 'κατέβουνε'}}},
                 'imp': {'sg': {'sec': {'κατέβα'}}, 'pl': {'sec': {'κατεβείτε'}}}}},
             'aorist': {'active': {'ind': {
                 'sg': {'pri': {'κατέβηκα', 'κατέβην'}, 'sec': {'κατέβης', 'κατέβηκες'}, 'ter': {'κατέβη', 'κατέβηκε'}},
                 'pl': {'pri': {'κατεβήκαμε', 'κατέβημεν'}, 'sec': {'κατέβητε', 'κατεβήκατε'},
                        'ter': {'κατεβήκανε', 'κατέβηκαν', 'κατέβησαν'}}}}}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'κατέβαινα'}, 'sec': {'κατέβαινες'}, 'ter': {'κατέβαινε'}},
                        'pl': {'pri': {'καταβαίναμε'}, 'sec': {'καταβαίνατε'}, 'ter': {'κατέβαιναν', 'καταβαίνανε'}}}}},
             'act_pres_participle': {'κατεβαίνοντας'}}

        )

    def test_verb_symbainw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συμβαίνω')['aorist'],
            {'active': {'ind': {'pl': {'pri': {'συνέβημεν'},
                                       'sec': {'συνέβητε'},
                                       'ter': {'συνέβησαν'}},
                                'sg': {'pri': {'συνέβην'},
                                       'sec': {'συνέβης'},
                                       'ter': {'συνέβη'}}}}}

        )

    def test_verb_pao(self):
        self.assertDictEqual(
            verb.create_all_forms('πάω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                            'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                    'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                   'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'}, 'ter': {'πήγαν', 'πήγανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                                'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                       'ter': {'πήγαιναν', 'πηγαίνανε'}}}}}}

        )

    def test_verb_paraeimai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παραείμαι'),
            {'act_pres_participle': {'παραόντας'},
             'aorist': {},
             'conjunctive': {},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'παραήμασταν', 'παραήμαστε'},
                                                       'sec': {'παραήσαστε', 'παραήσασταν'},
                                                       'ter': {'παραήσαν',
                                                               'παραήταν',
                                                               'παραήτανε'}},
                                                'sg': {'pri': {'παραήμουνα', 'παραήμουν'},
                                                       'sec': {'παραήσουνα', 'παραήσουν'},
                                                       'ter': {'παραήταν',
                                                               'παραήτανε',
                                                               'παραήτο'}}}}},
             'present': {'active': {'ind': {'pl': {'pri': {'παραείμαστε'},
                                                   'sec': {'παραείσαστε', 'παραείστε'},
                                                   'ter': {'παραείναι'}},
                                            'sg': {'pri': {'παραείμαι'},
                                                   'sec': {'παραείσαι'},
                                                   'ter': {'παραείναι'}}}}}}

        )

    def test_embainw(self):
        self.assertDictEqual(
            verb.create_all_forms('εμβαίνω')['active_aorist_participle'],
            {'pl': {'fem': {'acc': {'εμβάσες'},
                            'gen': {'εμβασών'},
                            'nom': {'εμβάσες'},
                            'voc': {'εμβάσες'}},
                    'masc': {'acc': {'εμβάντες'},
                             'gen': {'εμβάντων'},
                             'nom': {'εμβάντες'},
                             'voc': {'εμβάντες'}},
                    'neut': {'acc': {'εμβάντα'},
                             'gen': {'εμβάντων'},
                             'nom': {'εμβάντα'},
                             'voc': {'εμβάντα'}}},
             'sg': {'fem': {'acc': {'εμβάσα'},
                            'gen': {'εμβάσας'},
                            'nom': {'εμβάσα'},
                            'voc': {'εμβάσα'}},
                    'masc': {'acc': {'εμβάντα'},
                             'gen': {'εμβάντος'},
                             'nom': {'εμβάς'},
                             'voc': {'εμβάς'}},
                    'neut': {'acc': {'εμβάν'},
                             'gen': {'εμβάντος'},
                             'nom': {'εμβάν'},
                             'voc': {'εμβάν'}}}},


        )

    def test_verb_eimai(self):
        self.assertDictEqual(
            verb.create_all_forms('είμαι'),
            {'present': {'active': {'ind': {'sg': {'pri': {'είμαι'}, 'sec': {'είσαι'}, 'ter': {'είναι'}},
                                            'pl': {'pri': {'είμαστε'}, 'sec': {'είστε', 'είσαστε'}, 'ter': {'είναι'}}},
                                    'imp': {'sg': {'ter': {'έστω'}}}}}, 'conjunctive': {}, 'aorist': {},
             'paratatikos': {'active': {
                 'ind': {
                     'sg': {'pri': {'ήμουν', 'ήμουνα'}, 'sec': {'ήσουν', 'ήσουνα'}, 'ter': {'ήταν', 'ήτο', 'ήτανε'}},
                     'pl': {'pri': {'ήμασταν', 'ήμαστε'}, 'sec': {'ήσασταν', 'ήσαστε'},
                            'ter': {'ήταν', 'ήτανε', 'ήσαν'}}}}}, 'act_pres_participle': {'όντας'},
             'arch_act_pres_participle': {
                 'pl': {'neut': {'acc': {'όντα'}, 'nom': {'όντα'}, 'gen': {'όντων'}, 'voc': {'όντα'}},
                        'fem': {'acc': {'ούσες'}, 'nom': {'ούσες'}, 'gen': {'ουσών'}, 'voc': {'ούσες'}},
                        'masc': {'acc': {'όντες'}, 'nom': {'όντες'}, 'gen': {'όντων'}, 'voc': {'όντες'}}},
                 'sg': {'neut': {'acc': {'ον'}, 'nom': {'ον'}, 'gen': {'όντος'}, 'voc': {'ον'}},
                        'fem': {'acc': {'ούσα'}, 'nom': {'ούσα'}, 'gen': {'ούσας'}, 'voc': {'ούσα'}},
                        'masc': {'acc': {'όντα'}, 'nom': {'ων'}, 'gen': {'όντος'}, 'voc': {'ων'}}}}}

        )

    def test_aorist_verb_anago(self):
        self.assertDictEqual(
            verb.create_all_forms('ανάγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'ανήγαγα'}, 'sec': {'ανήγαγες'}, 'ter': {'ανήγαγε'}},
                                'pl': {'pri': {'αναγάγαμε'}, 'sec': {'αναγάγατε'}, 'ter': {'ανήγαγαν', 'αναγάγανε'}}}},
             'passive': {'ind': {
                 'sg': {'pri': {'ανήχθην', 'ανάχθηκα'}, 'sec': {'ανήχθης', 'ανάχθηκες'}, 'ter': {'ανάχθηκε', 'ανήχθη'}},
                 'pl': {'pri': {'ανήχθημεν', 'αναχθήκαμε'}, 'sec': {'αναχθήκατε', 'ανήχθητε'},
                        'ter': {'ανήχθησαν', 'ανάχθηκαν', 'αναχθήκανε'}}}}}

        )

    def test_paratatikos_pwlw(self):
        self.assertDictEqual(
            verb.create_all_forms('πωλώ'),
            {'act_pres_participle': {'πωλώντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'πωλήσαμε'},
                                                  'sec': {'πωλήσατε'},
                                                  'ter': {'πωλήσανε', 'πώλησαν'}},
                                           'sg': {'pri': {'πώλησα'},
                                                  'sec': {'πώλησες'},
                                                  'ter': {'πώλησε'}}}},
                        'passive': {'ind': {'pl': {'pri': {'επωλήθημεν', 'πωληθήκαμε'},
                                                   'sec': {'επωλήθητε', 'πωληθήκατε'},
                                                   'ter': {'επωλήθησαν',
                                                           'πωλήθηκαν',
                                                           'πωληθήκανε'}},
                                            'sg': {'pri': {'επωλήθην', 'πωλήθηκα'},
                                                   'sec': {'επωλήθης', 'πωλήθηκες'},
                                                   'ter': {'επωλήθη', 'πωλήθηκε'}}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'πωλήστε'}},
                                                'sg': {'sec': {'πώλησε'}}},
                                        'ind': {'pl': {'pri': {'πωλήσουμε', 'πωλήσομε'},
                                                       'sec': {'πωλήσετε'},
                                                       'ter': {'πωλήσουν', 'πωλήσουνε'}},
                                                'sg': {'pri': {'πωλήσω'},
                                                       'sec': {'πωλήσεις'},
                                                       'ter': {'πωλήσει'}}}},
                             'passive': {'imp': {'pl': {'sec': {'πωληθείτε'}},
                                                 'sg': {'sec': {'πωλήσου'}}},
                                         'ind': {'pl': {'pri': {'πωληθούμε'},
                                                        'sec': {'πωληθείτε'},
                                                        'ter': {'πωληθούνε', 'πωληθούν'}},
                                                 'sg': {'pri': {'πωληθώ'},
                                                        'sec': {'πωληθείς'},
                                                        'ter': {'πωληθεί'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'πωλούσαμε'},
                                                       'sec': {'πωλούσατε'},
                                                       'ter': {'πωλούσαν', 'πωλούσανε'}},
                                                'sg': {'pri': {'πωλούσα'},
                                                       'sec': {'πωλούσες'},
                                                       'ter': {'πωλούσε'}}}},
                             'passive': {'ind': {'pl': {'pri': {'πωλούμασταν',
                                                                'πωλούμαστε'},
                                                        'sec': {'πωλούσασταν',
                                                                'πωλούσαστε'},
                                                        'ter': {'πωλούντο', 'πωλούνταν'}},
                                                 'sg': {'pri': {'πωλούμουν'},
                                                        'sec': {'πωλούσουν'},
                                                        'ter': {'επωλείτο',
                                                                'πωλείτο',
                                                                'πωλούνταν'}}}}},
             'pass_pres_participle': {'pl': {'fem': {'acc': {'πωλούμενες'},
                                                     'gen': {'πωλούμενων'},
                                                     'nom': {'πωλούμενες'},
                                                     'voc': {'πωλούμενες'}},
                                             'masc': {'acc': {'πωλούμενους'},
                                                      'gen': {'πωλούμενων'},
                                                      'nom': {'πωλούμενοι'},
                                                      'voc': {'πωλούμενοι'}},
                                             'neut': {'acc': {'πωλούμενα'},
                                                      'gen': {'πωλούμενων'},
                                                      'nom': {'πωλούμενα'},
                                                      'voc': {'πωλούμενα'}}},
                                      'sg': {'fem': {'acc': {'πωλούμενη'},
                                                     'gen': {'πωλούμενης'},
                                                     'nom': {'πωλούμενη'},
                                                     'voc': {'πωλούμενη'}},
                                             'masc': {'acc': {'πωλούμενο'},
                                                      'gen': {'πωλούμενου'},
                                                      'nom': {'πωλούμενος'},
                                                      'voc': {'πωλούμενε'}},
                                             'neut': {'acc': {'πωλούμενο'},
                                                      'gen': {'πωλούμενου'},
                                                      'nom': {'πωλούμενο'},
                                                      'voc': {'πωλούμενο'}}}},
             'passive_aorist_participle': {'pl': {'fem': {'acc': {'πωληθείσες'},
                                                          'gen': {'πωληθεισών'},
                                                          'nom': {'πωληθείσες'},
                                                          'voc': {'πωληθείσες'}},
                                                  'masc': {'acc': {'πωληθέντες'},
                                                           'gen': {'πωληθέντων'},
                                                           'nom': {'πωληθέντες'},
                                                           'voc': {'πωληθέντες'}},
                                                  'neut': {'acc': {'πωληθέντα'},
                                                           'gen': {'πωληθέντων'},
                                                           'nom': {'πωληθέντα'},
                                                           'voc': {'πωληθέντα'}}},
                                           'sg': {'fem': {'acc': {'πωληθείσα'},
                                                          'gen': {'πωληθείσας'},
                                                          'nom': {'πωληθείσα'},
                                                          'voc': {'πωληθείσα'}},
                                                  'masc': {'acc': {'πωληθέντα'},
                                                           'gen': {'πωληθέντος'},
                                                           'nom': {'πωληθείς'},
                                                           'voc': {'πωληθείς'}},
                                                  'neut': {'acc': {'πωληθέν'},
                                                           'gen': {'πωληθέντος'},
                                                           'nom': {'πωληθέν'},
                                                           'voc': {'πωληθέν'}}}},
             'passive_perfect_participle': {'pl': {'fem': {'acc': {'πωλημένες'},
                                                           'gen': {'πωλημένων'},
                                                           'nom': {'πωλημένες'},
                                                           'voc': {'πωλημένες'}},
                                                   'masc': {'acc': {'πωλημένους'},
                                                            'gen': {'πωλημένων'},
                                                            'nom': {'πωλημένοι'},
                                                            'voc': {'πωλημένοι'}},
                                                   'neut': {'acc': {'πωλημένα'},
                                                            'gen': {'πωλημένων'},
                                                            'nom': {'πωλημένα'},
                                                            'voc': {'πωλημένα'}}},
                                            'sg': {'fem': {'acc': {'πωλημένη'},
                                                           'gen': {'πωλημένης'},
                                                           'nom': {'πωλημένη'},
                                                           'voc': {'πωλημένη'}},
                                                   'masc': {'acc': {'πωλημένο'},
                                                            'gen': {'πωλημένου'},
                                                            'nom': {'πωλημένος'},
                                                            'voc': {'πωλημένε'}},
                                                   'neut': {'acc': {'πωλημένο'},
                                                            'gen': {'πωλημένου'},
                                                            'nom': {'πωλημένο'},
                                                            'voc': {'πωλημένο'}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'πωλείτε'}},
                                            'sg': {'sec': {'πώλει'}}},
                                    'ind': {'pl': {'pri': {'πωλούμε'},
                                                   'sec': {'πωλείτε'},
                                                   'ter': {'πωλούνε', 'πωλούν'}},
                                            'sg': {'pri': {'πωλώ'},
                                                   'sec': {'πωλείς'},
                                                   'ter': {'πωλεί'}}}},
                         'passive': {'imp': {'pl': {'sec': {'πωλείστε'}}},
                                     'ind': {'pl': {'pri': {'πωλούμαστε'},
                                                    'sec': {'πωλείστε'},
                                                    'ter': {'πωλούνται'}},
                                             'sg': {'pri': {'πωλούμαι'},
                                                    'sec': {'πωλείσαι'},
                                                    'ter': {'πωλείται'}}}}}}

        )

    def test_present_verb_drw(self):
        self.assertDictEqual(
            verb.create_all_forms('δρω')['present'],
            {'active': {'ind': {'sg': {'pri': {'δράω', 'δρω'}, 'sec': {'δρας'},
                                       'ter': {'δράει', 'δρα'}},
                                'pl': {'pri': {'δράμε', 'δρούμε'}, 'sec': {'δράτε'},
                                       'ter': {'δρούνε', 'δράνε', 'δραν', 'δρουν'}}},
                        'imp': {'sg': {'sec': {'δρα'}}, 'pl': {'sec': {'δράτε'}}}}},

        )



    def test_eksartwmai_parat(self):
        self.assertDictEqual(
            verb.create_all_forms('εξαρτώμαι')['paratatikos'],
            {'passive': {'ind': {'pl': {'pri': {'εξαρτιόμαστε', 'εξαρτιόμασταν'},
                                        'sec': {'εξαρτιόσαστε', 'εξαρτιόσασταν'},
                                        'ter': {'εξαρτιούνταν',
                                                'εξαρτιόνταν',
                                                'εξαρτιόντουσαν',
                                                'εξαρτώντο'}},
                                 'sg': {'pri': {'εξαρτιόμουνα', 'εξαρτιόμουν'},
                                        'sec': {'εξαρτιόσουνα', 'εξαρτιόσουν'},
                                        'ter': {'εξαρτιότανε', 'εξαρτάτο', 'εξαρτιόταν'}}}}}

        )

    def test_aorist_verb_eisago(self):
        self.assertDictEqual(
            verb.create_all_forms('εισάγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'εισήγαγα'}, 'sec': {'εισήγαγες'}, 'ter': {'εισήγαγε'}},
                                'pl': {'pri': {'εισαγάγαμε'}, 'sec': {'εισαγάγατε'},
                                       'ter': {'εισήγαγαν', 'εισαγάγανε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'εισάχθηκα', 'εισήχθην'}, 'sec': {'εισάχθηκες', 'εισήχθης'},
                       'ter': {'εισάχθηκε', 'εισήχθη'}},
                'pl': {'pri': {'εισαχθήκαμε', 'εισήχθημεν'}, 'sec': {'εισήχθητε', 'εισαχθήκατε'},
                       'ter': {'εισάχθηκαν', 'εισαχθήκανε', 'εισήχθησαν'}}}}}

        )

    def test_aorist_verb_ago(self):
        self.assertDictEqual(
            verb.create_all_forms('άγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'ήγαγα'}, 'sec': {'ήγαγες'}, 'ter': {'ήγαγε'}},
                                'pl': {'pri': {'αγάγαμε'}, 'sec': {'αγάγατε'}, 'ter': {'ήγαγαν', 'αγάγανε'}}}},
             'passive': {'ind': {'sg': {'pri': {'ήχθην', 'άχθηκα'}, 'sec': {'ήχθης', 'άχθηκες'}, 'ter': {'ήχθη', 'άχθηκε'}},
                                 'pl': {'pri': {'ήχθημεν', 'αχθήκαμε'}, 'sec': {'ήχθητε', 'αχθήκατε'}, 'ter': {'ήχθησαν', 'άχθηκαν', 'αχθήκανε'}}}}}

        )

    def test_verb_antitasso(self):
        self.assertDictEqual(
            verb.create_all_forms('αντιτάσσω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'αντιτάσσω'}, 'sec': {'αντιτάσσεις'}, 'ter': {'αντιτάσσει'}},
                                            'pl': {'pri': {'αντιτάσσουμε', 'αντιτάσσομε'}, 'sec': {'αντιτάσσετε'},
                                                   'ter': {'αντιτάσσουν', 'αντιτάσσουνε'}}},
                                    'imp': {'sg': {'sec': {'αντίτασσε'}}, 'pl': {'sec': {'αντιτάσσετε'}}}},
                         'passive': {
                             'ind': {'sg': {'pri': {'αντιτάσσομαι'}, 'sec': {'αντιτάσσεσαι'}, 'ter': {'αντιτάσσεται'}},
                                     'pl': {'pri': {'αντιτασσόμαστε'}, 'sec': {'αντιτασσόσαστε', 'αντιτάσσεστε'},
                                            'ter': {'αντιτάσσονται'}}},
                             'imp': {'pl': {'sec': {'αντιτάσσεστε'}},
                                     'sg': {'sec': {'αντιτάσσου'}}}}},
             'conjunctive': {
                 'active': {'ind': {'sg': {'pri': {'αντιτάξω'}, 'sec': {'αντιτάξεις'}, 'ter': {'αντιτάξει'}},
                                    'pl': {'pri': {'αντιτάξουμε', 'αντιτάξομε'}, 'sec': {'αντιτάξετε'},
                                           'ter': {'αντιτάξουνε', 'αντιτάξουν'}}},
                            'imp': {'sg': {'sec': {'αντίταξε'}}, 'pl': {'sec': {'αντιτάξτε'}}}},
                 'passive': {'ind': {
                     'sg': {'pri': {'αντιταχθώ', 'αντιταχτώ'}, 'sec': {'αντιταχτείς', 'αντιταχθείς'},
                            'ter': {'αντιταχθεί', 'αντιταχτεί'}},
                     'pl': {'pri': {'αντιταχθούμε', 'αντιταχτούμε'}, 'sec': {'αντιταχτείτε', 'αντιταχθείτε'},
                            'ter': {'αντιταχτούνε', 'αντιταχθούνε', 'αντιταχθούν', 'αντιταχτούν'}}},
                     'imp': {
                         'sg': {'sec': {'αντιτάξου'}}, 'pl': {'sec': {'αντιταχτείτε', 'αντιταχθείτε'}}}}},
             'aorist': {
                 'active': {'ind': {'sg': {'pri': {'αντέταξα'}, 'sec': {'αντέταξες'}, 'ter': {'αντέταξε'}},
                                    'pl': {'pri': {'αντιτάξαμε'}, 'sec': {'αντιτάξατε'},
                                           'ter': {'αντέταξαν', 'αντιτάξανε'}}}},
                 'passive': {'ind': {
                     'sg': {'pri': {'αντιτάχτηκα', 'αντιτάχθηκα'}, 'sec': {'αντιτάχτηκες', 'αντιτάχθηκες'},
                            'ter': {'αντιτάχτηκε', 'αντιτάχθηκε'}},
                     'pl': {'pri': {'αντιταχθήκαμε', 'αντιταχτήκαμε'}, 'sec': {'αντιταχτήκατε', 'αντιταχθήκατε'},
                            'ter': {'αντιταχθήκανε', 'αντιτάχθηκαν', 'αντιτάχτηκαν', 'αντιταχτήκανε'}}}}},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'αντέτασσα'}, 'sec': {'αντέτασσες'}, 'ter': {'αντέτασσε'}},
                         'pl': {'pri': {'αντιτάσσαμε'}, 'sec': {'αντιτάσσατε'}, 'ter': {'αντιτάσσανε', 'αντέτασσαν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'αντιτασσόμουνα', 'αντιτασσόμουν'},
                                            'sec': {'αντιτασσόσουν', 'αντιτασσόσουνα'},
                                            'ter': {'αντιτασσόταν', 'αντιτασσότανε'}},
                                     'pl': {'pri': {'αντιτασσόμαστε', 'αντιτασσόμασταν'},
                                            'sec': {'αντιτασσόσαστε', 'αντιτασσόσασταν'},
                                            'ter': {'αντιτάσσονταν', 'αντιτασσόντουσαν'}}}}},
             'act_pres_participle': {'αντιτάσσοντας'},
             'pass_pres_participle': {'sg': {
                 'fem': {'acc': {'αντιτασσόμενη'}, 'nom': {'αντιτασσόμενη'}, 'gen': {'αντιτασσόμενης'},
                         'voc': {'αντιτασσόμενη'}},
                 'neut': {'acc': {'αντιτασσόμενο'}, 'nom': {'αντιτασσόμενο'}, 'gen': {'αντιτασσόμενου'},
                          'voc': {'αντιτασσόμενο'}},
                 'masc': {'acc': {'αντιτασσόμενο'}, 'nom': {'αντιτασσόμενος'}, 'gen': {'αντιτασσόμενου'},
                          'voc': {'αντιτασσόμενε'}}}, 'pl': {
                 'fem': {'acc': {'αντιτασσόμενες'}, 'nom': {'αντιτασσόμενες'}, 'gen': {'αντιτασσόμενων'},
                         'voc': {'αντιτασσόμενες'}},
                 'neut': {'acc': {'αντιτασσόμενα'}, 'nom': {'αντιτασσόμενα'}, 'gen': {'αντιτασσόμενων'},
                          'voc': {'αντιτασσόμενα'}},
                 'masc': {'acc': {'αντιτασσόμενους'}, 'nom': {'αντιτασσόμενοι'}, 'gen': {'αντιτασσόμενων'},
                          'voc': {'αντιτασσόμενοι'}}}}}

        )
