from unittest import TestCase

# from icecream import ic

from modern_greek_inflexion.exceptions import NotLegalVerbException, NotInGreekException
from modern_greek_inflexion import verb

"""
to do:

przy modalnych błędnie tworzy się liczbę mnogą, niepotrzebnie imieslowy i blednie tryb rozkazujacy

πρόκυψη 
"""


class VerbTestAll(TestCase):

    def test_not_in_greek_exception(self):
        self.assertRaises(NotInGreekException, verb.create_all_forms, 'gamao')

    def test_not_legal_verb_exception(self):
        self.assertRaises(NotLegalVerbException, verb.create_all_forms, 'βλέπουμε')

    def test_verb_modal_pass_fainetai(self):
        self.assertDictEqual(
            verb.create_all_forms('φαίνεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'φαίνεται'}}}}},
             'conjunctive': {'passive': {'ind': {'sg': {'ter': {'φανεί'}}}}},
             'aorist': {'passive': {'ind': {'sg': {'ter': {'φάνηκε'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'φαινόταν'}}}}}}
        )

    def test_verb_modal_brexei(self):
        self.assertDictEqual(
            verb.create_all_forms('βρέχει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'βρέχει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'βρέξει'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'έβρεξε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'έβρεχε'}}}}}}
        )

    def test_verb_antikathistw(self):
        self.assertDictEqual(
            verb.create_all_forms('αντικαθιστώ')['present']['active'],
            {'ind': {'sg': {'pri': {'αντικαθιστώ'}, 'sec': {'αντικαθιστάς'},
                            'ter': {'αντικαθιστά'}},
                     'pl': {'pri': {'αντικαθιστούμε'}, 'sec': {'αντικαθιστάτε'},
                            'ter': {'αντικαθιστούν'}}},
             'imp': {'sg': {'sec': {'αντικαθίστα'}}, 'pl': {'sec': {'αντικαθιστάτε'}}}},

        )

    def test_verb_modal_pass_melletai(self):
        self.assertDictEqual(
            verb.create_all_forms('μέλλεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'μέλλεται'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'μελλόταν'}}}}}}
        )

    def test_verb_poiw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('ποιώ'),
            {'present':
                 {'active':
                      {'ind':
                           {'sg':
                                {'pri':
                                     {'ποιώ'}, 'sec': {'ποιείς'}, 'ter': {'ποιεί'}},
                            'pl':
                                {'pri':
                                     {'ποιούμε'}, 'sec': {'ποιείτε'}, 'ter': {'ποιούν', 'ποιούνε'}}},
                       'imp':
                           {'sg':
                                {'sec': {'ποίει'}},
                            'pl':
                                {'sec': {'ποιείτε'}}}},
                  'passive':
                      {'ind':
                           {'sg':
                                {'pri': {'ποιούμαι'}, 'sec': {'ποιείσαι'}, 'ter': {'ποιείται'}},
                            'pl':
                                {'pri': {'ποιούμαστε', 'ποιούμεθα'}, 'sec': {'ποιείστε', 'ποιείσθε'},
                                 'ter': {'ποιούνται'}}},
                       'imp':
                           {'pl': {'sec': {'ποιείστε'}}}}},
             'conjunctive':
                 {'active':
                      {'ind':
                           {'sg':
                                {'pri': {'ποιήσω'}, 'sec': {'ποιήσεις'}, 'ter': {'ποιήσει'}},
                            'pl':
                                {'pri': {'ποιήσουμε'}, 'sec': {'ποιήσετε'}, 'ter': {'ποιήσουνε', 'ποιήσουν'}}},
                       'imp':
                           {'sg': {'sec': {'ποίησε'}},
                            'pl': {'sec': {'ποιήστε'}}}},
                  'passive':
                      {'ind':
                           {'sg': {'pri': {'ποιηθώ'}, 'sec': {'ποιηθείς'}, 'ter': {'ποιηθεί'}},
                            'pl': {'pri': {'ποιηθούμε'}, 'sec': {'ποιηθείτε'}, 'ter': {'ποιηθούν', 'ποιηθούνε'}}},
                       'imp': {'sg': {'sec': {'ποιήσου'}}, 'pl': {'sec': {'ποιηθείτε'}}}}},
             'aorist':
                 {'active':
                      {'ind':
                           {'sg': {'pri': {'ποίησα'}, 'sec': {'ποίησες'},
                                   'ter': {'ποίησε'}},
                            'pl': {'pri': {'ποιήσαμε'}, 'sec': {'ποιήσατε'},
                                   'ter': {'ποίησαν', 'ποιήσανε'}}}},
                  'passive':
                      {'ind':
                           {'sg': {'pri': {'ποιήθηκα'}, 'sec': {'ποιήθηκες'}, 'ter': {'ποιήθηκε'}},
                            'pl': {'pri': {'ποιηθήκαμε'}, 'sec': {'ποιηθήκατε'}, 'ter': {'ποιηθήκανε', 'ποιήθηκαν'}}}}},
             'paratatikos':
                 {'active':
                      {'ind':
                           {'sg': {'pri': {'ποιούσα'}, 'sec': {'ποιούσες'}, 'ter': {'ποιούσε'}},
                            'pl': {'pri': {'ποιούσαμε'}, 'sec': {'ποιούσατε'}, 'ter': {'ποιούσαν', 'ποιούσανε'}}}},
                  'passive':
                      {'ind':
                           {'sg': {'pri': {'ποιόμουνα', 'ποιόμουν', 'ποιούμουν'},
                                   'sec': {'ποιούσουν', 'ποιόσουνα', 'ποιόσουν'},
                                   'ter': {'ποιούντανε', 'ποιούνταν', 'ποιείτο', 'ποιόταν', 'ποιότανε'}},
                            'pl': {'pri': {'ποιούμαστε', 'ποιόμασταν', 'ποιούμασταν', 'ποιόμαστε'},
                                   'sec': {'ποιούσαστε', 'ποιούσασταν', 'ποιόσασταν', 'ποιόσαστε'},
                                   'ter': {'ποιόντουσαν', 'ποιούντανε', 'ποιούνταν', 'ποιόνταν', 'ποιούντο'}}}}},
             'act_pres_participle': {'ποιώντας'},
             'pass_pres_participle':
                 {'pl':
                      {'masc': {'acc': {'ποιούμενους'}, 'gen': {'ποιούμενων'}, 'voc': {'ποιούμενοι'},
                                'nom': {'ποιούμενοι'}},
                       'fem': {'acc': {'ποιούμενες'}, 'gen': {'ποιούμενων'}, 'voc': {'ποιούμενες'},
                               'nom': {'ποιούμενες'}},
                       'neut': {'acc': {'ποιούμενα'}, 'gen': {'ποιούμενων'}, 'voc': {'ποιούμενα'},
                                'nom': {'ποιούμενα'}}},
                  'sg':
                      {'masc': {'acc': {'ποιούμενο'}, 'gen': {'ποιούμενου'}, 'voc': {'ποιούμενε'},
                                'nom': {'ποιούμενος'}},
                       'fem': {'acc': {'ποιούμενη'}, 'gen': {'ποιούμενης'}, 'voc': {'ποιούμενη'}, 'nom': {'ποιούμενη'}},
                       'neut': {'acc': {'ποιούμενο'}, 'gen': {'ποιούμενου'}, 'voc': {'ποιούμενο'},
                                'nom': {'ποιούμενο'}}}},
             'passive_perfect_participle':
                 {'pl':
                      {'masc': {'acc': {'ποιημένους'}, 'gen': {'ποιημένων'}, 'voc': {'ποιημένοι'},
                                'nom': {'ποιημένοι'}},
                       'fem': {'acc': {'ποιημένες'}, 'gen': {'ποιημένων'}, 'voc': {'ποιημένες'}, 'nom': {'ποιημένες'}},
                       'neut': {'acc': {'ποιημένα'}, 'gen': {'ποιημένων'}, 'voc': {'ποιημένα'}, 'nom': {'ποιημένα'}}},
                  'sg': {'masc': {'acc': {'ποιημένο'}, 'gen': {'ποιημένου'}, 'voc': {'ποιημένε'}, 'nom': {'ποιημένος'}},
                         'fem': {'acc': {'ποιημένη'}, 'gen': {'ποιημένης'}, 'voc': {'ποιημένη'}, 'nom': {'ποιημένη'}},
                         'neut': {'acc': {'ποιημένο'}, 'gen': {'ποιημένου'}, 'voc': {'ποιημένο'},
                                  'nom': {'ποιημένο'}}}}}

        )

    def test_verb_antikeimai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('αντίκειμαι'),
            {'paratatikos': {},
             'pass_pres_participle': {
                 'pl': {'fem': {'acc': {'αντικείμενες'}, 'gen': {'αντικείμενων'}, 'nom': {'αντικείμενες'}, 'voc': {
                     'αντικείμενες'}}, 'masc': {'acc': {'αντικείμενους'}, 'gen': {'αντικείμενων'}, 'nom': {
                     'αντικείμενοι'}, 'voc': {'αντικείμενοι'}}, 'neut': {'acc': {'αντικείμενα'}, 'gen': {
                     'αντικείμενων'}, 'nom': {'αντικείμενα'}, 'voc': {
                     'αντικείμενα'}}}, 'sg': {'fem': {'acc': {'αντικείμενη'}, 'gen': {
                     'αντικείμενης'}, 'nom': {
                     'αντικείμενη'}, 'voc': {
                     'αντικείμενη'}}, 'masc': {'acc': {'αντικείμενο'}, 'gen': {
                     'αντικείμενου'}, 'nom': {
                     'αντικείμενος'}, 'voc': {
                     'αντικείμενε'}}, 'neut': {
                     'acc': {'αντικείμενο'}, 'gen': {
                         'αντικείμενου'}, 'nom': {
                         'αντικείμενο'}, 'voc': {
                         'αντικείμενο'}}}}, 'present':
                 {'passive': {'imp': {'pl': {'sec': {'αντίκεισθε'}}, 'sg': {'sec': {'αντίκεισο'}}},
                              'ind': {'pl': {'pri': {'αντικείμεθα'}, 'sec': {
                                  'αντίκεισθε'}, 'ter': {
                                  'αντίκεινται'}}, 'sg': {
                                  'pri': {'αντίκειμαι'}, 'sec': {
                                      'αντίκεισαι'}, 'ter': {
                                      'αντίκειται'}}}}}}

        )

    def test_verb_erxomai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('έρχομαι'),
            {'present':
                {'passive':
                    {'ind': {
                        'sg':
                            {'pri': {'έρχομαι'}, 'sec': {'έρχεσαι'}, 'ter': {'έρχεται'}},
                        'pl': {'pri': {'ερχόμαστε'}, 'sec': {'έρχεστε', 'ερχόσαστε'},
                               'ter': {'έρχονται'}}},
                        'imp': {'pl': {'sec': {'έρχεστε'}}}}},
                'conjunctive': {
                    'active': {
                        'ind': {
                            'sg': {'pri': {'έρθω', 'έλθω'},
                                   'sec': {'έρθεις', 'έλθεις'},
                                   'ter': {'έλθει', 'έρθει'}},
                            'pl': {'pri': {'έρθουμε', 'έλθουμε'},
                                   'sec': {'έρθετε', 'έλθετε'},
                                   'ter': {'έρθουνε', 'έρθουν', 'έλθουν', 'έλθουνε'}}},
                        'imp': {'sg': {'sec': {'έλα'}},
                                'pl': {'sec': {'έλθετε', 'έρθετε', 'ελάτε'}}}}},
                'aorist': {
                    'active': {
                        'ind': {'sg': {'pri': {'ήρθα', 'ήλθα'}, 'sec': {'ήλθες', 'ήρθες'}, 'ter': {'ήλθε', 'ήρθε'}},
                                'pl': {'pri': {'ήλθαμε', 'ήρθαμε'}, 'sec': {'ήλθατε', 'ήρθατε'},
                                       'ter': {'ήρθανε', 'ήρθαν', 'ήλθαν', 'ήλθανε'}}}}},
                'paratatikos': {
                    'passive': {
                        'ind': {
                            'sg': {'pri': {'ερχόμουνα', 'ερχόμουν'}, 'sec': {'ερχόσουνα', 'ερχόσουν'},
                                   'ter': {'ερχότανε', 'ερχόταν'}},
                            'pl': {'pri': {'ερχόμασταν', 'ερχόμαστε'}, 'sec': {'ερχόσαστε', 'ερχόσασταν'},
                                   'ter': {'ερχόντουσαν', 'έρχονταν'}}}}},
                'pass_pres_participle': {
                    'sg': {
                        'masc': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενε'}, 'nom': {'ερχόμενος'}, 'acc': {'ερχόμενο'}},
                        'fem': {'gen': {'ερχόμενης'}, 'voc': {'ερχόμενη'}, 'nom': {'ερχόμενη'}, 'acc': {'ερχόμενη'}},
                        'neut': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενο'}, 'nom': {'ερχόμενο'}, 'acc': {'ερχόμενο'}}},
                    'pl': {'masc': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενοι'}, 'nom': {'ερχόμενοι'},
                                    'acc': {'ερχόμενους'}},
                           'fem': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενες'}, 'nom': {'ερχόμενες'},
                                   'acc': {'ερχόμενες'}},
                           'neut': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενα'}, 'nom': {'ερχόμενα'},
                                    'acc': {'ερχόμενα'}}}}}
        )

    def test_verb_tragoudo(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('τραγουδώ'),
            {'present':
                {'active':
                    {'ind': {
                        'sg':
                            {'pri':
                                 {'τραγουδώ', 'τραγουδάω'}, 'sec': {'τραγουδάς'}, 'ter': {'τραγουδά', 'τραγουδάει'}},
                        'pl': {'pri': {'τραγουδάμε', 'τραγουδούμε'}, 'sec': {'τραγουδάτε'},
                               'ter': {'τραγουδάν', 'τραγουδούνε', 'τραγουδούν', 'τραγουδάνε'}}},
                        'imp': {'sg': {'sec': {'τραγούδα', 'τραγούδαγε'}}, 'pl': {'sec': {'τραγουδάτε'}}}},
                    'passive': {
                        'ind': {'sg': {'pri': {'τραγουδιέμαι'}, 'sec': {'τραγουδιέσαι'}, 'ter': {'τραγουδιέται'}},
                                'pl': {'pri': {'τραγουδιούμαστε', 'τραγουδιόμαστε'},
                                       'sec': {'τραγουδιόσαστε', 'τραγουδιέστε'},
                                       'ter': {'τραγουδιόνται', 'τραγουδιούνται'}}},
                        'imp': {'pl': {'sec': {'τραγουδιέστε'}}}}},
                'conjunctive': {'active': {
                    'ind': {'sg': {'pri': {'τραγουδήσω'}, 'sec': {'τραγουδήσεις'}, 'ter': {'τραγουδήσει'}},
                            'pl': {'pri': {'τραγουδήσουμε'}, 'sec': {'τραγουδήσετε'},
                                   'ter': {'τραγουδήσουν', 'τραγουδήσουνε'}}},
                    'imp': {'sg': {'sec': {'τραγούδησε'}}, 'pl': {'sec': {'τραγουδήστε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'τραγουδηθώ'}, 'sec': {'τραγουδηθείς'}, 'ter': {'τραγουδηθεί'}},
                            'pl': {'pri': {'τραγουδηθούμε'}, 'sec': {'τραγουδηθείτε'},
                                   'ter': {'τραγουδηθούν', 'τραγουδηθούνε'}}},
                    'imp': {'sg': {'sec': {'τραγουδήσου'}}, 'pl': {'sec': {'τραγουδηθείτε'}}}}},
                'aorist': {'active': {
                    'ind': {'sg': {'pri': {'τραγούδησα'}, 'sec': {'τραγούδησες'}, 'ter': {'τραγούδησε'}},
                            'pl': {'pri': {'τραγουδήσαμε'}, 'sec': {'τραγουδήσατε'},
                                   'ter': {'τραγούδησαν', 'τραγουδήσανε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'τραγουδήθηκα'}, 'sec': {'τραγουδήθηκες'}, 'ter': {'τραγουδήθηκε'}},
                            'pl': {'pri': {'τραγουδηθήκαμε'}, 'sec': {'τραγουδηθήκατε'},
                                   'ter': {'τραγουδηθήκανε', 'τραγουδήθηκαν'}}}}},
                'paratatikos':
                    {'active':
                        {'ind':
                            {
                                'sg': {'pri': {'τραγουδούσα', 'τραγούδαγα'}, 'sec': {'τραγούδαγες', 'τραγουδούσες'},
                                       'ter': {'τραγουδούσε', 'τραγούδαγε'}},
                                'pl': {'pri': {'τραγουδούσαμε', 'τραγουδάγαμε'},
                                       'sec': {'τραγουδάγατε', 'τραγουδούσατε'},
                                       'ter': {'τραγουδούσανε', 'τραγούδαγαν', 'τραγουδούσαν', 'τραγουδάγανε'}}}},
                        'passive': {'ind': {
                            'sg': {'pri': {'τραγουδιόμουν', 'τραγουδιόμουνα'},
                                   'sec': {'τραγουδιόσουνα', 'τραγουδιόσουν'},
                                   'ter': {'τραγουδιότανε', 'τραγουδιόταν'}},
                            'pl': {'pri': {'τραγουδιόμασταν', 'τραγουδιόμαστε'},
                                   'sec': {'τραγουδιόσασταν', 'τραγουδιόσαστε'},
                                   'ter': {'τραγουδιούνταν', 'τραγουδιόνταν', 'τραγουδιόντουσαν'}}}}},
                'act_pres_participle': {'τραγουδώντας'},
                'passive_perfect_participle': {'pl': {
                    'neut': {'gen': {'τραγουδημένων'}, 'acc': {'τραγουδημένα'}, 'voc': {'τραγουδημένα'},
                             'nom': {'τραγουδημένα'}},
                    'fem': {'gen': {'τραγουδημένων'}, 'acc': {'τραγουδημένες'}, 'voc': {'τραγουδημένες'},
                            'nom': {'τραγουδημένες'}},
                    'masc': {'gen': {'τραγουδημένων'}, 'acc': {'τραγουδημένους'}, 'voc': {'τραγουδημένοι'},
                             'nom': {'τραγουδημένοι'}}}, 'sg': {
                    'neut': {'gen': {'τραγουδημένου'}, 'acc': {'τραγουδημένο'}, 'voc': {'τραγουδημένο'},
                             'nom': {'τραγουδημένο'}},
                    'fem': {'gen': {'τραγουδημένης'}, 'acc': {'τραγουδημένη'}, 'voc': {'τραγουδημένη'},
                            'nom': {'τραγουδημένη'}},
                    'masc': {'gen': {'τραγουδημένου'}, 'acc': {'τραγουδημένο'}, 'voc': {'τραγουδημένε'},
                             'nom': {'τραγουδημένος'}}}}}
        )

    def test_verb_kybernw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('κυβερνώ'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'κυβερνώ', 'κυβερνάω'}, 'sec': {'κυβερνάς'}, 'ter': {'κυβερνάει', 'κυβερνά'}},
                        'pl': {'pri': {'κυβερνούμε', 'κυβερνάμε'}, 'sec': {'κυβερνάτε'},
                               'ter': {'κυβερνάν', 'κυβερνούν', 'κυβερνάνε', 'κυβερνούνε'}}},
                'imp': {'sg': {'sec': {'κυβέρναγε', 'κυβέρνα'}}, 'pl': {'sec': {'κυβερνάτε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'κυβερνώμαι', 'κυβερνούμαι', 'κυβερνιέμαι'},
                       'sec': {'κυβερνείσαι', 'κυβερνιέσαι', 'κυβερνάσαι'},
                       'ter': {'κυβερνείται', 'κυβερνάται', 'κυβερνιέται'}},
                'pl': {'pri': {'κυβερνούμεθα', 'κυβερνούμαστε', 'κυβερνόμαστε', 'κυβερνιόμαστε', 'κυβερνιούμαστε'},
                       'sec': {'κυβερνείσθε', 'κυβερνιόσαστε', 'κυβερνάστε', 'κυβερνιέστε', 'κυβερνείστε'},
                       'ter': {'κυβερνώνται', 'κυβερνιούνται', 'κυβερνούνται', 'κυβερνιόνται'}}},
                'imp': {
                    'pl': {'sec': {'κυβερνάστε', 'κυβερνείστε', 'κυβερνιέστε'}}}}},
                'conjunctive': {'active': {
                    'ind': {'sg': {'pri': {'κυβερνήσω'}, 'sec': {'κυβερνήσεις'}, 'ter': {'κυβερνήσει'}},
                            'pl': {'pri': {'κυβερνήσουμε'}, 'sec': {'κυβερνήσετε'},
                                   'ter': {'κυβερνήσουνε', 'κυβερνήσουν'}}},
                    'imp': {'sg': {'sec': {'κυβέρνησε'}}, 'pl': {'sec': {'κυβερνήστε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'κυβερνηθώ'}, 'sec': {'κυβερνηθείς'}, 'ter': {'κυβερνηθεί'}},
                            'pl': {'pri': {'κυβερνηθούμε'}, 'sec': {'κυβερνηθείτε'},
                                   'ter': {'κυβερνηθούνε', 'κυβερνηθούν'}}},
                    'imp': {'sg': {'sec': {'κυβερνήσου'}}, 'pl': {'sec': {'κυβερνηθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'κυβέρνησα'}, 'sec': {'κυβέρνησες'}, 'ter': {'κυβέρνησε'}},
                        'pl': {'pri': {'κυβερνήσαμε'}, 'sec': {'κυβερνήσατε'}, 'ter': {'κυβέρνησαν', 'κυβερνήσανε'}}}},
                'passive': {
                    'ind': {
                        'sg': {
                            'pri': {
                                'κυβερνήθηκα'},
                            'sec': {
                                'κυβερνήθηκες'},
                            'ter': {
                                'κυβερνήθηκε'}},
                        'pl': {
                            'pri': {
                                'κυβερνηθήκαμε'},
                            'sec': {
                                'κυβερνηθήκατε'},
                            'ter': {
                                'κυβερνηθήκανε',
                                'κυβερνήθηκαν'}}}}},
                'paratatikos': {'active': {'ind': {
                    'sg': {'pri': {'κυβερνούσα', 'κυβέρναγα'}, 'sec': {'κυβερνούσες', 'κυβέρναγες'},
                           'ter': {'κυβέρναγε', 'κυβερνούσε'}},
                    'pl': {'pri': {'κυβερνούσαμε', 'κυβερνάγαμε'}, 'sec': {'κυβερνούσατε', 'κυβερνάγατε'},
                           'ter': {'κυβερνούσαν', 'κυβερνάγανε', 'κυβερνούσανε', 'κυβέρναγαν'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'κυβερνιόμουνα', 'κυβερνιόμουν'}, 'sec': {'κυβερνιόσουν', 'κυβερνιόσουνα'},
                           'ter': {'κυβερνιότανε', 'κυβερνιόταν'}},
                    'pl': {'pri': {'κυβερνιόμαστε', 'κυβερνιόμασταν'}, 'sec': {'κυβερνιόσασταν', 'κυβερνιόσαστε'},
                           'ter': {'κυβερνιούνταν', 'κυβερνιόνταν', 'κυβερνιόντουσαν'}}}}},
                'act_pres_participle': {'κυβερνώντας'}, 'arch_act_pres_participle': {
                'sg': {'fem': {'acc': {'κυβερνώσα'}, 'gen': {'κυβερνώσας'}, 'voc': {'κυβερνώσα'}, 'nom': {'κυβερνώσα'}},
                       'neut': {'acc': {'κυβερνών'}, 'gen': {'κυβερνώντος'}, 'voc': {'κυβερνών'}, 'nom': {'κυβερνών'}},
                       'masc': {'acc': {'κυβερνώντα'}, 'gen': {'κυβερνώντος'}, 'voc': {'κυβερνών'},
                                'nom': {'κυβερνών'}}}, 'pl': {
                    'fem': {'acc': {'κυβερνώσες'}, 'gen': {'κυβερνωσών'}, 'voc': {'κυβερνώσες'}, 'nom': {'κυβερνώσες'}},
                    'neut': {'acc': {'κυβερνώντα'}, 'gen': {'κυβερνώντων'}, 'voc': {'κυβερνώντα'},
                             'nom': {'κυβερνώντα'}},
                    'masc': {'acc': {'κυβερνώντες'}, 'gen': {'κυβερνώντων'}, 'voc': {'κυβερνώντες'},
                             'nom': {'κυβερνώντες'}}}}, 'pass_pres_participle': {'sg': {
                'fem': {'acc': {'κυβερνούμενη', 'κυβερνώμενη'}, 'gen': {'κυβερνώμενης', 'κυβερνούμενης'},
                        'voc': {'κυβερνούμενη', 'κυβερνώμενη'}, 'nom': {'κυβερνούμενη', 'κυβερνώμενη'}},
                'neut': {'acc': {'κυβερνούμενο', 'κυβερνώμενο'}, 'gen': {'κυβερνούμενου', 'κυβερνώμενου'},
                         'voc': {'κυβερνούμενο', 'κυβερνώμενο'}, 'nom': {'κυβερνούμενο', 'κυβερνώμενο'}},
                'masc': {'acc': {'κυβερνούμενο', 'κυβερνώμενο'}, 'gen': {'κυβερνούμενου', 'κυβερνώμενου'},
                         'voc': {'κυβερνώμενε', 'κυβερνούμενε'}, 'nom': {'κυβερνούμενος', 'κυβερνώμενος'}}}, 'pl': {
                'fem': {'acc': {'κυβερνώμενες', 'κυβερνούμενες'}, 'gen': {'κυβερνώμενων', 'κυβερνούμενων'},
                        'voc': {'κυβερνώμενες', 'κυβερνούμενες'}, 'nom': {'κυβερνώμενες', 'κυβερνούμενες'}},
                'neut': {'acc': {'κυβερνούμενα', 'κυβερνώμενα'}, 'gen': {'κυβερνώμενων', 'κυβερνούμενων'},
                         'voc': {'κυβερνούμενα', 'κυβερνώμενα'}, 'nom': {'κυβερνούμενα', 'κυβερνώμενα'}},
                'masc': {'acc': {'κυβερνώμενους', 'κυβερνούμενους'}, 'gen': {'κυβερνώμενων', 'κυβερνούμενων'},
                         'voc': {'κυβερνούμενοι', 'κυβερνώμενοι'}, 'nom': {'κυβερνούμενοι', 'κυβερνώμενοι'}}}},
                'passive_perfect_participle': {'sg': {
                    'fem': {'acc': {'κυβερνημένη'}, 'gen': {'κυβερνημένης'}, 'voc': {'κυβερνημένη'},
                            'nom': {'κυβερνημένη'}},
                    'neut': {'acc': {'κυβερνημένο'}, 'gen': {'κυβερνημένου'}, 'voc': {'κυβερνημένο'},
                             'nom': {'κυβερνημένο'}},
                    'masc': {'acc': {'κυβερνημένο'}, 'gen': {'κυβερνημένου'}, 'voc': {'κυβερνημένε'},
                             'nom': {'κυβερνημένος'}}}, 'pl': {
                    'fem': {'acc': {'κυβερνημένες'}, 'gen': {'κυβερνημένων'}, 'voc': {'κυβερνημένες'},
                            'nom': {'κυβερνημένες'}},
                    'neut': {'acc': {'κυβερνημένα'}, 'gen': {'κυβερνημένων'}, 'voc': {'κυβερνημένα'},
                             'nom': {'κυβερνημένα'}},
                    'masc': {'acc': {'κυβερνημένους'}, 'gen': {'κυβερνημένων'}, 'voc': {'κυβερνημένοι'},
                             'nom': {'κυβερνημένοι'}}}}}
        )

    def test_verb_blepo(self):
        self.assertDictEqual(
            verb.create_all_forms('βλέπω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'βλέπω'}, 'sec': {'βλέπεις'}, 'ter': {'βλέπει'}},
                                            'pl': {'pri': {'βλέπουμε'}, 'sec': {'βλέπετε'},
                                                   'ter': {'βλέπουνε', 'βλέπουν'}}},
                                    'imp': {'sg': {'sec': {'βλέπε'}}, 'pl': {'sec': {'βλέπετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'βλέπομαι'}, 'sec': {'βλέπεσαι'}, 'ter': {'βλέπεται'}},
                        'pl': {'pri': {'βλεπόμαστε'}, 'sec': {'βλέπεστε', 'βλεπόσαστε'}, 'ter': {'βλέπονται'}}},
                'imp': {'pl': {'sec': {'βλέπεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'δω'}, 'sec': {'δεις'}, 'ter': {'δει'}},
                        'pl': {'pri': {'δούμε'}, 'sec': {'δείτε'}, 'ter': {'δουν', 'δούνε'}}},
                'imp': {'sg': {'sec': {'δες'}}, 'pl': {'sec': {'δέστε', 'δείτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ιδωθώ'}, 'sec': {'ιδωθείς'}, 'ter': {'ιδωθεί'}},
                        'pl': {'pri': {'ιδωθούμε'}, 'sec': {'ιδωθείτε'}, 'ter': {'ιδωθούνε', 'ιδωθούν'}}},
                'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'ιδωθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'είδα'}, 'sec': {'είδες'}, 'ter': {'είδε'}},
                        'pl': {'pri': {'είδαμε'}, 'sec': {'είδατε'}, 'ter': {'είδανε', 'είδαν'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ειδώθηκα'}, 'sec': {'ειδώθηκες'}, 'ter': {'ειδώθηκε'}},
                        'pl': {'pri': {'ειδωθήκαμε'}, 'sec': {'ειδωθήκατε'}, 'ter': {'ειδωθήκανε', 'ειδώθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έβλεπα'}, 'sec': {'έβλεπες'}, 'ter': {'έβλεπε'}},
                                                'pl': {'pri': {'βλέπαμε'}, 'sec': {'βλέπατε'},
                                                       'ter': {'έβλεπαν', 'βλέπανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'βλεπόμουνα', 'βλεπόμουν'}, 'sec': {'βλεπόσουν', 'βλεπόσουνα'},
                        'ter': {'βλεπόταν', 'βλεπότανε'}},
                 'pl': {'pri': {'βλεπόμαστε', 'βλεπόμασταν'}, 'sec': {'βλεπόσασταν', 'βλεπόσαστε'},
                        'ter': {'βλέπονταν', 'βλεπόντουσαν'}}}}}, 'act_pres_participle': {'βλέποντας'},
             'arch_act_pres_participle': {
                 'sg': {'masc': {'gen': {'βλέποντος'}, 'acc': {'βλέποντα'}, 'voc': {'βλέπων'}, 'nom': {'βλέπων'}},
                        'neut': {'gen': {'βλέποντος'}, 'acc': {'βλέπον'}, 'voc': {'βλέπον'}, 'nom': {'βλέπον'}},
                        'fem': {'gen': {'βλέπουσας'}, 'acc': {'βλέπουσα'}, 'voc': {'βλέπουσα'}, 'nom': {'βλέπουσα'}}},
                 'pl': {
                     'masc': {'gen': {'βλεπόντων'}, 'acc': {'βλέποντες'}, 'voc': {'βλέποντες'}, 'nom': {'βλέποντες'}},
                     'neut': {'gen': {'βλεπόντων'}, 'acc': {'βλέποντα'}, 'voc': {'βλέποντα'}, 'nom': {'βλέποντα'}},
                     'fem': {'gen': {'βλεπουσών'}, 'acc': {'βλέπουσες'}, 'voc': {'βλέπουσες'}, 'nom': {'βλέπουσες'}}}},
             'passive_perfect_participle': {
                 'sg': {'masc': {'gen': {'ιδωμένου'}, 'acc': {'ιδωμένο'}, 'voc': {'ιδωμένε'}, 'nom': {'ιδωμένος'}},
                        'neut': {'gen': {'ιδωμένου'}, 'acc': {'ιδωμένο'}, 'voc': {'ιδωμένο'}, 'nom': {'ιδωμένο'}},
                        'fem': {'gen': {'ιδωμένης'}, 'acc': {'ιδωμένη'}, 'voc': {'ιδωμένη'}, 'nom': {'ιδωμένη'}}},
                 'pl': {'masc': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένους'}, 'voc': {'ιδωμένοι'}, 'nom': {'ιδωμένοι'}},
                        'neut': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένα'}, 'voc': {'ιδωμένα'}, 'nom': {'ιδωμένα'}},
                        'fem': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένες'}, 'voc': {'ιδωμένες'}, 'nom': {'ιδωμένες'}}}}}
        )

    def test_verb_syggrafo(self):
        self.assertDictEqual(
            verb.create_all_forms('συγγράφω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'συγγράφω'}, 'sec': {'συγγράφεις'}, 'ter': {'συγγράφει'}},
                                            'pl': {'pri': {'συγγράφουμε'}, 'sec': {'συγγράφετε'},
                                                   'ter': {'συγγράφουνε', 'συγγράφουν'}}},
                                    'imp': {'sg': {'sec': {'σύγγραφε'}}, 'pl': {'sec': {'συγγράφετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'συγγράφομαι'}, 'sec': {'συγγράφεσαι'}, 'ter': {'συγγράφεται'}},
                        'pl': {'pri': {'συγγραφόμαστε'}, 'sec': {'συγγράφεστε', 'συγγραφόσαστε'},
                               'ter': {'συγγράφονται'}}}, 'imp': {'pl': {'sec': {'συγγράφεστε'}}}}}, 'conjunctive': {
                'active': {'ind': {'sg': {'pri': {'συγγράψω'}, 'sec': {'συγγράψεις'}, 'ter': {'συγγράψει'}},
                                   'pl': {'pri': {'συγγράψουμε'}, 'sec': {'συγγράψετε'},
                                          'ter': {'συγγράψουν', 'συγγράψουνε'}}},
                           'imp': {'sg': {'sec': {'σύγγραψε'}}, 'pl': {'sec': {'συγγράψτε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'συγγραφώ', 'συγγραφτώ'}, 'sec': {'συγγραφτείς', 'συγγραφείς'},
                           'ter': {'συγγραφεί', 'συγγραφτεί'}},
                    'pl': {'pri': {'συγγραφτούμε', 'συγγραφούμε'}, 'sec': {'συγγραφείτε', 'συγγραφτείτε'},
                           'ter': {'συγγραφούνε', 'συγγραφτούνε', 'συγγραφτούν', 'συγγραφούν'}}}, 'imp': {
                    'sg': {'sec': {'συγγράψου'}}, 'pl': {'sec': {'συγγραφείτε', 'συγγραφτείτε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'συνέγραψα'}, 'sec': {'συνέγραψες'}, 'ter': {'συνέγραψε'}},
                                   'pl': {'pri': {'συγγράψαμε'}, 'sec': {'συγγράψατε'},
                                          'ter': {'συνέγραψαν', 'συγγράψανε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'συνεγράφην', 'συγγράφηκα', 'συγγράφτηκα'},
                           'sec': {'συγγράφτηκες', 'συνεγράφης', 'συγγράφηκες'},
                           'ter': {'συγγράφτηκε', 'συγγράφηκε', 'συνεγράφη'}},
                    'pl': {'pri': {'συγγραφτήκαμε', 'συνεγράφημεν', 'συγγραφήκαμε'},
                           'sec': {'συγγραφτήκατε', 'συνεγράφητε', 'συγγραφήκατε'},
                           'ter': {'συγγράφτηκαν', 'συγγράφηκαν', 'συνεγράφησαν', 'συγγραφτήκανε', 'συγγραφήκανε'}}}}},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'συνέγραφα'}, 'sec': {'συνέγραφες'}, 'ter': {'συνέγραφε'}},
                         'pl': {'pri': {'συγγράφαμε'}, 'sec': {'συγγράφατε'}, 'ter': {'συνέγραφαν', 'συγγράφανε'}}}},
                 'passive': {'ind': {'sg': {'pri': {'συγγραφόμουν', 'συγγραφόμουνα'},
                                            'sec': {'συγγραφόσουνα', 'συγγραφόσουν'},
                                            'ter': {'συγγραφότανε', 'συγγραφόταν'}},
                                     'pl': {'pri': {'συγγραφόμαστε', 'συγγραφόμασταν'},
                                            'sec': {'συγγραφόσαστε', 'συγγραφόσασταν'},
                                            'ter': {'συγγράφονταν', 'συγγραφόντουσαν'}}}}},
             'act_pres_participle': {'συγγράφοντας'}, 'active_aorist_participle': {'pl': {
                'fem': {'nom': {'συγγράψασες'}, 'acc': {'συγγράψασες'}, 'voc': {'συγγράψασες'}, 'gen': {'συγγραψασών'}},
                'masc': {'nom': {'συγγράψαντες'}, 'acc': {'συγγράψαντες'}, 'voc': {'συγγράψαντες'},
                         'gen': {'συγγραψάντων'}},
                'neut': {'nom': {'συγγράψαντα'}, 'acc': {'συγγράψαντα'}, 'voc': {'συγγράψαντα'},
                         'gen': {'συγγραψάντων'}}}, 'sg': {
                'fem': {'nom': {'συγγράψασα'}, 'acc': {'συγγράψασα'}, 'voc': {'συγγράψασα'}, 'gen': {'συγγράψασας'}},
                'masc': {'nom': {'συγγράψας'}, 'acc': {'συγγράψαντα'}, 'voc': {'συγγράψας'}, 'gen': {'συγγράψαντος'}},
                'neut': {'nom': {'συγγράψαν'}, 'acc': {'συγγράψαν'}, 'voc': {'συγγράψαν'}, 'gen': {'συγγράψαντος'}}}},
             'pass_pres_participle': {'pl': {
                 'fem': {'nom': {'συγγραφόμενες'}, 'acc': {'συγγραφόμενες'}, 'voc': {'συγγραφόμενες'},
                         'gen': {'συγγραφόμενων'}},
                 'masc': {'nom': {'συγγραφόμενοι'}, 'acc': {'συγγραφόμενους'}, 'voc': {'συγγραφόμενοι'},
                          'gen': {'συγγραφόμενων'}},
                 'neut': {'nom': {'συγγραφόμενα'}, 'acc': {'συγγραφόμενα'}, 'voc': {'συγγραφόμενα'},
                          'gen': {'συγγραφόμενων'}}}, 'sg': {
                 'fem': {'nom': {'συγγραφόμενη'}, 'acc': {'συγγραφόμενη'}, 'voc': {'συγγραφόμενη'},
                         'gen': {'συγγραφόμενης'}},
                 'masc': {'nom': {'συγγραφόμενος'}, 'acc': {'συγγραφόμενο'}, 'voc': {'συγγραφόμενε'},
                          'gen': {'συγγραφόμενου'}},
                 'neut': {'nom': {'συγγραφόμενο'}, 'acc': {'συγγραφόμενο'}, 'voc': {'συγγραφόμενο'},
                          'gen': {'συγγραφόμενου'}}}}, 'passive_perfect_participle': {'pl': {
                'fem': {'nom': {'συγγεγραμμένες'}, 'acc': {'συγγεγραμμένες'}, 'voc': {'συγγεγραμμένες'},
                        'gen': {'συγγεγραμμένων'}},
                'masc': {'nom': {'συγγεγραμμένοι'}, 'acc': {'συγγεγραμμένους'}, 'voc': {'συγγεγραμμένοι'},
                         'gen': {'συγγεγραμμένων'}},
                'neut': {'nom': {'συγγεγραμμένα'}, 'acc': {'συγγεγραμμένα'}, 'voc': {'συγγεγραμμένα'},
                         'gen': {'συγγεγραμμένων'}}}, 'sg': {
                'fem': {'nom': {'συγγεγραμμένη'}, 'acc': {'συγγεγραμμένη'}, 'voc': {'συγγεγραμμένη'},
                        'gen': {'συγγεγραμμένης'}},
                'masc': {'nom': {'συγγεγραμμένος'}, 'acc': {'συγγεγραμμένο'}, 'voc': {'συγγεγραμμένε'},
                         'gen': {'συγγεγραμμένου'}},
                'neut': {'nom': {'συγγεγραμμένο'}, 'acc': {'συγγεγραμμένο'}, 'voc': {'συγγεγραμμένο'},
                         'gen': {'συγγεγραμμένου'}}}}}

        )

    def test_verb_syllambanw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συλλαμβάνω'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'συλλαμβάνω'}, 'sec': {'συλλαμβάνεις'}, 'ter': {'συλλαμβάνει'}},
                        'pl': {'pri': {'συλλαμβάνουμε'}, 'sec': {'συλλαμβάνετε'},
                               'ter': {'συλλαμβάνουν', 'συλλαμβάνουνε'}}},
                'imp': {'sg': {'sec': {'συλλάμβανε'}}, 'pl': {'sec': {'συλλαμβάνετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'συλλαμβάνομαι'}, 'sec': {'συλλαμβάνεσαι'}, 'ter': {'συλλαμβάνεται'}},
                        'pl': {'pri': {'συλλαμβανόμαστε'}, 'sec': {'συλλαμβάνεστε', 'συλλαμβανόσαστε'},
                               'ter': {'συλλαμβάνονται'}}}, 'imp': {'pl': {'sec': {'συλλαμβάνεστε'}}}}},
                'conjunctive': {
                    'active': {'ind': {'sg': {'pri': {'συλλάβω'}, 'sec': {'συλλάβεις'}, 'ter': {'συλλάβει'}},
                                       'pl': {'pri': {'συλλάβουμε'}, 'sec': {'συλλάβετε'},
                                              'ter': {'συλλάβουν', 'συλλάβουνε'}}},
                               'imp': {'sg': {'sec': {'σύλλαβε'}}, 'pl': {'sec': {'συλλάβετε'}}}},
                    'passive': {
                        'ind': {'sg': {'pri': {'συλληφθώ'}, 'sec': {'συλληφθείς'}, 'ter': {'συλληφθεί'}},
                                'pl': {'pri': {'συλληφθούμε'}, 'sec': {'συλληφθείτε'},
                                       'ter': {'συλληφθούν', 'συλληφθούνε'}}},
                        'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'συλληφθείτε'}}}}},
                'aorist': {'active': {
                    'ind': {'sg': {'pri': {'συνέλαβα'}, 'sec': {'συνέλαβες'}, 'ter': {'συνέλαβε'}},
                            'pl': {'pri': {'συλλάβαμε'}, 'sec': {'συλλάβατε'}, 'ter': {'συλλάβανε', 'συνέλαβαν'}}}},
                    'passive': {'ind': {'sg': {
                        'pri': {'συνελήφθην'}, 'sec': {'συνελήφθης'}, 'ter': {'συνελήφθη'}},
                        'pl': {'pri': {'συνελήφθημεν'}, 'sec': {'συνελήφθητε'}, 'ter': {'συνελήφθησαν'}}}}},
                'paratatikos': {'active': {'ind': {
                    'sg': {'pri': {'συνελάμβανα', 'συλλάμβανα'}, 'sec': {'συνελάμβανες', 'συλλάμβανες'},
                           'ter': {'συλλάμβανε', 'συνελάμβανε'}},
                    'pl': {'pri': {'συλλαμβάναμε'}, 'sec': {'συλλαμβάνατε'},
                           'ter': {'συλλαμβάνανε', 'συλλάμβαναν',
                                   'συνελάμβαναν'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'συλλαμβανόμουν', 'συλλαμβανόμουνα'}, 'sec': {'συλλαμβανόσουν', 'συλλαμβανόσουνα'},
                           'ter': {'συλλαμβανόταν', 'συλλαμβανότανε'}},
                    'pl': {'pri': {'συλλαμβανόμασταν', 'συλλαμβανόμαστε'},
                           'sec': {'συλλαμβανόσασταν', 'συλλαμβανόσαστε'},
                           'ter': {'συλλαμβάνονταν', 'συλλαμβανόντουσαν'}}}}},
                'act_pres_participle': {'συλλαμβάνοντας'},
                'passive_aorist_participle': {'sg': {
                    'masc': {'nom': {'συλληφθείς'}, 'gen': {'συλληφθέντος'}, 'voc': {'συλληφθείς'},
                             'acc': {'συλληφθέντα'}},
                    'fem': {'nom': {'συλληφθείσα'}, 'gen': {'συλληφθείσας'}, 'voc': {'συλληφθείσα'},
                            'acc': {'συλληφθείσα'}},
                    'neut': {'nom': {'συλληφθέν'}, 'gen': {'συλληφθέντος'}, 'voc': {'συλληφθέν'},
                             'acc': {'συλληφθέν'}}},
                    'pl': {'masc': {'nom': {'συλληφθέντες'}, 'gen': {'συλληφθέντων'},
                                    'voc': {'συλληφθέντες'}, 'acc': {'συλληφθέντες'}},
                           'fem': {'nom': {'συλληφθείσες'}, 'gen': {'συλληφθεισών'},
                                   'voc': {'συλληφθείσες'}, 'acc': {'συλληφθείσες'}},
                           'neut': {'nom': {'συλληφθέντα'}, 'gen': {'συλληφθέντων'},
                                    'voc': {'συλληφθέντα'}, 'acc': {'συλληφθέντα'}}}},
                'pass_pres_participle': {'sg': {
                    'masc': {'nom': {'συλλαμβανόμενος'}, 'gen': {'συλλαμβανόμενου'}, 'voc': {'συλλαμβανόμενε'},
                             'acc': {'συλλαμβανόμενο'}},
                    'fem': {'nom': {'συλλαμβανόμενη'}, 'gen': {'συλλαμβανόμενης'}, 'voc': {'συλλαμβανόμενη'},
                            'acc': {'συλλαμβανόμενη'}},
                    'neut': {'nom': {'συλλαμβανόμενο'}, 'gen': {'συλλαμβανόμενου'}, 'voc': {'συλλαμβανόμενο'},
                             'acc': {'συλλαμβανόμενο'}}}, 'pl': {
                    'masc': {'nom': {'συλλαμβανόμενοι'}, 'gen': {'συλλαμβανόμενων'}, 'voc': {'συλλαμβανόμενοι'},
                             'acc': {'συλλαμβανόμενους'}},
                    'fem': {'nom': {'συλλαμβανόμενες'}, 'gen': {'συλλαμβανόμενων'}, 'voc': {'συλλαμβανόμενες'},
                            'acc': {'συλλαμβανόμενες'}},
                    'neut': {'nom': {'συλλαμβανόμενα'}, 'gen': {'συλλαμβανόμενων'}, 'voc': {'συλλαμβανόμενα'},
                             'acc': {'συλλαμβανόμενα'}}}}}
        )

    def test_verb_engrafw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('εγγράφω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'εγγράφω'}, 'sec': {'εγγράφεις'}, 'ter': {'εγγράφει'}},
                                            'pl': {'pri': {'εγγράφουμε'}, 'sec': {'εγγράφετε'},
                                                   'ter': {'εγγράφουν', 'εγγράφουνε'}}},
                                    'imp': {'sg': {'sec': {'έγγραφε'}}, 'pl': {'sec': {'εγγράφετε'}}}},
                         'passive': {
                             'ind': {'sg': {'pri': {'εγγράφομαι'}, 'sec': {'εγγράφεσαι'}, 'ter': {'εγγράφεται'}},
                                     'pl': {'pri': {'εγγραφόμαστε'}, 'sec': {'εγγράφεστε', 'εγγραφόσαστε'},
                                            'ter': {'εγγράφονται'}}},
                             'imp': {'pl': {'sec': {'εγγράφεστε'}}}}},
             'conjunctive': {'active': {
                 'ind': {'sg': {'pri': {'εγγράψω'}, 'sec': {'εγγράψεις'}, 'ter': {'εγγράψει'}},
                         'pl': {'pri': {'εγγράψουμε'}, 'sec': {'εγγράψετε'}, 'ter': {'εγγράψουν', 'εγγράψουνε'}}},
                 'imp': {'sg': {'sec': {'έγγραψε'}}, 'pl': {'sec': {'εγγράψτε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'εγγραφτώ', 'εγγραφώ'}, 'sec': {'εγγραφτείς', 'εγγραφείς'},
                        'ter': {'εγγραφεί', 'εγγραφτεί'}},
                 'pl': {'pri': {'εγγραφούμε', 'εγγραφτούμε'}, 'sec': {'εγγραφτείτε', 'εγγραφείτε'},
                        'ter': {'εγγραφούνε', 'εγγραφούν', 'εγγραφτούν', 'εγγραφτούνε'}}}, 'imp': {
                 'sg': {'sec': {'εγγράψου'}}, 'pl': {'sec': {'εγγραφτείτε', 'εγγραφείτε'}}}}},
             'aorist': {'active': {
                 'ind': {'sg': {'pri': {'ενέγραψα'}, 'sec': {'ενέγραψες'}, 'ter': {'ενέγραψε'}},
                         'pl': {'pri': {'εγγράψαμε'}, 'sec': {'εγγράψατε'}, 'ter': {'ενέγραψαν', 'εγγράψανε'}}}},
                 'passive': {
                     'ind': {
                         'sg': {
                             'pri': {
                                 'ενεγράφην',
                                 'εγγράφτηκα',
                                 'εγγράφηκα'},
                             'sec': {
                                 'εγγράφηκες',
                                 'εγγράφτηκες',
                                 'ενεγράφης'},
                             'ter': {
                                 'εγγράφτηκε',
                                 'ενεγράφη',
                                 'εγγράφηκε'}},
                         'pl': {
                             'pri': {
                                 'εγγραφήκαμε',
                                 'ενεγράφημεν',
                                 'εγγραφτήκαμε'},
                             'sec': {
                                 'ενεγράφητε',
                                 'εγγραφήκατε',
                                 'εγγραφτήκατε'},
                             'ter': {
                                 'ενεγράφησαν',
                                 'εγγράφτηκαν',
                                 'εγγράφηκαν',
                                 'εγγραφτήκανε',
                                 'εγγραφήκανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'ενέγραφα', 'έγγραφα'}, 'sec': {'έγγραφες', 'ενέγραφες'},
                                                       'ter': {'έγγραφε', 'ενέγραφε'}},
                                                'pl': {'pri': {'εγγράφαμε'}, 'sec': {'εγγράφατε'},
                                                       'ter': {'εγγράφανε', 'ενέγραφαν', 'έγγραφαν'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'εγγραφόμουνα', 'εγγραφόμουν'}, 'sec': {'εγγραφόσουνα', 'εγγραφόσουν'},
                                'ter': {'εγγραφόταν', 'εγγραφότανε'}},
                         'pl': {'pri': {'εγγραφόμασταν', 'εγγραφόμαστε'}, 'sec': {'εγγραφόσασταν', 'εγγραφόσαστε'},
                                'ter': {'εγγράφονταν', 'εγγραφόντουσαν'}}}}}, 'act_pres_participle': {'εγγράφοντας'},
             'arch_act_pres_participle': {'pl': {
                 'masc': {'gen': {'εγγραφόντων'}, 'nom': {'εγγράφοντες'}, 'acc': {'εγγράφοντες'},
                          'voc': {'εγγράφοντες'}},
                 'neut': {'gen': {'εγγραφόντων'}, 'nom': {'εγγράφοντα'}, 'acc': {'εγγράφοντα'}, 'voc': {'εγγράφοντα'}},
                 'fem': {'gen': {'εγγραφουσών'}, 'nom': {'εγγράφουσες'}, 'acc': {'εγγράφουσες'},
                         'voc': {'εγγράφουσες'}}}, 'sg': {
                 'masc': {'gen': {'εγγράφοντος'}, 'nom': {'εγγράφων'}, 'acc': {'εγγράφοντα'}, 'voc': {'εγγράφων'}},
                 'neut': {'gen': {'εγγράφοντος'}, 'nom': {'εγγράφον'}, 'acc': {'εγγράφον'}, 'voc': {'εγγράφον'}},
                 'fem': {'gen': {'εγγράφουσας'}, 'nom': {'εγγράφουσα'}, 'acc': {'εγγράφουσα'}, 'voc': {'εγγράφουσα'}}}},
             'active_aorist_participle': {'pl': {
                 'masc': {'gen': {'εγγραψάντων'}, 'nom': {'εγγράψαντες'}, 'acc': {'εγγράψαντες'},
                          'voc': {'εγγράψαντες'}},
                 'neut': {'gen': {'εγγραψάντων'}, 'nom': {'εγγράψαντα'}, 'acc': {'εγγράψαντα'}, 'voc': {'εγγράψαντα'}},
                 'fem': {'gen': {'εγγραψασών'}, 'nom': {'εγγράψασες'}, 'acc': {'εγγράψασες'}, 'voc': {'εγγράψασες'}}},
                 'sg': {'masc': {'gen': {'εγγράψαντος'}, 'nom': {'εγγράψας'},
                                 'acc': {'εγγράψαντα'}, 'voc': {'εγγράψας'}},
                        'neut': {'gen': {'εγγράψαντος'}, 'nom': {'εγγράψαν'},
                                 'acc': {'εγγράψαν'}, 'voc': {'εγγράψαν'}},
                        'fem': {'gen': {'εγγράψασας'}, 'nom': {'εγγράψασα'},
                                'acc': {'εγγράψασα'}, 'voc': {'εγγράψασα'}}}},
             'pass_pres_participle': {'pl': {
                 'masc': {'gen': {'εγγραφόμενων'}, 'nom': {'εγγραφόμενοι'}, 'acc': {'εγγραφόμενους'},
                          'voc': {'εγγραφόμενοι'}},
                 'neut': {'gen': {'εγγραφόμενων'}, 'nom': {'εγγραφόμενα'}, 'acc': {'εγγραφόμενα'},
                          'voc': {'εγγραφόμενα'}},
                 'fem': {'gen': {'εγγραφόμενων'}, 'nom': {'εγγραφόμενες'}, 'acc': {'εγγραφόμενες'},
                         'voc': {'εγγραφόμενες'}}}, 'sg': {
                 'masc': {'gen': {'εγγραφόμενου'}, 'nom': {'εγγραφόμενος'}, 'acc': {'εγγραφόμενο'},
                          'voc': {'εγγραφόμενε'}},
                 'neut': {'gen': {'εγγραφόμενου'}, 'nom': {'εγγραφόμενο'}, 'acc': {'εγγραφόμενο'},
                          'voc': {'εγγραφόμενο'}},
                 'fem': {'gen': {'εγγραφόμενης'}, 'nom': {'εγγραφόμενη'}, 'acc': {'εγγραφόμενη'},
                         'voc': {'εγγραφόμενη'}}}}, 'passive_perfect_participle': {'pl': {
                'masc': {'gen': {'εγγεγραμμένων', 'εγγραμμένων'}, 'nom': {'εγγραμμένοι', 'εγγεγραμμένοι'},
                         'acc': {'εγγραμμένους', 'εγγεγραμμένους'}, 'voc': {'εγγραμμένοι', 'εγγεγραμμένοι'}},
                'neut': {'gen': {'εγγεγραμμένων', 'εγγραμμένων'}, 'nom': {'εγγεγραμμένα', 'εγγραμμένα'},
                         'acc': {'εγγεγραμμένα', 'εγγραμμένα'}, 'voc': {'εγγεγραμμένα', 'εγγραμμένα'}},
                'fem': {'gen': {'εγγεγραμμένων', 'εγγραμμένων'}, 'nom': {'εγγεγραμμένες', 'εγγραμμένες'},
                        'acc': {'εγγεγραμμένες', 'εγγραμμένες'}, 'voc': {'εγγεγραμμένες', 'εγγραμμένες'}}}, 'sg': {
                'masc': {'gen': {'εγγεγραμμένου', 'εγγραμμένου'}, 'nom': {'εγγεγραμμένος', 'εγγραμμένος'},
                         'acc': {'εγγραμμένο', 'εγγεγραμμένο'}, 'voc': {'εγγεγραμμένε', 'εγγραμμένε'}},
                'neut': {'gen': {'εγγεγραμμένου', 'εγγραμμένου'}, 'nom': {'εγγραμμένο', 'εγγεγραμμένο'},
                         'acc': {'εγγραμμένο', 'εγγεγραμμένο'}, 'voc': {'εγγραμμένο', 'εγγεγραμμένο'}},
                'fem': {'gen': {'εγγεγραμμένης', 'εγγραμμένης'}, 'nom': {'εγγραμμένη', 'εγγεγραμμένη'},
                        'acc': {'εγγραμμένη', 'εγγεγραμμένη'}, 'voc': {'εγγραμμένη', 'εγγεγραμμένη'}}}}}

        )

    def test_verb_phgainw(self):
        self.assertDictEqual(
            verb.create_all_forms('πηγαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'πηγαίνω'}, 'sec': {'πηγαίνεις'}, 'ter': {'πηγαίνει'}},
                                            'pl': {'pri': {'πηγαίνουμε'}, 'sec': {'πηγαίνετε'},
                                                   'ter': {'πηγαίνουνε', 'πηγαίνουν'}}},
                                    'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                   'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'}, 'ter': {'πήγαν', 'πήγανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                                'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                       'ter': {'πηγαίνανε', 'πήγαιναν'}}}}},
             'act_pres_participle': {'πηγαίνοντας'}}
        )

    def test_verb_prokeitai(self):
        self.assertDictEqual(
            verb.create_all_forms('πρόκειται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'πρόκειται'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'επρόκειτο'}}}}}}
        )

    def test_verb_symbainei(self):
        self.assertDictEqual(
            verb.create_all_forms('συμβαίνει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'συμβαίνει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'συμβεί'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'συνέβη'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'συνέβαινε'}}}}}}
        )

    def test_verb_xairw_imper(self):
        self.assertDictEqual(
            verb.create_all_forms('χαίρω')['conjunctive']['active']['imp'],
            {'sg': {'sec': {'χαίρε'}}, 'pl': {'sec': {'χαίρετε'}}}

        )

    def test_verb_parkaro(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παρκάρω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παρκάρω'}, 'sec': {'παρκάρεις'}, 'ter': {'παρκάρει'}},
                                            'pl': {'pri': {'παρκάρουμε'}, 'sec': {'παρκάρετε'},
                                                   'ter': {'παρκάρουνε', 'παρκάρουν'}}},
                                    'imp': {'sg': {'sec': {'πάρκαρε'}}, 'pl': {'sec': {'παρκάρετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παρκάρομαι'}, 'sec': {'παρκάρεσαι'}, 'ter': {'παρκάρεται'}},
                        'pl': {'pri': {'παρκαρόμαστε'}, 'sec': {'παρκαρόσαστε', 'παρκάρεστε'}, 'ter': {'παρκάρονται'}}},
                'imp': {'pl': {'sec': {'παρκάρεστε'}}}}}, 'conjunctive': {'active': {'ind': {
                'sg': {'pri': {'παρκαρίσω', 'παρκάρω'}, 'sec': {'παρκάρεις', 'παρκαρίσεις'},
                       'ter': {'παρκάρει', 'παρκαρίσει'}},
                'pl': {'pri': {'παρκάρουμε', 'παρκαρίσουμε'}, 'sec': {'παρκαρίσετε', 'παρκάρετε'},
                       'ter': {'παρκαρίσουνε', 'παρκάρουνε', 'παρκάρουν', 'παρκαρίσουν'}}}, 'imp': {
                'sg': {'sec': {'παρκάρισε', 'πάρκαρε'}}, 'pl': {'sec': {'παρκαρίστε', 'παρκάρετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παρκαριστώ'}, 'sec': {'παρκαριστείς'}, 'ter': {'παρκαριστεί'}},
                        'pl': {'pri': {'παρκαριστούμε'}, 'sec': {'παρκαριστείτε'},
                               'ter': {'παρκαριστούν', 'παρκαριστούνε'}}},
                'imp': {'sg': {'sec': {'παρκαρίσου'}}, 'pl': {'sec': {'παρκαριστείτε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'παρκάρισα', 'πάρκαρα'}, 'sec': {'πάρκαρες', 'παρκάρισες'},
                                          'ter': {'παρκάρισε', 'πάρκαρε'}},
                                   'pl': {'pri': {'παρκάραμε', 'παρκαρίσαμε'}, 'sec': {'παρκάρατε', 'παρκαρίσατε'},
                                          'ter': {'παρκάρισαν', 'παρκαρίσανε', 'πάρκαραν', 'παρκάρανε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'παρκαρίστηκα'}, 'sec': {'παρκαρίστηκες'}, 'ter': {'παρκαρίστηκε'}},
                            'pl': {'pri': {'παρκαριστήκαμε'}, 'sec': {'παρκαριστήκατε'},
                                   'ter': {'παρκαριστήκανε', 'παρκαρίστηκαν'}}}}}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'πάρκαρα'}, 'sec': {'πάρκαρες'}, 'ter': {'πάρκαρε'}},
                        'pl': {'pri': {'παρκάραμε'}, 'sec': {'παρκάρατε'}, 'ter': {'πάρκαραν', 'παρκάρανε'}}}},
                'passive': {'ind': {
                    'sg': {'pri': {
                        'παρκαρόμουνα',
                        'παρκαρόμουν'},
                        'sec': {
                            'παρκαρόσουνα',
                            'παρκαρόσουν'},
                        'ter': {
                            'παρκαρόταν',
                            'παρκαρότανε'}},
                    'pl': {'pri': {
                        'παρκαρόμαστε',
                        'παρκαρόμασταν'},
                        'sec': {
                            'παρκαρόσασταν',
                            'παρκαρόσαστε'},
                        'ter': {
                            'παρκαρόντουσαν',
                            'παρκάρονταν'}}}}},
             'act_pres_participle': {'παρκάροντας'}, 'passive_perfect_participle': {'pl': {
                'neut': {'acc': {'παρκαρισμένα'}, 'nom': {'παρκαρισμένα'}, 'gen': {'παρκαρισμένων'},
                         'voc': {'παρκαρισμένα'}},
                'fem': {'acc': {'παρκαρισμένες'}, 'nom': {'παρκαρισμένες'}, 'gen': {'παρκαρισμένων'},
                        'voc': {'παρκαρισμένες'}},
                'masc': {'acc': {'παρκαρισμένους'}, 'nom': {'παρκαρισμένοι'}, 'gen': {'παρκαρισμένων'},
                         'voc': {'παρκαρισμένοι'}}}, 'sg': {
                'neut': {'acc': {'παρκαρισμένο'}, 'nom': {'παρκαρισμένο'}, 'gen': {'παρκαρισμένου'},
                         'voc': {'παρκαρισμένο'}},
                'fem': {'acc': {'παρκαρισμένη'}, 'nom': {'παρκαρισμένη'}, 'gen': {'παρκαρισμένης'},
                        'voc': {'παρκαρισμένη'}},
                'masc': {'acc': {'παρκαρισμένο'}, 'nom': {'παρκαρισμένος'}, 'gen': {'παρκαρισμένου'},
                         'voc': {'παρκαρισμένε'}}}}}

        )

    def test_verb_apexw(self):
        self.assertDictEqual(
            verb.create_all_forms('απέχω'),
            {'act_pres_participle': {'απέχοντας'},
             'aorist': {'active': {'ind': {'pl': {'pri': {'απείχαμε'},
                                                  'sec': {'απείχατε'},
                                                  'ter': {'απείχαν', 'απείχανε'}},
                                           'sg': {'pri': {'απείχα'},
                                                  'sec': {'απείχες'},
                                                  'ter': {'απείχε'}}}}},
             'arch_act_pres_participle': {'pl': {'fem': {'acc': {'απέχουσες'},
                                                         'gen': {'απεχουσών'},
                                                         'nom': {'απέχουσες'},
                                                         'voc': {'απέχουσες'}},
                                                 'masc': {'acc': {'απέχοντες'},
                                                          'gen': {'απεχόντων'},
                                                          'nom': {'απέχοντες'},
                                                          'voc': {'απέχοντες'}},
                                                 'neut': {'acc': {'απέχοντα'},
                                                          'gen': {'απεχόντων'},
                                                          'nom': {'απέχοντα'},
                                                          'voc': {'απέχοντα'}}},
                                          'sg': {'fem': {'acc': {'απέχουσα'},
                                                         'gen': {'απέχουσας'},
                                                         'nom': {'απέχουσα'},
                                                         'voc': {'απέχουσα'}},
                                                 'masc': {'acc': {'απέχοντα'},
                                                          'gen': {'απέχοντος'},
                                                          'nom': {'απέχων'},
                                                          'voc': {'απέχων'}},
                                                 'neut': {'acc': {'απέχον'},
                                                          'gen': {'απέχοντος'},
                                                          'nom': {'απέχον'},
                                                          'voc': {'απέχον'}}}},
             'conjunctive': {'active': {'imp': {'pl': {'sec': {'απέχετε'}},
                                                'sg': {'sec': {'άπεχε'}}},
                                        'ind': {'pl': {'pri': {'απέχουμε'},
                                                       'sec': {'απέχετε'},
                                                       'ter': {'απέχουνε', 'απέχουν'}},
                                                'sg': {'pri': {'απέχω'},
                                                       'sec': {'απέχεις'},
                                                       'ter': {'απέχει'}}}}},
             'paratatikos': {'active': {'ind': {'pl': {'pri': {'απείχαμε'},
                                                       'sec': {'απείχατε'},
                                                       'ter': {'απείχαν', 'απείχανε'}},
                                                'sg': {'pri': {'απείχα'},
                                                       'sec': {'απείχες'},
                                                       'ter': {'απείχε'}}}}},
             'present': {'active': {'imp': {'pl': {'sec': {'απέχετε'}},
                                            'sg': {'sec': {'άπεχε'}}},
                                    'ind': {'pl': {'pri': {'απέχουμε'},
                                                   'sec': {'απέχετε'},
                                                   'ter': {'απέχουνε', 'απέχουν'}},
                                            'sg': {'pri': {'απέχω'},
                                                   'sec': {'απέχεις'},
                                                   'ter': {'απέχει'}}}}}}

        )

    def test_verb_kserw(self):
        self.assertDictEqual(
            verb.create_all_forms('ξέρω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'ξέρω'}, 'sec': {'ξέρεις'}, 'ter': {'ξέρει'}},
                                            'pl': {'pri': {'ξέρουμε'}, 'sec': {'ξέρετε'},
                                                   'ter': {'ξέρουν', 'ξέρουνε'}}},
                                    'imp': {'sg': {'sec': {'ξέρε'}}, 'pl': {'sec': {'ξέρετε'}}}}}, 'conjunctive': {},
             'aorist': {}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'ήξερα'}, 'sec': {'ήξερες'}, 'ter': {'ήξερε'}},
                        'pl': {'pri': {'ξέραμε'}, 'sec': {'ξέρατε'}, 'ter': {'ξέρανε', 'ήξεραν'}}}}},
             'act_pres_participle': {'ξέροντας'}}

        )

    def test_verb_synistwmai(self):
        self.assertDictEqual(
            verb.create_all_forms('συνιστώμαι')['conjunctive']["passive"],
            {'ind': {'sg': {'pri': {'συσταθώ'}, 'sec': {'συσταθείς'}, 'ter': {'συσταθεί'}},
                     'pl': {'pri': {'συσταθούμε'}, 'sec': {'συσταθείτε'}, 'ter': {'συσταθούν', 'συσταθούνε'}}},
             'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'συσταθείτε'}}}}

        )

    def test_verb_pairnw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παίρνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παίρνω'}, 'sec': {'παίρνεις'}, 'ter': {'παίρνει'}},
                                            'pl': {'pri': {'παίρνουμε'}, 'sec': {'παίρνετε'},
                                                   'ter': {'παίρνουνε', 'παίρνουν'}}},
                                    'imp': {'sg': {'sec': {'παίρνε'}}, 'pl': {'sec': {'παίρνετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παίρνομαι'}, 'sec': {'παίρνεσαι'}, 'ter': {'παίρνεται'}},
                        'pl': {'pri': {'παιρνόμαστε'}, 'sec': {'παίρνεστε', 'παιρνόσαστε'}, 'ter': {'παίρνονται'}}},
                'imp': {'pl': {'sec': {'παίρνεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'πάρω'}, 'sec': {'πάρεις'}, 'ter': {'πάρει'}},
                        'pl': {'pri': {'πάρουμε'}, 'sec': {'πάρετε'}, 'ter': {'πάρουνε', 'πάρουν'}}},
                'imp': {'sg': {'sec': {'πάρε'}}, 'pl': {'sec': {'πάρτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παρθώ'}, 'sec': {'παρθείς'}, 'ter': {'παρθεί'}},
                        'pl': {'pri': {'παρθούμε'}, 'sec': {'παρθείτε'}, 'ter': {'παρθούνε', 'παρθούν'}}},
                'imp': {'sg': {'sec': {'πάρσου'}}, 'pl': {'sec': {'παρθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'πήρα'}, 'sec': {'πήρες'}, 'ter': {'πήρε'}},
                        'pl': {'pri': {'πήραμε'}, 'sec': {'πήρατε'}, 'ter': {'πήραν', 'πήρανε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'πάρθηκα'}, 'sec': {'πάρθηκες'}, 'ter': {'πάρθηκε'}},
                        'pl': {'pri': {'παρθήκαμε'}, 'sec': {'παρθήκατε'}, 'ter': {'παρθήκανε', 'πάρθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έπαιρνα'}, 'sec': {'έπαιρνες'}, 'ter': {'έπαιρνε'}},
                                                'pl': {'pri': {'παίρναμε'}, 'sec': {'παίρνατε'},
                                                       'ter': {'έπαιρναν', 'παίρνανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'παιρνόμουνα', 'παιρνόμουν'}, 'sec': {'παιρνόσουνα', 'παιρνόσουν'},
                        'ter': {'παιρνότανε', 'παιρνόταν'}},
                 'pl': {'pri': {'παιρνόμαστε', 'παιρνόμασταν'}, 'sec': {'παιρνόσασταν', 'παιρνόσαστε'},
                        'ter': {'παίρνονταν', 'παιρνόντουσαν'}}}}}, 'act_pres_participle': {'παίρνοντας'},
             'passive_perfect_participle': {
                 'sg': {'fem': {'gen': {'παρμένης'}, 'acc': {'παρμένη'}, 'voc': {'παρμένη'}, 'nom': {'παρμένη'}},
                        'masc': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένε'}, 'nom': {'παρμένος'}},
                        'neut': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένο'}, 'nom': {'παρμένο'}}},
                 'pl': {'fem': {'gen': {'παρμένων'}, 'acc': {'παρμένες'}, 'voc': {'παρμένες'}, 'nom': {'παρμένες'}},
                        'masc': {'gen': {'παρμένων'}, 'acc': {'παρμένους'}, 'voc': {'παρμένοι'}, 'nom': {'παρμένοι'}},
                        'neut': {'gen': {'παρμένων'}, 'acc': {'παρμένα'}, 'voc': {'παρμένα'}, 'nom': {'παρμένα'}}}}},

        )

    def test_verb_fylaw(self):
        self.assertDictEqual(
            verb.create_all_forms('φυλάω'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'φυλώ', 'φυλάω'}, 'sec': {'φυλάς'}, 'ter': {'φυλά', 'φυλάει'}},
                        'pl': {'pri': {'φυλούμε', 'φυλάμε'}, 'sec': {'φυλάτε'},
                               'ter': {'φυλούνε', 'φυλάν', 'φυλούν', 'φυλάνε'}}},
                'imp': {'sg': {'sec': {'φύλα', 'φύλαγε'}}, 'pl': {'sec': {'φυλάτε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'φυλάξω'}, 'sec': {'φυλάξεις'}, 'ter': {'φυλάξει'}},
                        'pl': {'pri': {'φυλάξουμε'}, 'sec': {'φυλάξετε'}, 'ter': {'φυλάξουνε', 'φυλάξουν'}}},
                'imp': {'sg': {'sec': {'φύλαξε'}}, 'pl': {'sec': {'φυλάξτε'}}}}}, 'aorist': {'active': {'ind': {
                'sg': {'pri': {'εφύλαξα', 'φύλαξα'}, 'sec': {'φύλαξες', 'εφύλαξες'}, 'ter': {'εφύλαξε', 'φύλαξε'}},
                'pl': {'pri': {'εφυλάξαμε', 'φυλάξαμε'}, 'sec': {'φυλάξατε', 'εφυλάξατε'},
                       'ter': {'εφύλαξαν', 'φύλαξαν', 'φυλάξανε', 'εφυλάξανε'}}}}}, 'paratatikos': {'active': {'ind': {
                'sg': {'pri': {'φυλούσα', 'φύλαγα'}, 'sec': {'φύλαγες', 'φυλούσες'}, 'ter': {'φύλαγε', 'φυλούσε'}},
                'pl': {'pri': {'φυλάγαμε', 'φυλούσαμε'}, 'sec': {'φυλάγατε', 'φυλούσατε'},
                       'ter': {'φυλούσαν', 'φυλάγανε', 'φύλαγαν', 'φυλούσανε'}}}}}, 'act_pres_participle': {'φυλώντας'},
                'passive_perfect_participle': {'sg': {
                    'fem': {'acc': {'φυλαγμένη'}, 'nom': {'φυλαγμένη'}, 'voc': {'φυλαγμένη'}, 'gen': {'φυλαγμένης'}},
                    'masc': {'acc': {'φυλαγμένο'}, 'nom': {'φυλαγμένος'}, 'voc': {'φυλαγμένε'}, 'gen': {'φυλαγμένου'}},
                    'neut': {'acc': {'φυλαγμένο'}, 'nom': {'φυλαγμένο'}, 'voc': {'φυλαγμένο'}, 'gen': {'φυλαγμένου'}}},
                    'pl': {'fem': {'acc': {'φυλαγμένες'}, 'nom': {'φυλαγμένες'},
                                   'voc': {'φυλαγμένες'}, 'gen': {'φυλαγμένων'}},
                           'masc': {'acc': {'φυλαγμένους'}, 'nom': {'φυλαγμένοι'},
                                    'voc': {'φυλαγμένοι'}, 'gen': {'φυλαγμένων'}},
                           'neut': {'acc': {'φυλαγμένα'}, 'nom': {'φυλαγμένα'},
                                    'voc': {'φυλαγμένα'}, 'gen': {'φυλαγμένων'}}}}}
        )

    def test_verb_spaw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('σπάω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'σπάω'}, 'sec': {'σπας'}, 'ter': {'σπάει'}},
                                            'pl': {'pri': {'σπάμε'}, 'sec': {'σπάτε'}, 'ter': {'σπαν', 'σπάνε'}}},
                                    'imp': {'sg': {'sec': {'σπάγε'}}, 'pl': {'sec': {'σπάγετε', 'σπάτε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'σπάσω'}, 'sec': {'σπάσεις'}, 'ter': {'σπάσει'}},
                                                'pl': {'pri': {'σπάσουμε'}, 'sec': {'σπάσετε'},
                                                       'ter': {'σπάσουνε', 'σπάσουν'}}},
                                        'imp': {'sg': {'sec': {'σπάσε'}}, 'pl': {'sec': {'σπάστε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'σπαστώ', 'σπασθώ'}, 'sec': {'σπασθείς', 'σπαστείς'},
                                'ter': {'σπασθεί', 'σπαστεί'}},
                         'pl': {'pri': {'σπαστούμε', 'σπασθούμε'}, 'sec': {'σπαστείτε', 'σπασθείτε'},
                                'ter': {'σπασθούνε', 'σπαστούνε', 'σπασθούν', 'σπαστούν'}}},
                 'imp': {'sg': {'sec': {'σπάσου'}}, 'pl': {'sec': {'σπαστείτε', 'σπασθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'έσπασα'}, 'sec': {'έσπασες'}, 'ter': {'έσπασε'}},
                        'pl': {'pri': {'σπάσαμε'}, 'sec': {'σπάσατε'}, 'ter': {'έσπασαν', 'σπάσανε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'σπάστηκα', 'σπάσθηκα'}, 'sec': {'σπάσθηκες', 'σπάστηκες'},
                               'ter': {'σπάσθηκε', 'σπάστηκε'}},
                        'pl': {'pri': {'σπασθήκαμε', 'σπαστήκαμε'}, 'sec': {'σπαστήκατε', 'σπασθήκατε'},
                               'ter': {'σπαστήκανε', 'σπασθήκανε', 'σπάστηκαν', 'σπάσθηκαν'}}}}}, 'paratatikos': {
                'active': {'ind': {'sg': {'pri': {'έσπαγα'}, 'sec': {'έσπαγες'}, 'ter': {'έσπαγε'}},
                                   'pl': {'pri': {'σπάγαμε'}, 'sec': {'σπάγατε'}, 'ter': {'σπάγανε', 'έσπαγαν'}}}}},
             'act_pres_participle': {'σπάγοντας'}, 'passive_perfect_participle': {
                'pl': {'fem': {'gen': {'σπασμένων'}, 'nom': {'σπασμένες'}, 'voc': {'σπασμένες'}, 'acc': {'σπασμένες'}},
                       'neut': {'gen': {'σπασμένων'}, 'nom': {'σπασμένα'}, 'voc': {'σπασμένα'}, 'acc': {'σπασμένα'}},
                       'masc': {'gen': {'σπασμένων'}, 'nom': {'σπασμένοι'}, 'voc': {'σπασμένοι'},
                                'acc': {'σπασμένους'}}},
                'sg': {'fem': {'gen': {'σπασμένης'}, 'nom': {'σπασμένη'}, 'voc': {'σπασμένη'}, 'acc': {'σπασμένη'}},
                       'neut': {'gen': {'σπασμένου'}, 'nom': {'σπασμένο'}, 'voc': {'σπασμένο'}, 'acc': {'σπασμένο'}},
                       'masc': {'gen': {'σπασμένου'}, 'nom': {'σπασμένος'}, 'voc': {'σπασμένε'}, 'acc': {'σπασμένο'}}}}}

        )

    def test_verb_plhttw(self):
        self.assertDictEqual(
            verb.create_all_forms('εκπλήττω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'εκπλήττω'}, 'sec': {'εκπλήττεις'}, 'ter': {'εκπλήττει'}},
                                            'pl': {'pri': {'εκπλήττουμε'}, 'sec': {'εκπλήττετε'},
                                                   'ter': {'εκπλήττουν', 'εκπλήττουνε'}}},
                                    'imp': {'sg': {'sec': {'έκπληττε'}}, 'pl': {'sec': {'εκπλήττετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'εκπλήττομαι'}, 'sec': {'εκπλήττεσαι'}, 'ter': {'εκπλήττεται'}},
                        'pl': {'pri': {'εκπληττόμαστε'}, 'sec': {'εκπλήττεστε', 'εκπληττόσαστε'},
                               'ter': {'εκπλήττονται'}}}, 'imp': {'pl': {'sec': {'εκπλήττεστε'}}}}}, 'conjunctive': {
                'active': {'ind': {'sg': {'pri': {'εκπλήξω'}, 'sec': {'εκπλήξεις'}, 'ter': {'εκπλήξει'}},
                                   'pl': {'pri': {'εκπλήξουμε'}, 'sec': {'εκπλήξετε'},
                                          'ter': {'εκπλήξουν', 'εκπλήξουνε'}}},
                           'imp': {'sg': {'sec': {'έκπληξε'}}, 'pl': {'sec': {'εκπλήξτε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'εκπλαγώ'}, 'sec': {'εκπλαγείς'}, 'ter': {'εκπλαγεί'}},
                            'pl': {'pri': {'εκπλαγούμε'}, 'sec': {'εκπλαγείτε'}, 'ter': {'εκπλαγούν', 'εκπλαγούνε'}}},
                    'imp': {'sg': {'sec': {'εκπλήξου'}}, 'pl': {'sec': {'εκπλαγείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'εξέπληξα'}, 'sec': {'εξέπληξες'}, 'ter': {'εξέπληξε'}},
                        'pl': {'pri': {'εκπλήξαμε'}, 'sec': {'εκπλήξατε'}, 'ter': {'εξέπληξαν', 'εκπλήξανε'}}}},
                'passive': {
                    'ind': {
                        'sg': {
                            'pri': {
                                'εξεπλάγην'},
                            'sec': {
                                'εξεπλάγης'},
                            'ter': {
                                'εξεπλάγη'}},
                        'pl': {
                            'pri': {
                                'εξεπλάγημεν'},
                            'sec': {
                                'εξεπλάγητε'},
                            'ter': {
                                'εξεπλάγησαν'}}}}},
             'paratatikos': {'active': {'ind': {
                 'sg': {'pri': {'έκπληττα', 'εξέπληττα'}, 'sec': {'εξέπληττες', 'έκπληττες'},
                        'ter': {'έκπληττε', 'εξέπληττε'}}, 'pl': {'pri': {'εκπλήτταμε'}, 'sec': {'εκπλήττατε'},
                                                                  'ter': {'εκπλήττανε', 'εξέπλητταν', 'έκπλητταν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'εκπληττόμουν', 'εκπληττόμουνα'},
                                            'sec': {'εκπληττόσουν', 'εκπληττόσουνα'},
                                            'ter': {'εκπληττόταν', 'εκπληττότανε'}},
                                     'pl': {'pri': {'εκπληττόμαστε', 'εκπληττόμασταν'},
                                            'sec': {'εκπληττόσασταν', 'εκπληττόσαστε'},
                                            'ter': {'εκπλήττονταν', 'εκπληττόντουσαν'}}}}},
             'act_pres_participle': {'εκπλήττοντας'}, 'passive_aorist_participle': {'sg': {
                'masc': {'nom': {'εκπλαγείς'}, 'gen': {'εκπλαγέντος'}, 'acc': {'εκπλαγέντα'}, 'voc': {'εκπλαγείς'}},
                'fem': {'nom': {'εκπλαγείσα'}, 'gen': {'εκπλαγείσας'}, 'acc': {'εκπλαγείσα'}, 'voc': {'εκπλαγείσα'}},
                'neut': {'nom': {'εκπλαγέν'}, 'gen': {'εκπλαγέντος'}, 'acc': {'εκπλαγέν'}, 'voc': {'εκπλαγέν'}}},
                'pl': {
                    'masc': {'nom': {'εκπλαγέντες'},
                             'gen': {'εκπλαγέντων'},
                             'acc': {'εκπλαγέντες'},
                             'voc': {
                                 'εκπλαγέντες'}},
                    'fem': {'nom': {'εκπλαγείσες'},
                            'gen': {'εκπλαγεισών'},
                            'acc': {'εκπλαγείσες'},
                            'voc': {'εκπλαγείσες'}},
                    'neut': {'nom': {'εκπλαγέντα'},
                             'gen': {'εκπλαγέντων'},
                             'acc': {'εκπλαγέντα'},
                             'voc': {
                                 'εκπλαγέντα'}}}},
             'pass_pres_participle': {'sg': {
                 'masc': {'nom': {'εκπληττόμενος'}, 'gen': {'εκπληττόμενου'}, 'acc': {'εκπληττόμενο'},
                          'voc': {'εκπληττόμενε'}},
                 'fem': {'nom': {'εκπληττόμενη'}, 'gen': {'εκπληττόμενης'}, 'acc': {'εκπληττόμενη'},
                         'voc': {'εκπληττόμενη'}},
                 'neut': {'nom': {'εκπληττόμενο'}, 'gen': {'εκπληττόμενου'}, 'acc': {'εκπληττόμενο'},
                          'voc': {'εκπληττόμενο'}}}, 'pl': {
                 'masc': {'nom': {'εκπληττόμενοι'}, 'gen': {'εκπληττόμενων'}, 'acc': {'εκπληττόμενους'},
                          'voc': {'εκπληττόμενοι'}},
                 'fem': {'nom': {'εκπληττόμενες'}, 'gen': {'εκπληττόμενων'}, 'acc': {'εκπληττόμενες'},
                         'voc': {'εκπληττόμενες'}},
                 'neut': {'nom': {'εκπληττόμενα'}, 'gen': {'εκπληττόμενων'}, 'acc': {'εκπληττόμενα'},
                          'voc': {'εκπληττόμενα'}}}}, 'passive_perfect_participle': {'sg': {
                'masc': {'nom': {'εκπεπληγμένος'}, 'gen': {'εκπεπληγμένου'}, 'acc': {'εκπεπληγμένο'},
                         'voc': {'εκπεπληγμένε'}},
                'fem': {'nom': {'εκπεπληγμένη'}, 'gen': {'εκπεπληγμένης'}, 'acc': {'εκπεπληγμένη'},
                        'voc': {'εκπεπληγμένη'}},
                'neut': {'nom': {'εκπεπληγμένο'}, 'gen': {'εκπεπληγμένου'}, 'acc': {'εκπεπληγμένο'},
                         'voc': {'εκπεπληγμένο'}}}, 'pl': {
                'masc': {'nom': {'εκπεπληγμένοι'}, 'gen': {'εκπεπληγμένων'}, 'acc': {'εκπεπληγμένους'},
                         'voc': {'εκπεπληγμένοι'}},
                'fem': {'nom': {'εκπεπληγμένες'}, 'gen': {'εκπεπληγμένων'}, 'acc': {'εκπεπληγμένες'},
                        'voc': {'εκπεπληγμένες'}},
                'neut': {'nom': {'εκπεπληγμένα'}, 'gen': {'εκπεπληγμένων'}, 'acc': {'εκπεπληγμένα'},
                         'voc': {'εκπεπληγμένα'}}}}}

        )

    def test_verb_paraballo_con(self):
        self.assertDictEqual(
            verb.create_all_forms('παραβάλλω')['conjunctive']['passive'],
            {'ind': {'sg': {'pri': {'παραβληθώ'}, 'sec': {'παραβληθείς'}, 'ter': {'παραβληθεί'}},
                     'pl': {'pri': {'παραβληθούμε'}, 'sec': {'παραβληθείτε'}, 'ter': {'παραβληθούνε', 'παραβληθούν'}}},
             'imp': {'sg': {'sec': {'παραβλήσου'}}, 'pl': {'sec': {'παραβληθείτε'}}}}

        )

    def test_verb_symmetexo_aorist(self):
        self.assertDictEqual(
            verb.create_all_forms('συμμετέχω')['conjunctive'],
            {'active': {'imp': {'pl': {'sec': {'συμμετέχετε', 'συμμετάσχετε'}},
                                'sg': {'sec': {'συμμέτασχε', 'συμμέτεχε'}}},
                        'ind': {'pl': {'pri': {'συμμετέχουμε', 'συμμετάσχουμε'},
                                       'sec': {'συμμετέχετε', 'συμμετάσχετε'},
                                       'ter': {'συμμετάσχουν',
                                               'συμμετάσχουνε',
                                               'συμμετέχουν',
                                               'συμμετέχουνε'}},
                                'sg': {'pri': {'συμμετάσχω', 'συμμετέχω'},
                                       'sec': {'συμμετάσχεις', 'συμμετέχεις'},
                                       'ter': {'συμμετάσχει', 'συμμετέχει'}}}}}

        )

    def test_verb_sympitw_aor(self):
        self.assertDictEqual(
            verb.create_all_forms('συμπίπτω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'συνέπεσα'}, 'sec': {'συνέπεσες'}, 'ter': {'συνέπεσε'}},
                                'pl': {'pri': {'συμπέσαμε'}, 'sec': {'συμπέσατε'}, 'ter': {'συνέπεσαν', 'συμπέσανε'}}}}}

        )

    def test_verb_anameignuw(self):
        self.assertDictEqual(
            verb.create_all_forms('αναμειγνύω'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'αναμειγνύω'}, 'sec': {'αναμειγνύεις'}, 'ter': {'αναμειγνύει'}},
                        'pl': {'pri': {'αναμειγνύουμε'}, 'sec': {'αναμειγνύετε'},
                               'ter': {'αναμειγνύουνε', 'αναμειγνύουν'}}},
                'imp': {'sg': {'sec': {'αναμείγνυε'}}, 'pl': {'sec': {'αναμειγνύετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'αναμειγνύομαι'}, 'sec': {'αναμειγνύεσαι'}, 'ter': {'αναμειγνύεται'}},
                        'pl': {'pri': {'αναμειγνυόμαστε'}, 'sec': {'αναμειγνύεστε', 'αναμειγνυόσαστε'},
                               'ter': {'αναμειγνύονται'}}}, 'imp': {'pl': {'sec': {'αναμειγνύεστε'}}}}},
                'conjunctive': {'active': {
                    'ind': {'sg': {'pri': {'αναμείξω'}, 'sec': {'αναμείξεις'}, 'ter': {'αναμείξει'}},
                            'pl': {'pri': {'αναμείξουμε'}, 'sec': {'αναμείξετε'},
                                   'ter': {'αναμείξουν', 'αναμείξουνε'}}},
                    'imp': {'sg': {'sec': {'ανάμειξε'}}, 'pl': {'sec': {'αναμείξτε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'αναμειχθώ'}, 'sec': {'αναμειχθείς'}, 'ter': {'αναμειχθεί'}},
                            'pl': {'pri': {'αναμειχθούμε'}, 'sec': {'αναμειχθείτε'},
                                   'ter': {'αναμειχθούνε', 'αναμειχθούν'}}},
                    'imp': {'sg': {'sec': {'αναμείξου'}}, 'pl': {'sec': {'αναμειχθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'ανέμειξα', 'ανάμειξα'}, 'sec': {'ανάμειξες', 'ανέμειξες'},
                               'ter': {'ανέμειξε', 'ανάμειξε'}}, 'pl': {'pri': {'αναμείξαμε'}, 'sec': {'αναμείξατε'},
                                                                        'ter': {'ανέμειξαν', 'αναμείξανε',
                                                                                'ανάμειξαν'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'αναμείχθηκα'}, 'sec': {'αναμείχθηκες'}, 'ter': {'αναμείχθηκε'}},
                        'pl': {'pri': {'αναμειχθήκαμε'}, 'sec': {'αναμειχθήκατε'},
                               'ter': {'αναμειχθήκανε', 'αναμείχθηκαν'}}}}}, 'paratatikos': {'active': {'ind': {
                'sg': {'pri': {'αναμείγνυα'}, 'sec': {'αναμείγνυες'},
                       'ter': {'αναμείγνυε'}},
                'pl': {'pri': {'αναμειγνύαμε'}, 'sec': {'αναμειγνύατε'},
                       'ter': {'αναμείγνυαν', 'αναμειγνύανε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'αναμειγνυόμουν', 'αναμειγνυόμουνα'}, 'sec': {'αναμειγνυόσουν', 'αναμειγνυόσουνα'},
                       'ter': {'αναμειγνυότανε', 'αναμειγνυόταν'}},
                'pl': {'pri': {'αναμειγνυόμασταν', 'αναμειγνυόμαστε'}, 'sec': {'αναμειγνυόσασταν', 'αναμειγνυόσαστε'},
                       'ter': {'αναμειγνυόντουσαν', 'αναμείγνυονταν'}}}}}, 'act_pres_participle': {'αναμειγνύοντας'},
                'passive_aorist_participle': {'sg': {
                    'neut': {'acc': {'αναμειχθέν'}, 'voc': {'αναμειχθέν'}, 'gen': {'αναμειχθέντος'},
                             'nom': {'αναμειχθέν'}},
                    'fem': {'acc': {'αναμειχθείσα'}, 'voc': {'αναμειχθείσα'}, 'gen': {'αναμειχθείσας'},
                            'nom': {'αναμειχθείσα'}},
                    'masc': {'acc': {'αναμειχθέντα'}, 'voc': {'αναμειχθείς'}, 'gen': {'αναμειχθέντος'},
                             'nom': {'αναμειχθείς'}}}, 'pl': {
                    'neut': {'acc': {'αναμειχθέντα'}, 'voc': {'αναμειχθέντα'}, 'gen': {'αναμειχθέντων'},
                             'nom': {'αναμειχθέντα'}},
                    'fem': {'acc': {'αναμειχθείσες'}, 'voc': {'αναμειχθείσες'}, 'gen': {'αναμειχθεισών'},
                            'nom': {'αναμειχθείσες'}},
                    'masc': {'acc': {'αναμειχθέντες'}, 'voc': {'αναμειχθέντες'}, 'gen': {'αναμειχθέντων'},
                             'nom': {'αναμειχθέντες'}}}}, 'pass_pres_participle': {'sg': {
                'neut': {'acc': {'αναμειγνυόμενο'}, 'voc': {'αναμειγνυόμενο'}, 'gen': {'αναμειγνυόμενου'},
                         'nom': {'αναμειγνυόμενο'}},
                'fem': {'acc': {'αναμειγνυόμενη'}, 'voc': {'αναμειγνυόμενη'}, 'gen': {'αναμειγνυόμενης'},
                        'nom': {'αναμειγνυόμενη'}},
                'masc': {'acc': {'αναμειγνυόμενο'}, 'voc': {'αναμειγνυόμενε'}, 'gen': {'αναμειγνυόμενου'},
                         'nom': {'αναμειγνυόμενος'}}}, 'pl': {
                'neut': {'acc': {'αναμειγνυόμενα'}, 'voc': {'αναμειγνυόμενα'}, 'gen': {'αναμειγνυόμενων'},
                         'nom': {'αναμειγνυόμενα'}},
                'fem': {'acc': {'αναμειγνυόμενες'}, 'voc': {'αναμειγνυόμενες'}, 'gen': {'αναμειγνυόμενων'},
                        'nom': {'αναμειγνυόμενες'}},
                'masc': {'acc': {'αναμειγνυόμενους'}, 'voc': {'αναμειγνυόμενοι'}, 'gen': {'αναμειγνυόμενων'},
                         'nom': {'αναμειγνυόμενοι'}}}}, 'passive_perfect_participle': {'sg': {
                'neut': {'acc': {'αναμεμειγμένο', 'αναμειγμένο'}, 'voc': {'αναμεμειγμένο', 'αναμειγμένο'},
                         'gen': {'αναμειγμένου', 'αναμεμειγμένου'}, 'nom': {'αναμεμειγμένο', 'αναμειγμένο'}},
                'fem': {'acc': {'αναμεμειγμένη', 'αναμειγμένη'}, 'voc': {'αναμεμειγμένη', 'αναμειγμένη'},
                        'gen': {'αναμεμειγμένης', 'αναμειγμένης'}, 'nom': {'αναμεμειγμένη', 'αναμειγμένη'}},
                'masc': {'acc': {'αναμεμειγμένο', 'αναμειγμένο'}, 'voc': {'αναμεμειγμένε', 'αναμειγμένε'},
                         'gen': {'αναμειγμένου', 'αναμεμειγμένου'}, 'nom': {'αναμειγμένος', 'αναμεμειγμένος'}}}, 'pl': {
                'neut': {'acc': {'αναμειγμένα', 'αναμεμειγμένα'}, 'voc': {'αναμειγμένα', 'αναμεμειγμένα'},
                         'gen': {'αναμειγμένων', 'αναμεμειγμένων'}, 'nom': {'αναμειγμένα', 'αναμεμειγμένα'}},
                'fem': {'acc': {'αναμεμειγμένες', 'αναμειγμένες'}, 'voc': {'αναμεμειγμένες', 'αναμειγμένες'},
                        'gen': {'αναμειγμένων', 'αναμεμειγμένων'}, 'nom': {'αναμεμειγμένες', 'αναμειγμένες'}},
                'masc': {'acc': {'αναμεμειγμένους', 'αναμειγμένους'}, 'voc': {'αναμειγμένοι', 'αναμεμειγμένοι'},
                         'gen': {'αναμειγμένων', 'αναμεμειγμένων'}, 'nom': {'αναμειγμένοι', 'αναμεμειγμένοι'}}}}}

        )

    def test_verb_antilambanomai_imp(self):
        self.assertDictEqual(
            verb.create_all_forms('αντιλαμβάνομαι')['conjunctive']['passive']['imp'],
            {'sg': {'sec': {'αντιλήψου'}}, 'pl': {'sec': {'αντιληφθείτε'}}}

        )

    def test_verb_teleiwnw(self):
        self.assertDictEqual(

            verb.create_all_forms('τελειώνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'τελειώνω'}, 'sec': {'τελειώνεις'}, 'ter': {'τελειώνει'}},
                                            'pl': {'pri': {'τελειώνουμε'}, 'sec': {'τελειώνετε'},
                                                   'ter': {'τελειώνουνε', 'τελειώνουν'}}},
                                    'imp': {'sg': {'sec': {'τελείωνε', 'τέλειωνε'}}, 'pl': {'sec': {'τελειώνετε'}}}},
                         'passive': {
                             'ind': {'sg': {'pri': {'τελειώνομαι'}, 'sec': {'τελειώνεσαι'}, 'ter': {'τελειώνεται'}},
                                     'pl': {'pri': {'τελειωνόμαστε'}, 'sec': {'τελειωνόσαστε', 'τελειώνεστε'},
                                            'ter': {'τελειώνονται'}}}, 'imp': {'pl': {'sec': {'τελειώνεστε'}}}}},
             'conjunctive': {'active': {
                 'ind': {'sg': {'pri': {'τελειώσω'}, 'sec': {'τελειώσεις'}, 'ter': {'τελειώσει'}},
                         'pl': {'pri': {'τελειώσουμε'}, 'sec': {'τελειώσετε'}, 'ter': {'τελειώσουν', 'τελειώσουνε'}}},
                 'imp': {'sg': {'sec': {'τελείωσε', 'τέλειωσε'}}, 'pl': {'sec': {'τελειώστε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'τελειωθώ'}, 'sec': {'τελειωθείς'}, 'ter': {'τελειωθεί'}},
                         'pl': {'pri': {'τελειωθούμε'}, 'sec': {'τελειωθείτε'}, 'ter': {'τελειωθούν', 'τελειωθούνε'}}},
                 'imp': {'sg': {'sec': {'τελειώσου'}}, 'pl': {'sec': {'τελειωθείτε'}}}}}, 'aorist': {'active': {'ind': {
                'sg': {'pri': {'τέλειωσα', 'τελείωσα'}, 'sec': {'τέλειωσες', 'τελείωσες'},
                       'ter': {'τελείωσε', 'τέλειωσε'}},
                'pl': {'pri': {'τελειώσαμε'}, 'sec': {'τελειώσατε'}, 'ter': {'τελείωσαν', 'τέλειωσαν', 'τελειώσανε'}}}},
                'passive': {
                    'ind': {'sg': {
                        'pri': {
                            'τελειώθηκα'},
                        'sec': {
                            'τελειώθηκες'},
                        'ter': {
                            'τελειώθηκε'}},
                        'pl': {
                            'pri': {
                                'τελειωθήκαμε'},
                            'sec': {
                                'τελειωθήκατε'},
                            'ter': {
                                'τελειώθηκαν',
                                'τελειωθήκανε'}}}}},
             'paratatikos': {'active': {'ind': {
                 'sg': {'pri': {'τέλειωνα', 'τελείωνα'}, 'sec': {'τέλειωνες', 'τελείωνες'},
                        'ter': {'τελείωνε', 'τέλειωνε'}}, 'pl': {'pri': {'τελειώναμε'}, 'sec': {'τελειώνατε'},
                                                                 'ter': {'τέλειωναν', 'τελειώνανε', 'τελείωναν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'τελειωνόμουνα', 'τελειωνόμουν'},
                                            'sec': {'τελειωνόσουνα', 'τελειωνόσουν'},
                                            'ter': {'τελειωνόταν', 'τελειωνότανε'}},
                                     'pl': {'pri': {'τελειωνόμαστε', 'τελειωνόμασταν'},
                                            'sec': {'τελειωνόσαστε', 'τελειωνόσασταν'},
                                            'ter': {'τελειώνονταν', 'τελειωνόντουσαν'}}}}},
             'act_pres_participle': {'τελειώνοντας'}, 'passive_perfect_participle': {'sg': {
                'masc': {'nom': {'τελειωμένος'}, 'acc': {'τελειωμένο'}, 'voc': {'τελειωμένε'}, 'gen': {'τελειωμένου'}},
                'fem': {'nom': {'τελειωμένη'}, 'acc': {'τελειωμένη'}, 'voc': {'τελειωμένη'}, 'gen': {'τελειωμένης'}},
                'neut': {'nom': {'τελειωμένο'}, 'acc': {'τελειωμένο'}, 'voc': {'τελειωμένο'}, 'gen': {'τελειωμένου'}}},
                'pl': {'masc': {
                    'nom': {'τελειωμένοι'},
                    'acc': {'τελειωμένους'},
                    'voc': {'τελειωμένοι'},
                    'gen': {'τελειωμένων'}},
                    'fem': {
                        'nom': {'τελειωμένες'},
                        'acc': {'τελειωμένες'},
                        'voc': {'τελειωμένες'},
                        'gen': {'τελειωμένων'}},
                    'neut': {
                        'nom': {'τελειωμένα'},
                        'acc': {'τελειωμένα'},
                        'voc': {'τελειωμένα'},
                        'gen': {
                            'τελειωμένων'}}}}}

        )

    def test_verb_plhrw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('πληρώ'),
            {'act_pres_participle': {'πληρώντας'},
             'present': {'active': {'ind': {'sg': {'pri': {'πληρώ'}, 'sec': {'πληροίς'}, 'ter': {'πληροί'}},
                                            'pl': {'pri': {'πληρούμε', 'πληρούμεν'}, 'sec': {'πληρούτε'},
                                                   'ter': {'πληρούν', 'πληρούνε'}}},
                                    'imp': {'pl': {'sec': {'πληρούτε'}}}}, 'passive': {
                 'ind': {'sg': {'pri': {'πληρούμαι'}, 'sec': {'πληρούσαι'}, 'ter': {'πληρούται'}},
                         'pl': {'pri': {'πληρούμεθα'}, 'sec': {'πληρούσθε'}, 'ter': {'πληρούνται'}}},
                 'imp': {'pl': {'sec': {'πληρούσθε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'πληρώσω'}, 'sec': {'πληρώσεις'}, 'ter': {'πληρώσει'}},
                        'pl': {'pri': {'πληρώσουμε'}, 'sec': {'πληρώσετε'}, 'ter': {'πληρώσουνε', 'πληρώσουν'}}},
                'imp': {'sg': {'sec': {'πλήρωσε'}}, 'pl': {'sec': {'πληρώστε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'πληρωθώ'}, 'sec': {'πληρωθείς'}, 'ter': {'πληρωθεί'}},
                        'pl': {'pri': {'πληρωθούμε'}, 'sec': {'πληρωθείτε'}, 'ter': {'πληρωθούν', 'πληρωθούνε'}}},
                'imp': {'sg': {'sec': {'πληρώσου'}}, 'pl': {'sec': {'πληρωθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'πλήρωσα'}, 'sec': {'πλήρωσες'}, 'ter': {'πλήρωσε'}},
                        'pl': {'pri': {'πληρώσαμε'}, 'sec': {'πληρώσατε'}, 'ter': {'πλήρωσαν', 'πληρώσανε'}}}},
                'passive': {'ind': {
                    'sg': {'pri': {
                        'πληρώθηκα'},
                        'sec': {
                            'πληρώθηκες'},
                        'ter': {
                            'πληρώθηκε'}},
                    'pl': {'pri': {
                        'πληρωθήκαμε'},
                        'sec': {
                            'πληρωθήκατε'},
                        'ter': {
                            'πληρωθήκανε',
                            'πληρώθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πληρούσα'}, 'sec': {'πληρούσες'}, 'ter': {'πληρούσε'}},
                                                'pl': {'pri': {'πληρούσαμε'}, 'sec': {'πληρούσατε'},
                                                       'ter': {'πληρούσανε', 'πληρούσαν'}}}}},
             'passive_aorist_participle': {'pl': {
                 'masc': {'acc': {'πληρωθέντες'}, 'gen': {'πληρωθέντων'}, 'voc': {'πληρωθέντες'},
                          'nom': {'πληρωθέντες'}},
                 'neut': {'acc': {'πληρωθέντα'}, 'gen': {'πληρωθέντων'}, 'voc': {'πληρωθέντα'}, 'nom': {'πληρωθέντα'}},
                 'fem': {'acc': {'πληρωθείσες'}, 'gen': {'πληρωθεισών'}, 'voc': {'πληρωθείσες'},
                         'nom': {'πληρωθείσες'}}}, 'sg': {
                 'masc': {'acc': {'πληρωθέντα'}, 'gen': {'πληρωθέντος'}, 'voc': {'πληρωθείς'}, 'nom': {'πληρωθείς'}},
                 'neut': {'acc': {'πληρωθέν'}, 'gen': {'πληρωθέντος'}, 'voc': {'πληρωθέν'}, 'nom': {'πληρωθέν'}},
                 'fem': {'acc': {'πληρωθείσα'}, 'gen': {'πληρωθείσας'}, 'voc': {'πληρωθείσα'}, 'nom': {'πληρωθείσα'}}}},
             'passive_perfect_participle': {'pl': {
                 'masc': {'acc': {'πληρωμένους'}, 'gen': {'πληρωμένων'}, 'voc': {'πληρωμένοι'}, 'nom': {'πληρωμένοι'}},
                 'neut': {'acc': {'πληρωμένα'}, 'gen': {'πληρωμένων'}, 'voc': {'πληρωμένα'}, 'nom': {'πληρωμένα'}},
                 'fem': {'acc': {'πληρωμένες'}, 'gen': {'πληρωμένων'}, 'voc': {'πληρωμένες'}, 'nom': {'πληρωμένες'}}},
                 'sg': {'masc': {'acc': {'πληρωμένο'}, 'gen': {'πληρωμένου'},
                                 'voc': {'πληρωμένε'}, 'nom': {'πληρωμένος'}},
                        'neut': {'acc': {'πληρωμένο'}, 'gen': {'πληρωμένου'},
                                 'voc': {'πληρωμένο'}, 'nom': {'πληρωμένο'}},
                        'fem': {'acc': {'πληρωμένη'}, 'gen': {'πληρωμένης'},
                                'voc': {'πληρωμένη'}, 'nom': {'πληρωμένη'}}}}}

        )

    def test_verb_epitithemai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('επιτίθεμαι'),
            {'present': {'passive': {
                'ind': {'sg': {'pri': {'επιτίθεμαι'}, 'sec': {'επιτίθεσαι'}, 'ter': {'επιτίθεται'}},
                        'pl': {'pri': {'επιτιθέμεθα'}, 'sec': {'επιτίθεσθε'}, 'ter': {'επιτίθενται'}}},
                'imp': {'sg': {'sec': {'επιτίθεσο'}}, 'pl': {'sec': {'επιτίθεσθε'}}}}}, 'conjunctive': {'passive': {
                'ind': {'sg': {'pri': {'επιτεθώ'}, 'sec': {'επιτεθείς'}, 'ter': {'επιτεθεί'}},
                        'pl': {'pri': {'επιτεθούμε'}, 'sec': {'επιτεθείτε'}, 'ter': {'επιτεθούν', 'επιτεθούνε'}}},
                'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'επιτεθείτε'}}}}}, 'aorist': {'passive': {'ind': {
                'sg': {'pri': {'επετέθην', 'επιτέθηκα'}, 'sec': {'επιτέθηκες', 'επετέθης'},
                       'ter': {'επιτέθηκε', 'επετέθη'}},
                'pl': {'pri': {'επιτεθήκαμε', 'επετέθημεν'}, 'sec': {'επετέθητε', 'επιτεθήκατε'},
                       'ter': {'επετέθησαν', 'επιτεθήκανε', 'επιτέθηκαν'}}}}}, 'paratatikos': {'passive': {'ind': {
                'sg': {'pri': {'επιτιθέμην', 'επιτιθόμουν'}, 'sec': {'επιτιθόσουν', 'επιτίθεσο'},
                       'ter': {'επιτίθετο', 'επιτιθόταν', 'επετίθετο'}},
                'pl': {'pri': {'επιτιθέμεθα', 'επιτιθόμασταν'}, 'sec': {'επιτιθόσασταν', 'επιτίθεσθε'},
                       'ter': {'επιτιθούνταν', 'επιτίθεντο'}}}}}, 'passive_aorist_participle': {'pl': {
                'masc': {'gen': {'επιτεθέντων'}, 'nom': {'επιτεθέντες'}, 'voc': {'επιτεθέντες'},
                         'acc': {'επιτεθέντες'}},
                'fem': {'gen': {'επιτεθεισών'}, 'nom': {'επιτεθείσες'}, 'voc': {'επιτεθείσες'}, 'acc': {'επιτεθείσες'}},
                'neut': {'gen': {'επιτεθέντων'}, 'nom': {'επιτεθέντα'}, 'voc': {'επιτεθέντα'}, 'acc': {'επιτεθέντα'}}},
                'sg': {'masc': {'gen': {
                    'επιτεθέντος'},
                    'nom': {
                        'επιτεθείς'},
                    'voc': {
                        'επιτεθείς'},
                    'acc': {
                        'επιτεθέντα'}},
                    'fem': {'gen': {
                        'επιτεθείσας'},
                        'nom': {
                            'επιτεθείσα'},
                        'voc': {
                            'επιτεθείσα'},
                        'acc': {
                            'επιτεθείσα'}},
                    'neut': {'gen': {
                        'επιτεθέντος'},
                        'nom': {
                            'επιτεθέν'},
                        'voc': {
                            'επιτεθέν'},
                        'acc': {
                            'επιτεθέν'}}}},
                'pass_pres_participle': {'pl': {
                    'masc': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενοι'}, 'voc': {'επιτιθέμενοι'},
                             'acc': {'επιτιθέμενους'}},
                    'fem': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενες'}, 'voc': {'επιτιθέμενες'},
                            'acc': {'επιτιθέμενες'}},
                    'neut': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενα'}, 'voc': {'επιτιθέμενα'},
                             'acc': {'επιτιθέμενα'}}}, 'sg': {
                    'masc': {'gen': {'επιτιθέμενου'}, 'nom': {'επιτιθέμενος'}, 'voc': {'επιτιθέμενε'},
                             'acc': {'επιτιθέμενο'}},
                    'fem': {'gen': {'επιτιθέμενης'}, 'nom': {'επιτιθέμενη'}, 'voc': {'επιτιθέμενη'},
                            'acc': {'επιτιθέμενη'}},
                    'neut': {'gen': {'επιτιθέμενου'}, 'nom': {'επιτιθέμενο'}, 'voc': {'επιτιθέμενο'},
                             'acc': {'επιτιθέμενο'}}}}, 'passive_perfect_participle': {'pl': {
                'masc': {'gen': {'επιτεθειμένων'}, 'nom': {'επιτεθειμένοι'}, 'voc': {'επιτεθειμένοι'},
                         'acc': {'επιτεθειμένους'}},
                'fem': {'gen': {'επιτεθειμένων'}, 'nom': {'επιτεθειμένες'}, 'voc': {'επιτεθειμένες'},
                        'acc': {'επιτεθειμένες'}},
                'neut': {'gen': {'επιτεθειμένων'}, 'nom': {'επιτεθειμένα'}, 'voc': {'επιτεθειμένα'},
                         'acc': {'επιτεθειμένα'}}}, 'sg': {
                'masc': {'gen': {'επιτεθειμένου'}, 'nom': {'επιτεθειμένος'}, 'voc': {'επιτεθειμένε'},
                         'acc': {'επιτεθειμένο'}},
                'fem': {'gen': {'επιτεθειμένης'}, 'nom': {'επιτεθειμένη'}, 'voc': {'επιτεθειμένη'},
                        'acc': {'επιτεθειμένη'}},
                'neut': {'gen': {'επιτεθειμένου'}, 'nom': {'επιτεθειμένο'}, 'voc': {'επιτεθειμένο'},
                         'acc': {'επιτεθειμένο'}}}}}

        )

    def test_verb_leo(self):
        self.assertDictEqual(
            verb.create_all_forms('λέω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'λέω'}, 'sec': {'λες'}, 'ter': {'λέει'}},
                                            'pl': {'pri': {'λέμε'}, 'sec': {'λέτε'}, 'ter': {'λένε', 'λεν'}}},
                                    'imp': {'sg': {'sec': {'λέγε'}}, 'pl': {'sec': {'λέγετε', 'λέτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'λέγομαι'}, 'sec': {'λέγεσαι'}, 'ter': {'λέγεται'}},
                        'pl': {'pri': {'λεγόμαστε'}, 'sec': {'λεγόσαστε', 'λέγεστε'}, 'ter': {'λέγονται'}}},
                'imp': {'pl': {'sec': {'λέγεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'πω'}, 'sec': {'πεις'}, 'ter': {'πει'}},
                        'pl': {'pri': {'πούμε'}, 'sec': {'πείτε'}, 'ter': {'πούνε', 'πουν'}}},
                'imp': {'sg': {'sec': {'πες'}}, 'pl': {'sec': {'πέστε', 'πείτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ειπωθώ'}, 'sec': {'ειπωθείς'}, 'ter': {'ειπωθεί'}},
                        'pl': {'pri': {'ειπωθούμε'}, 'sec': {'ειπωθείτε'}, 'ter': {'ειπωθούν', 'ειπωθούνε'}}},
                'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'ειπωθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'είπα'}, 'sec': {'είπες'}, 'ter': {'είπε'}},
                        'pl': {'pri': {'είπαμε'}, 'sec': {'είπατε'}, 'ter': {'είπανε', 'είπαν'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ειπώθηκα'}, 'sec': {'ειπώθηκες'}, 'ter': {'ειπώθηκε'}},
                        'pl': {'pri': {'ειπωθήκαμε'}, 'sec': {'ειπωθήκατε'}, 'ter': {'ειπωθήκανε', 'ειπώθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έλεγα'}, 'sec': {'έλεγες'}, 'ter': {'έλεγε'}},
                                                'pl': {'pri': {'λέγαμε'}, 'sec': {'λέγατε'},
                                                       'ter': {'έλεγαν', 'λέγανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'λεγόμουνα', 'λεγόμουν'}, 'sec': {'λεγόσουν', 'λεγόσουνα'},
                        'ter': {'λεγόταν', 'λεγότανε'}},
                 'pl': {'pri': {'λεγόμασταν', 'λεγόμαστε'}, 'sec': {'λεγόσαστε', 'λεγόσασταν'},
                        'ter': {'λεγόντουσαν', 'λέγονταν'}}}}}, 'act_pres_participle': {'λέγοντας'},
             'arch_act_pres_participle': {
                 'pl': {'fem': {'voc': {'λέγουσες'}, 'gen': {'λεγουσών'}, 'acc': {'λέγουσες'}, 'nom': {'λέγουσες'}},
                        'neut': {'voc': {'λέγοντα'}, 'gen': {'λεγόντων'}, 'acc': {'λέγοντα'}, 'nom': {'λέγοντα'}},
                        'masc': {'voc': {'λέγοντες'}, 'gen': {'λεγόντων'}, 'acc': {'λέγοντες'}, 'nom': {'λέγοντες'}}},
                 'sg': {'fem': {'voc': {'λέγουσα'}, 'gen': {'λέγουσας'}, 'acc': {'λέγουσα'}, 'nom': {'λέγουσα'}},
                        'neut': {'voc': {'λέγον'}, 'gen': {'λέγοντος'}, 'acc': {'λέγον'}, 'nom': {'λέγον'}},
                        'masc': {'voc': {'λέγων'}, 'gen': {'λέγοντος'}, 'acc': {'λέγοντα'}, 'nom': {'λέγων'}}}},
             'pass_pres_participle': {
                 'pl': {'fem': {'voc': {'λεγόμενες'}, 'gen': {'λεγόμενων'}, 'acc': {'λεγόμενες'}, 'nom': {'λεγόμενες'}},
                        'neut': {'voc': {'λεγόμενα'}, 'gen': {'λεγόμενων'}, 'acc': {'λεγόμενα'}, 'nom': {'λεγόμενα'}},
                        'masc': {'voc': {'λεγόμενοι'}, 'gen': {'λεγόμενων'}, 'acc': {'λεγόμενους'},
                                 'nom': {'λεγόμενοι'}}},
                 'sg': {'fem': {'voc': {'λεγόμενη'}, 'gen': {'λεγόμενης'}, 'acc': {'λεγόμενη'}, 'nom': {'λεγόμενη'}},
                        'neut': {'voc': {'λεγόμενο'}, 'gen': {'λεγόμενου'}, 'acc': {'λεγόμενο'}, 'nom': {'λεγόμενο'}},
                        'masc': {'voc': {'λεγόμενε'}, 'gen': {'λεγόμενου'}, 'acc': {'λεγόμενο'},
                                 'nom': {'λεγόμενος'}}}}, 'passive_perfect_participle': {
                'pl': {'fem': {'voc': {'ειπωμένες'}, 'gen': {'ειπωμένων'}, 'acc': {'ειπωμένες'}, 'nom': {'ειπωμένες'}},
                       'neut': {'voc': {'ειπωμένα'}, 'gen': {'ειπωμένων'}, 'acc': {'ειπωμένα'}, 'nom': {'ειπωμένα'}},
                       'masc': {'voc': {'ειπωμένοι'}, 'gen': {'ειπωμένων'}, 'acc': {'ειπωμένους'},
                                'nom': {'ειπωμένοι'}}},
                'sg': {'fem': {'voc': {'ειπωμένη'}, 'gen': {'ειπωμένης'}, 'acc': {'ειπωμένη'}, 'nom': {'ειπωμένη'}},
                       'neut': {'voc': {'ειπωμένο'}, 'gen': {'ειπωμένου'}, 'acc': {'ειπωμένο'}, 'nom': {'ειπωμένο'}},
                       'masc': {'voc': {'ειπωμένε'}, 'gen': {'ειπωμένου'}, 'acc': {'ειπωμένο'}, 'nom': {'ειπωμένος'}}}}}

        )

    def test_verb_synisto(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συνιστώ'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'συνιστώ'}, 'sec': {'συνιστάς'}, 'ter': {'συνιστά'}},
                        'pl': {'pri': {'συνιστούμε'}, 'sec': {'συνιστάτε'},
                               'ter': {'συνιστούν'}}},
                'imp': {'sg': {'sec': {'συνίστα'}}, 'pl': {'sec': {'συνιστάτε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'συνίσταμαι', 'συνιστώμαι'}, 'sec': {'συνιστάσαι', 'συνίστασαι'},
                       'ter': {'συνιστάται', 'συνίσταται'}},
                'pl': {'pri': {'συνιστάμεθα', 'συνιστόμαστε'}, 'sec': {'συνίστασθε', 'συνιστάστε', 'συνίσταστε'},
                       'ter': {'συνίστανται', 'συνιστώνται'}}}, 'imp': {'pl': {'sec': {'συνίστασθε', 'συνιστάστε'}}}}},
                'conjunctive': {
                    'active': {'ind': {'sg': {'pri': {'συστήσω'}, 'sec': {'συστήσεις'}, 'ter': {'συστήσει'}},
                                       'pl': {'pri': {'συστήσουμε'}, 'sec': {'συστήσετε'},
                                              'ter': {'συστήσουνε', 'συστήσουν'}}},
                               'imp': {'sg': {'sec': {'σύστησε'}}, 'pl': {'sec': {'συστήστε'}}}}, 'passive': {
                        'ind': {'sg': {'pri': {'συσταθώ'}, 'sec': {'συσταθείς'}, 'ter': {'συσταθεί'}},
                                'pl': {'pri': {'συσταθούμε'}, 'sec': {'συσταθείτε'},
                                       'ter': {'συσταθούνε', 'συσταθούν'}}},
                        'imp': {'sg': {'sec': {'συστήσου'}}, 'pl': {'sec': {'συσταθείτε'}}}}},
                'aorist': {'active': {'ind': {
                    'sg': {'pri': {'σύστησα', 'συνέστησα'}, 'sec': {'σύστησες', 'συνέστησες'},
                           'ter': {'συνέστησε', 'σύστησε'}},
                    'pl': {'pri': {'συστήσαμε'}, 'sec': {'συστήσατε'},
                           'ter': {'συστήσανε', 'σύστησαν', 'συνέστησαν'}}}},
                    'passive': {'ind': {
                        'sg': {'pri': {
                            'συνεστάθην',
                            'συστάθηκα'},
                            'sec': {
                                'συστάθηκες',
                                'συνεστάθης'},
                            'ter': {
                                'συστάθηκε',
                                'συνεστάθη'}},
                        'pl': {'pri': {
                            'συνεστάθημεν',
                            'συσταθήκαμε'},
                            'sec': {
                                'συνεστάθητε',
                                'συσταθήκατε'},
                            'ter': {
                                'συστάθηκαν',
                                'συνεστάθησαν',
                                'συσταθήκανε'}}}}},
                'paratatikos': {'active': {
                    'ind': {'sg': {'pri': {'συνιστούσα'}, 'sec': {'συνιστούσες'}, 'ter': {'συνιστούσε'}},
                            'pl': {'pri': {'συνιστούσαμε'}, 'sec': {'συνιστούσατε'},
                                   'ter': {'συνιστούσανε', 'συνιστούσαν'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'συνιστάμην'}, 'sec': {'συνίστασο'}, 'ter': {'συνίστατο'}},
                            'pl': {'pri': {'συνιστόμασταν', 'συνιστάμεθα', 'συνιστόμαστε'},
                                   'sec': {'συνιστάστε', 'συνιστόσαστε', 'συνιστόσασταν', 'συνίστασθε'},
                                   'ter': {'συνίσταντο'}}}}}, 'act_pres_participle': {'συνιστώντας'},
                'passive_aorist_participle': {'pl': {
                    'neut': {'acc': {'συσταθέντα'}, 'nom': {'συσταθέντα'}, 'voc': {'συσταθέντα'},
                             'gen': {'συσταθέντων'}},
                    'masc': {'acc': {'συσταθέντες'}, 'nom': {'συσταθέντες'}, 'voc': {'συσταθέντες'},
                             'gen': {'συσταθέντων'}},
                    'fem': {'acc': {'συσταθείσες'}, 'nom': {'συσταθείσες'}, 'voc': {'συσταθείσες'},
                            'gen': {'συσταθεισών'}}}, 'sg': {
                    'neut': {'acc': {'συσταθέν'}, 'nom': {'συσταθέν'}, 'voc': {'συσταθέν'}, 'gen': {'συσταθέντος'}},
                    'masc': {'acc': {'συσταθέντα'}, 'nom': {'συσταθείς'}, 'voc': {'συσταθείς'}, 'gen': {'συσταθέντος'}},
                    'fem': {'acc': {'συσταθείσα'}, 'nom': {'συσταθείσα'}, 'voc': {'συσταθείσα'},
                            'gen': {'συσταθείσας'}}}},
                'pass_pres_participle': {'pl': {'fem': {'acc': {'συνιστώμενες', 'συνιστάμενες'},
                                                        'gen': {'συνιστώμενων', 'συνιστάμενων'},
                                                        'nom': {'συνιστώμενες', 'συνιστάμενες'},
                                                        'voc': {'συνιστώμενες', 'συνιστάμενες'}},
                                                'masc': {'acc': {'συνιστώμενους', 'συνιστάμενους'},
                                                         'gen': {'συνιστώμενων', 'συνιστάμενων'},
                                                         'nom': {'συνιστάμενοι', 'συνιστώμενοι'},
                                                         'voc': {'συνιστάμενοι', 'συνιστώμενοι'}},
                                                'neut': {'acc': {'συνιστάμενα', 'συνιστώμενα'},
                                                         'gen': {'συνιστώμενων', 'συνιστάμενων'},
                                                         'nom': {'συνιστάμενα', 'συνιστώμενα'},
                                                         'voc': {'συνιστάμενα', 'συνιστώμενα'}}},
                                         'sg': {'fem': {'acc': {'συνιστώμενη', 'συνιστάμενη'},
                                                        'gen': {'συνιστάμενης', 'συνιστώμενης'},
                                                        'nom': {'συνιστώμενη', 'συνιστάμενη'},
                                                        'voc': {'συνιστώμενη', 'συνιστάμενη'}},
                                                'masc': {'acc': {'συνιστώμενο', 'συνιστάμενο'},
                                                         'gen': {'συνιστάμενου', 'συνιστώμενου'},
                                                         'nom': {'συνιστώμενος', 'συνιστάμενος'},
                                                         'voc': {'συνιστάμενε', 'συνιστώμενε'}},
                                                'neut': {'acc': {'συνιστώμενο', 'συνιστάμενο'},
                                                         'gen': {'συνιστάμενου', 'συνιστώμενου'},
                                                         'nom': {'συνιστώμενο', 'συνιστάμενο'},
                                                         'voc': {'συνιστώμενο', 'συνιστάμενο'}}}
                                         }, 'passive_perfect_participle': {'pl': {
                'neut': {'acc': {'συστημένα'}, 'nom': {'συστημένα'}, 'voc': {'συστημένα'}, 'gen': {'συστημένων'}},
                'masc': {'acc': {'συστημένους'}, 'nom': {'συστημένοι'}, 'voc': {'συστημένοι'}, 'gen': {'συστημένων'}},
                'fem': {'acc': {'συστημένες'}, 'nom': {'συστημένες'}, 'voc': {'συστημένες'}, 'gen': {'συστημένων'}}},
                'sg': {
                    'neut': {'acc': {'συστημένο'},
                             'nom': {'συστημένο'},
                             'voc': {'συστημένο'},
                             'gen': {'συστημένου'}},
                    'masc': {'acc': {'συστημένο'},
                             'nom': {'συστημένος'},
                             'voc': {'συστημένε'},
                             'gen': {'συστημένου'}},
                    'fem': {'acc': {'συστημένη'},
                            'nom': {'συστημένη'},
                            'voc': {'συστημένη'},
                            'gen': {
                                'συστημένης'}}}}}
        )

    def test_verb_katebainw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('κατεβαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'κατεβαίνω'}, 'sec': {'κατεβαίνεις'}, 'ter': {'κατεβαίνει'}},
                                            'pl': {'pri': {'κατεβαίνουμε'}, 'sec': {'κατεβαίνετε'},
                                                   'ter': {'κατεβαίνουνε', 'κατεβαίνουν'}}},
                                    'imp': {'sg': {'sec': {'κατέβαινε'}}, 'pl': {'sec': {'κατεβαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {
                 'sg': {'pri': {'κατέβω', 'κατεβώ'}, 'sec': {'κατεβείς', 'κατέβεις'}, 'ter': {'κατέβει', 'κατεβεί'}},
                 'pl': {'pri': {'κατέβουμε', 'κατεβούμε'}, 'sec': {'κατέβετε', 'κατεβείτε'},
                        'ter': {'κατέβουν', 'κατεβούν', 'κατεβούνε', 'κατέβουνε'}}},
                 'imp': {'sg': {'sec': {'κατέβα'}}, 'pl': {'sec': {'κατεβείτε'}}}}},
             'aorist': {'active': {'ind': {
                 'sg': {'pri': {'κατέβηκα', 'κατέβην'}, 'sec': {'κατέβης', 'κατέβηκες'}, 'ter': {'κατέβη', 'κατέβηκε'}},
                 'pl': {'pri': {'κατεβήκαμε', 'κατέβημεν'}, 'sec': {'κατέβητε', 'κατεβήκατε'},
                        'ter': {'κατεβήκανε', 'κατέβηκαν', 'κατέβησαν'}}}}}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'κατέβαινα'}, 'sec': {'κατέβαινες'}, 'ter': {'κατέβαινε'}},
                        'pl': {'pri': {'καταβαίναμε'}, 'sec': {'καταβαίνατε'}, 'ter': {'κατέβαιναν', 'καταβαίνανε'}}}}},
             'act_pres_participle': {'κατεβαίνοντας'}}

        )

    def test_verb_symbainw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('συμβαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'συμβαίνω'}, 'sec': {'συμβαίνεις'}, 'ter': {'συμβαίνει'}},
                                            'pl': {'pri': {'συμβαίνουμε'}, 'sec': {'συμβαίνετε'},
                                                   'ter': {'συμβαίνουν', 'συμβαίνουνε'}}},
                                    'imp': {'sg': {'sec': {'σύμβαινε'}}, 'pl': {'sec': {'συμβαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'συμβώ'}, 'sec': {'συμβείς'}, 'ter': {'συμβεί'}},
                                                'pl': {'pri': {'συμβούμε'}, 'sec': {'συμβείτε'},
                                                       'ter': {'συμβούν', 'συμβούνε'}}},
                                        'imp': {'sg': {'sec': set()}, 'pl': {'sec': {'συμβείτε'}}}}},
             'aorist': {'active': {'ind': {
                 'sg': {'pri': {'συνέβην', 'συνέβηκα'}, 'sec': {'συνέβης', 'συνέβηκες'}, 'ter': {'συνέβη', 'συνέβηκε'}},
                 'pl': {'pri': {'συνεβήκαμε', 'συνέβημεν'}, 'sec': {'συνέβητε', 'συνεβήκατε'},
                        'ter': {'συνέβηκαν', 'συνεβήκανε', 'συνέβησαν'}}}}}, 'paratatikos': {'active': {
                'ind': {'sg': {'pri': {'συνέβαινα'}, 'sec': {'συνέβαινες'}, 'ter': {'συνέβαινε'}},
                        'pl': {'pri': {'συμβαίναμε'}, 'sec': {'συμβαίνατε'}, 'ter': {'συμβαίνανε', 'συνέβαιναν'}}}}},
             'act_pres_participle': {'συμβαίνοντας'}, 'arch_act_pres_participle': {'pl': {
                'neut': {'nom': {'συμβαίνοντα'}, 'voc': {'συμβαίνοντα'}, 'gen': {'συμβαινόντων'},
                         'acc': {'συμβαίνοντα'}},
                'masc': {'nom': {'συμβαίνοντες'}, 'voc': {'συμβαίνοντες'}, 'gen': {'συμβαινόντων'},
                         'acc': {'συμβαίνοντες'}},
                'fem': {'nom': {'συμβαίνουσες'}, 'voc': {'συμβαίνουσες'}, 'gen': {'συμβαινουσών'},
                        'acc': {'συμβαίνουσες'}}}, 'sg': {
                'neut': {'nom': {'συμβαίνον'}, 'voc': {'συμβαίνον'}, 'gen': {'συμβαίνοντος'}, 'acc': {'συμβαίνον'}},
                'masc': {'nom': {'συμβαίνων'}, 'voc': {'συμβαίνων'}, 'gen': {'συμβαίνοντος'}, 'acc': {'συμβαίνοντα'}},
                'fem': {'nom': {'συμβαίνουσα'}, 'voc': {'συμβαίνουσα'}, 'gen': {'συμβαίνουσας'},
                        'acc': {'συμβαίνουσα'}}}}},

        )

    def test_verb_pao(self):
        self.assertDictEqual(
            verb.create_all_forms('πάω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                            'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                    'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                   'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'}, 'ter': {'πήγαν', 'πήγανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                                'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                       'ter': {'πήγαιναν', 'πηγαίνανε'}}}}}}

        )

    def test_verb_paraeimai(self):
        self.assertDictEqual(
            verb.create_all_forms('παραείμαι'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παραείμαι'}, 'sec': {'παραείσαι'}, 'ter': {'παραείναι'}},
                                            'pl': {'pri': {'παραείμαστε'}, 'sec': {'παραείσαστε', 'παραείστε'},
                                                   'ter': {'παραείναι'}}}}}, 'conjunctive': {}, 'aorist': {},
             'paratatikos': {'active': {'ind': {
                 'sg': {'pri': {'παραήμουνα', 'παραήμουν'}, 'sec': {'παραήσουν', 'παραήσουνα'},
                        'ter': {'παραήταν', 'παραήτανε'}},
                 'pl': {'pri': {'παραήμασταν', 'παραήμαστε'}, 'sec': {'παραήσασταν', 'παραήσαστε'},
                        'ter': {'παραήταν', 'παραήτανε'}}}}}, 'act_pres_participle': {'παραόντας'}},

        )

    def test_verb_eimai(self):
        self.assertDictEqual(
            verb.create_all_forms('είμαι'),
            {'present': {'active': {'ind': {'sg': {'pri': {'είμαι'}, 'sec': {'είσαι'}, 'ter': {'είναι'}},
                                            'pl': {'pri': {'είμαστε'}, 'sec': {'είστε', 'είσαστε'}, 'ter': {'είναι'}}},
                                    'imp': {'sg': {'ter': {'έστω'}}}}}, 'conjunctive': {}, 'aorist': {},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'ήμουν', 'ήμουνα'}, 'sec': {'ήσουν', 'ήσουνα'}, 'ter': {'ήταν', 'ήτανε'}},
                         'pl': {'pri': {'ήμασταν', 'ήμαστε'}, 'sec': {'ήσασταν', 'ήσαστε'},
                                'ter': {'ήταν', 'ήτανε'}}}}}, 'act_pres_participle': {'όντας'},
             'arch_act_pres_participle': {
                 'pl': {'neut': {'acc': {'όντα'}, 'nom': {'όντα'}, 'gen': {'όντων'}, 'voc': {'όντα'}},
                        'fem': {'acc': {'ούσες'}, 'nom': {'ούσες'}, 'gen': {'ουσών'}, 'voc': {'ούσες'}},
                        'masc': {'acc': {'όντες'}, 'nom': {'όντες'}, 'gen': {'όντων'}, 'voc': {'όντες'}}},
                 'sg': {'neut': {'acc': {'ον'}, 'nom': {'ον'}, 'gen': {'όντος'}, 'voc': {'ον'}},
                        'fem': {'acc': {'ούσα'}, 'nom': {'ούσα'}, 'gen': {'ούσας'}, 'voc': {'ούσα'}},
                        'masc': {'acc': {'όντα'}, 'nom': {'ων'}, 'gen': {'όντος'}, 'voc': {'ων'}}}}}

        )

    def test_verb_epembainw(self):
        self.assertDictEqual(
            verb.create_all_forms('επεμβαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'επεμβαίνω'}, 'sec': {'επεμβαίνεις'}, 'ter': {'επεμβαίνει'}},
                                            'pl': {'pri': {'επεμβαίνουμε'}, 'sec': {'επεμβαίνετε'},
                                                   'ter': {'επεμβαίνουνε', 'επεμβαίνουν'}}},
                                    'imp': {'sg': {'sec': {'επέμβαινε'}}, 'pl': {'sec': {'επεμβαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'επεμβώ'}, 'sec': {'επεμβείς'}, 'ter': {'επεμβεί'}},
                                                'pl': {'pri': {'επεμβούμε'}, 'sec': {'επεμβείτε'},
                                                       'ter': {'επεμβούν', 'επεμβούνε'}}},
                                        'imp': {'sg': {'sec': set()}, 'pl': {'sec': {'επεμβείτε'}}}}},
             'aorist': {'active': {'ind': {'pl': {'pri': {'επενέβημεν', 'επεμβήκαμε'},
                                                  'sec': {'επενέβητε', 'επεμβήκατε'},
                                                  'ter': {'επέμβηκαν',
                                                          'επεμβήκαν',
                                                          'επεμβήκανε',
                                                          'επενέβησαν'}},
                                           'sg': {'pri': {'επενέβην', 'επέμβηκα', 'επεμβήκα'},
                                                  'sec': {'επεμβήκες', 'επενέβης', 'επέμβηκες'},
                                                  'ter': {'επέμβηκε', 'επεμβήκε', 'επενέβη'}}}}

                        },
             'paratatikos': {
                 'active': {'ind': {'sg': {'pri': {'επενέβαινα'}, 'sec': {'επενέβαινες'}, 'ter': {'επενέβαινε'}},
                                    'pl': {'pri': {'επενεβαίναμε'}, 'sec': {'επενεβαίνατε'},
                                           'ter': {'επενεβαίνανε', 'επενέβαιναν'}}}}},
             'act_pres_participle': {'επεμβαίνοντας'}, 'arch_act_pres_participle': {'pl': {
                'neut': {'acc': {'επεμβαίνοντα'}, 'nom': {'επεμβαίνοντα'}, 'gen': {'επεμβαινόντων'},
                         'voc': {'επεμβαίνοντα'}},
                'masc': {'acc': {'επεμβαίνοντες'}, 'nom': {'επεμβαίνοντες'}, 'gen': {'επεμβαινόντων'},
                         'voc': {'επεμβαίνοντες'}},
                'fem': {'acc': {'επεμβαίνουσες'}, 'nom': {'επεμβαίνουσες'}, 'gen': {'επεμβαινουσών'},
                        'voc': {'επεμβαίνουσες'}}}, 'sg': {
                'neut': {'acc': {'επεμβαίνον'}, 'nom': {'επεμβαίνον'}, 'gen': {'επεμβαίνοντος'}, 'voc': {'επεμβαίνον'}},
                'masc': {'acc': {'επεμβαίνοντα'}, 'nom': {'επεμβαίνων'}, 'gen': {'επεμβαίνοντος'},
                         'voc': {'επεμβαίνων'}},
                'fem': {'acc': {'επεμβαίνουσα'}, 'nom': {'επεμβαίνουσα'}, 'gen': {'επεμβαίνουσας'},
                        'voc': {'επεμβαίνουσα'}}}}},

        )

    def test_verb_parembainw(self):
        self.assertDictEqual(
            verb.create_all_forms('παρεμβαίνω'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'παρεμβαίνω'}, 'sec': {'παρεμβαίνεις'}, 'ter': {'παρεμβαίνει'}},
                        'pl': {'pri': {'παρεμβαίνουμε'}, 'sec': {'παρεμβαίνετε'},
                               'ter': {'παρεμβαίνουνε', 'παρεμβαίνουν'}}},
                'imp': {'sg': {'sec': {'παρέμβαινε'}}, 'pl': {'sec': {'παρεμβαίνετε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'παρεμβώ'}, 'sec': {'παρεμβείς'}, 'ter': {'παρεμβεί'}},
                        'pl': {'pri': {'παρεμβούμε'}, 'sec': {'παρεμβείτε'}, 'ter': {'παρεμβούνε', 'παρεμβούν'}}},
                'imp': {'sg': {'sec': set()}, 'pl': {'sec': {'παρεμβείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'παρενέβην'}, 'sec': {'παρενέβης'}, 'ter': {'παρενέβη'}},
                        'pl': {'pri': {'παρενέβημεν'}, 'sec': {'παρενέβητε'}, 'ter': {'παρενέβησαν'}}}}},
                'paratatikos': {'active': {
                    'ind': {'sg': {'pri': {'παρέμβαινα'}, 'sec': {'παρέμβαινες'}, 'ter': {'παρέμβαινε'}},
                            'pl': {'pri': {'παρεμβαίναμε'}, 'sec': {'παρεμβαίνατε'},
                                   'ter': {'παρεμβαίνανε', 'παρέμβαιναν'}}}}},
                'act_pres_participle': {'παρεμβαίνοντας'},
                'arch_act_pres_participle': {'sg': {
                    'neut': {'gen': {'παρεμβαίνοντος'}, 'nom': {'παρεμβαίνον'}, 'acc': {'παρεμβαίνον'},
                             'voc': {'παρεμβαίνον'}},
                    'masc': {'gen': {'παρεμβαίνοντος'}, 'nom': {'παρεμβαίνων'}, 'acc': {'παρεμβαίνοντα'},
                             'voc': {'παρεμβαίνων'}},
                    'fem': {'gen': {'παρεμβαίνουσας'}, 'nom': {'παρεμβαίνουσα'}, 'acc': {'παρεμβαίνουσα'},
                            'voc': {'παρεμβαίνουσα'}}}, 'pl': {
                    'neut': {'gen': {'παρεμβαινόντων'}, 'nom': {'παρεμβαίνοντα'}, 'acc': {'παρεμβαίνοντα'},
                             'voc': {'παρεμβαίνοντα'}},
                    'masc': {'gen': {'παρεμβαινόντων'}, 'nom': {'παρεμβαίνοντες'}, 'acc': {'παρεμβαίνοντες'},
                             'voc': {'παρεμβαίνοντες'}},
                    'fem': {'gen': {'παρεμβαινουσών'}, 'nom': {'παρεμβαίνουσες'}, 'acc': {'παρεμβαίνουσες'},
                            'voc': {'παρεμβαίνουσες'}}}}}

        )

    def test_aorist_verb_anago(self):
        self.assertDictEqual(
            verb.create_all_forms('ανάγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'ανήγαγα'}, 'sec': {'ανήγαγες'}, 'ter': {'ανήγαγε'}},
                                'pl': {'pri': {'αναγάγαμε'}, 'sec': {'αναγάγατε'}, 'ter': {'ανήγαγαν', 'αναγάγανε'}}}},
             'passive': {'ind': {
                 'sg': {'pri': {'ανήχθην', 'ανάχθηκα'}, 'sec': {'ανήχθης', 'ανάχθηκες'}, 'ter': {'ανάχθηκε', 'ανήχθη'}},
                 'pl': {'pri': {'ανήχθημεν', 'αναχθήκαμε'}, 'sec': {'αναχθήκατε', 'ανήχθητε'},
                        'ter': {'ανήχθησαν', 'ανάχθηκαν', 'αναχθήκανε'}}}}}

        )

    def test_present_verb_thumoumai(self):
        self.assertDictEqual(
            verb.create_all_forms('θυμούμαι'),
            {'present':
                 {'passive':
                      {'ind': {'sg': {'pri': {'θυμούμαι'}, 'sec': {'θυμείσαι'}, 'ter': {'θυμείται'}},
                               'pl': {'pri': {'θυμούμεθα', 'θυμούμαστε'}, 'sec': {'θυμείσθε', 'θυμείστε'},
                                      'ter': {'θυμούνται'}}},
                       'imp': {'pl': {'sec': {'θυμείστε'}}}}},
             'conjunctive': {'passive': {'ind': {'sg': {'pri': {'θυμηθώ'}, 'sec': {'θυμηθείς'}, 'ter': {'θυμηθεί'}},
                                                 'pl': {'pri': {'θυμηθούμε'}, 'sec': {'θυμηθείτε'},
                                                        'ter': {'θυμηθούν', 'θυμηθούνε'}}},
                                         'imp': {'sg': {'sec': {'θυμήσου'}}, 'pl': {'sec': {'θυμηθείτε'}}}}},
             'aorist': {'passive': {'ind': {'sg': {'pri': {'θυμήθηκα'}, 'sec': {'θυμήθηκες'}, 'ter': {'θυμήθηκε'}},
                                            'pl': {'pri': {'θυμηθήκαμε'}, 'sec': {'θυμηθήκατε'},
                                                   'ter': {'θυμηθήκανε', 'θυμήθηκαν'}}}}}, 'paratatikos': {},
             'pass_pres_participle': {'sg': {
                 'masc': {'nom': {'θυμούμενος'}, 'gen': {'θυμούμενου'}, 'acc': {'θυμούμενο'}, 'voc': {'θυμούμενε'}},
                 'fem': {'nom': {'θυμούμενη'}, 'gen': {'θυμούμενης'}, 'acc': {'θυμούμενη'}, 'voc': {'θυμούμενη'}},
                 'neut': {'nom': {'θυμούμενο'}, 'gen': {'θυμούμενου'}, 'acc': {'θυμούμενο'}, 'voc': {'θυμούμενο'}}},
                 'pl': {
                     'masc': {'nom': {'θυμούμενοι'}, 'gen': {'θυμούμενων'}, 'acc': {'θυμούμενους'},
                              'voc': {'θυμούμενοι'}},
                     'fem': {'nom': {'θυμούμενες'}, 'gen': {'θυμούμενων'}, 'acc': {'θυμούμενες'},
                             'voc': {'θυμούμενες'}},
                     'neut': {'nom': {'θυμούμενα'}, 'gen': {'θυμούμενων'}, 'acc': {'θυμούμενα'},
                              'voc': {'θυμούμενα'}}}}}

        )

    def test_present_verb_drw(self):
        self.assertDictEqual(
            verb.create_all_forms('δρω')['present'],
            {'active': {'ind': {'sg': {'pri': {'δράω', 'δρω'}, 'sec': {'δρας'},
                                       'ter': {'δράει', 'δρα'}},
                                'pl': {'pri': {'δράμε', 'δρούμε'}, 'sec': {'δράτε'},
                                       'ter': {'δρούνε', 'δράνε', 'δραν', 'δρουν'}}},
                        'imp': {'sg': {'sec': {'δρα'}}, 'pl': {'sec': {'δράτε'}}}}},
        )

    def test_aorist_verb_eisago(self):
        self.assertDictEqual(
            verb.create_all_forms('εισάγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'εισήγαγα'}, 'sec': {'εισήγαγες'}, 'ter': {'εισήγαγε'}},
                                'pl': {'pri': {'εισαγάγαμε'}, 'sec': {'εισαγάγατε'},
                                       'ter': {'εισήγαγαν', 'εισαγάγανε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'εισάχθηκα', 'εισήχθην'}, 'sec': {'εισάχθηκες', 'εισήχθης'},
                       'ter': {'εισάχθηκε', 'εισήχθη'}},
                'pl': {'pri': {'εισαχθήκαμε', 'εισήχθημεν'}, 'sec': {'εισήχθητε', 'εισαχθήκατε'},
                       'ter': {'εισάχθηκαν', 'εισαχθήκανε', 'εισήχθησαν'}}}}}

        )

    def test_aorist_verb_ago(self):
        self.assertDictEqual(
            verb.create_all_forms('άγω')['aorist'],
            {'active': {'ind': {'sg': {'pri': {'ήγαγα'}, 'sec': {'ήγαγες'}, 'ter': {'ήγαγε'}},
                                'pl': {'pri': {'αγάγαμε'}, 'sec': {'αγάγατε'}, 'ter': {'ήγαγαν', 'αγάγανε'}}}},
             'passive': {'ind': {'sg': {'pri': {'ήχθην'}, 'sec': {'ήχθης'}, 'ter': {'ήχθη'}},
                                 'pl': {'pri': {'ήχθημεν'}, 'sec': {'ήχθητε'}, 'ter': {'ήχθησαν'}}}}}

        )

    def test_verb_diagrafomai(self):
        self.assertDictEqual(
            verb.create_all_forms('διαγράφομαι'),
            {'present': {'passive': {
                'ind': {'sg': {'pri': {'διαγράφομαι'}, 'sec': {'διαγράφεσαι'}, 'ter': {'διαγράφεται'}},
                        'pl': {'pri': {'διαγραφόμαστε'}, 'sec': {'διαγράφεστε', 'διαγραφόσαστε'},
                               'ter': {'διαγράφονται'}}}, 'imp': {'pl': {'sec': {'διαγράφεστε'}}}}}, 'conjunctive': {
                'passive': {'ind': {'sg': {'pri': {'διαγραφώ', 'διαγραφτώ'}, 'sec': {'διαγραφτείς', 'διαγραφείς'},
                                           'ter': {'διαγραφεί', 'διαγραφτεί'}},
                                    'pl': {'pri': {'διαγραφτούμε', 'διαγραφούμε'},
                                           'sec': {'διαγραφείτε', 'διαγραφτείτε'},
                                           'ter': {'διαγραφτούνε', 'διαγραφούνε', 'διαγραφούν', 'διαγραφτούν'}}},
                            'imp': {'sg': {'sec': {'διαγράψου', ''}}, 'pl': {'sec': {'διαγραφείτε', 'διαγραφτείτε'}}}}},
                'aorist': {'passive': {'ind': {'sg': {'pri': {'διαγράφτηκα', 'διαγράφηκα', 'διεγράφην'},
                                                      'sec': {'διαγράφτηκες', 'διαγράφηκες', 'διεγράφης'},
                                                      'ter': {'διαγράφτηκε', 'διεγράφη', 'διαγράφηκε'}},
                                               'pl': {'pri': {'διαγραφήκαμε', 'διαγραφτήκαμε', 'διεγράφημεν'},
                                                      'sec': {'διαγραφήκατε', 'διαγραφτήκατε', 'διεγράφητε'},
                                                      'ter': {'διαγράφηκαν', 'διαγράφτηκαν', 'διαγραφτήκανε',
                                                              'διεγράφησαν', 'διαγραφήκανε'}}}}}, 'paratatikos': {
                'passive': {'ind': {
                    'sg': {'pri': {'διαγραφόμουνα', 'διαγραφόμουν'}, 'sec': {'διαγραφόσουν', 'διαγραφόσουνα'},
                           'ter': {'διαγραφότανε', 'διαγραφόταν'}},
                    'pl': {'pri': {'διαγραφόμαστε', 'διαγραφόμασταν'}, 'sec': {'διαγραφόσαστε', 'διαγραφόσασταν'},
                           'ter': {'διαγραφόντουσαν', 'διαγράφονταν'}}}}}, 'pass_pres_participle': {'sg': {
                'fem': {'acc': {'διαγραφόμενη'}, 'nom': {'διαγραφόμενη'}, 'voc': {'διαγραφόμενη'},
                        'gen': {'διαγραφόμενης'}},
                'neut': {'acc': {'διαγραφόμενο'}, 'nom': {'διαγραφόμενο'}, 'voc': {'διαγραφόμενο'},
                         'gen': {'διαγραφόμενου'}},
                'masc': {'acc': {'διαγραφόμενο'}, 'nom': {'διαγραφόμενος'}, 'voc': {'διαγραφόμενε'},
                         'gen': {'διαγραφόμενου'}}}, 'pl': {
                'fem': {'acc': {'διαγραφόμενες'}, 'nom': {'διαγραφόμενες'}, 'voc': {'διαγραφόμενες'},
                        'gen': {'διαγραφόμενων'}},
                'neut': {'acc': {'διαγραφόμενα'}, 'nom': {'διαγραφόμενα'}, 'voc': {'διαγραφόμενα'},
                         'gen': {'διαγραφόμενων'}},
                'masc': {'acc': {'διαγραφόμενους'}, 'nom': {'διαγραφόμενοι'}, 'voc': {'διαγραφόμενοι'},
                         'gen': {'διαγραφόμενων'}}}}, 'passive_perfect_participle': {'sg': {
                'fem': {'acc': {'διαγεγραμμένη', 'διαγραμμένη'}, 'nom': {'διαγεγραμμένη', 'διαγραμμένη'},
                        'voc': {'διαγεγραμμένη', 'διαγραμμένη'}, 'gen': {'διαγραμμένης', 'διαγεγραμμένης'}},
                'neut': {'acc': {'διαγραμμένο', 'διαγεγραμμένο'}, 'nom': {'διαγραμμένο', 'διαγεγραμμένο'},
                         'voc': {'διαγραμμένο', 'διαγεγραμμένο'}, 'gen': {'διαγεγραμμένου', 'διαγραμμένου'}},
                'masc': {'acc': {'διαγραμμένο', 'διαγεγραμμένο'}, 'nom': {'διαγεγραμμένος', 'διαγραμμένος'},
                         'voc': {'διαγραμμένε', 'διαγεγραμμένε'}, 'gen': {'διαγεγραμμένου', 'διαγραμμένου'}}}, 'pl': {
                'fem': {'acc': {'διαγραμμένες', 'διαγεγραμμένες'}, 'nom': {'διαγραμμένες', 'διαγεγραμμένες'},
                        'voc': {'διαγραμμένες', 'διαγεγραμμένες'}, 'gen': {'διαγραμμένων', 'διαγεγραμμένων'}},
                'neut': {'acc': {'διαγραμμένα', 'διαγεγραμμένα'}, 'nom': {'διαγραμμένα', 'διαγεγραμμένα'},
                         'voc': {'διαγραμμένα', 'διαγεγραμμένα'}, 'gen': {'διαγραμμένων', 'διαγεγραμμένων'}},
                'masc': {'acc': {'διαγεγραμμένους', 'διαγραμμένους'}, 'nom': {'διαγραμμένοι', 'διαγεγραμμένοι'},
                         'voc': {'διαγραμμένοι', 'διαγεγραμμένοι'}, 'gen': {'διαγραμμένων', 'διαγεγραμμένων'}}}}}

        )

    def test_verb_antitasso(self):
        self.assertDictEqual(
            verb.create_all_forms('αντιτάσσω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'αντιτάσσω'}, 'sec': {'αντιτάσσεις'}, 'ter': {'αντιτάσσει'}},
                                            'pl': {'pri': {'αντιτάσσουμε'}, 'sec': {'αντιτάσσετε'},
                                                   'ter': {'αντιτάσσουν', 'αντιτάσσουνε'}}},
                                    'imp': {'sg': {'sec': {'αντίτασσε'}}, 'pl': {'sec': {'αντιτάσσετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'αντιτάσσομαι'}, 'sec': {'αντιτάσσεσαι'}, 'ter': {'αντιτάσσεται'}},
                        'pl': {'pri': {'αντιτασσόμαστε'}, 'sec': {'αντιτασσόσαστε', 'αντιτάσσεστε'},
                               'ter': {'αντιτάσσονται'}}}, 'imp': {'pl': {'sec': {'αντιτάσσεστε'}}}}}, 'conjunctive': {
                'active': {'ind': {'sg': {'pri': {'αντιτάξω'}, 'sec': {'αντιτάξεις'}, 'ter': {'αντιτάξει'}},
                                   'pl': {'pri': {'αντιτάξουμε'}, 'sec': {'αντιτάξετε'},
                                          'ter': {'αντιτάξουνε', 'αντιτάξουν'}}},
                           'imp': {'sg': {'sec': {'αντίταξε'}}, 'pl': {'sec': {'αντιτάξτε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'αντιταχθώ', 'αντιταχτώ'}, 'sec': {'αντιταχτείς', 'αντιταχθείς'},
                           'ter': {'αντιταχθεί', 'αντιταχτεί'}},
                    'pl': {'pri': {'αντιταχθούμε', 'αντιταχτούμε'}, 'sec': {'αντιταχτείτε', 'αντιταχθείτε'},
                           'ter': {'αντιταχτούνε', 'αντιταχθούνε', 'αντιταχθούν', 'αντιταχτούν'}}}, 'imp': {
                    'sg': {'sec': {'αντιτάξου'}}, 'pl': {'sec': {'αντιταχτείτε', 'αντιταχθείτε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'αντέταξα'}, 'sec': {'αντέταξες'}, 'ter': {'αντέταξε'}},
                                   'pl': {'pri': {'αντιτάξαμε'}, 'sec': {'αντιτάξατε'},
                                          'ter': {'αντέταξαν', 'αντιτάξανε'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'αντιτάχτηκα', 'αντιτάχθηκα'}, 'sec': {'αντιτάχτηκες', 'αντιτάχθηκες'},
                           'ter': {'αντιτάχτηκε', 'αντιτάχθηκε'}},
                    'pl': {'pri': {'αντιταχθήκαμε', 'αντιταχτήκαμε'}, 'sec': {'αντιταχτήκατε', 'αντιταχθήκατε'},
                           'ter': {'αντιταχθήκανε', 'αντιτάχθηκαν', 'αντιτάχτηκαν', 'αντιταχτήκανε'}}}}},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'αντέτασσα'}, 'sec': {'αντέτασσες'}, 'ter': {'αντέτασσε'}},
                         'pl': {'pri': {'αντιτάσσαμε'}, 'sec': {'αντιτάσσατε'}, 'ter': {'αντιτάσσανε', 'αντέτασσαν'}}}},
                 'passive': {'ind': {'sg': {'pri': {'αντιτασσόμουνα', 'αντιτασσόμουν'},
                                            'sec': {'αντιτασσόσουν', 'αντιτασσόσουνα'},
                                            'ter': {'αντιτασσόταν', 'αντιτασσότανε'}},
                                     'pl': {'pri': {'αντιτασσόμαστε', 'αντιτασσόμασταν'},
                                            'sec': {'αντιτασσόσαστε', 'αντιτασσόσασταν'},
                                            'ter': {'αντιτάσσονταν', 'αντιτασσόντουσαν'}}}}},
             'act_pres_participle': {'αντιτάσσοντας'}, 'pass_pres_participle': {'sg': {
                'fem': {'acc': {'αντιτασσόμενη'}, 'nom': {'αντιτασσόμενη'}, 'gen': {'αντιτασσόμενης'},
                        'voc': {'αντιτασσόμενη'}},
                'neut': {'acc': {'αντιτασσόμενο'}, 'nom': {'αντιτασσόμενο'}, 'gen': {'αντιτασσόμενου'},
                         'voc': {'αντιτασσόμενο'}},
                'masc': {'acc': {'αντιτασσόμενο'}, 'nom': {'αντιτασσόμενος'}, 'gen': {'αντιτασσόμενου'},
                         'voc': {'αντιτασσόμενε'}}}, 'pl': {
                'fem': {'acc': {'αντιτασσόμενες'}, 'nom': {'αντιτασσόμενες'}, 'gen': {'αντιτασσόμενων'},
                        'voc': {'αντιτασσόμενες'}},
                'neut': {'acc': {'αντιτασσόμενα'}, 'nom': {'αντιτασσόμενα'}, 'gen': {'αντιτασσόμενων'},
                         'voc': {'αντιτασσόμενα'}},
                'masc': {'acc': {'αντιτασσόμενους'}, 'nom': {'αντιτασσόμενοι'}, 'gen': {'αντιτασσόμενων'},
                         'voc': {'αντιτασσόμενοι'}}}}}

        )

    def test_verb_douleuw(self):
        # self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('δουλεύω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'δουλεύω'}, 'sec': {'δουλεύεις'}, 'ter': {'δουλεύει'}},
                                            'pl': {'pri': {'δουλεύουμε'}, 'sec': {'δουλεύετε'},
                                                   'ter': {'δουλεύουν', 'δουλεύουνε'}}},
                                    'imp': {'sg': {'sec': {'δούλευε'}}, 'pl': {'sec': {'δουλεύετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'δουλεύομαι'}, 'sec': {'δουλεύεσαι'}, 'ter': {'δουλεύεται'}},
                        'pl': {'pri': {'δουλευόμαστε'}, 'sec': {'δουλεύεστε', 'δουλευόσαστε'}, 'ter': {'δουλεύονται'}}},
                'imp': {'pl': {'sec': {'δουλεύεστε'}}}}}, 'conjunctive': {'active': {'ind': {
                'sg': {'pri': {'δουλέψω', 'δουλεύσω'}, 'sec': {'δουλέψεις', 'δουλεύσεις'},
                       'ter': {'δουλεύσει', 'δουλέψει'}},
                'pl': {'pri': {'δουλέψουμε', 'δουλεύσουμε'}, 'sec': {'δουλεύσετε', 'δουλέψετε'},
                       'ter': {'δουλέψουν', 'δουλεύσουν', 'δουλεύσουνε', 'δουλέψουνε'}}}, 'imp': {
                'sg': {'sec': {'δούλευσε', 'δούλεψε'}}, 'pl': {'sec': {'δουλέψτε', 'δουλεύστε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'δουλευτώ', 'δουλευθώ'}, 'sec': {'δουλευθείς', 'δουλευτείς'},
                       'ter': {'δουλευτεί', 'δουλευθεί'}},
                'pl': {'pri': {'δουλευθούμε', 'δουλευτούμε'}, 'sec': {'δουλευτείτε', 'δουλευθείτε'},
                       'ter': {'δουλευτούνε', 'δουλευτούν', 'δουλευθούνε', 'δουλευθούν'}}}, 'imp': {
                'sg': {'sec': {'δουλεύσου', 'δουλέψου'}}, 'pl': {'sec': {'δουλευτείτε', 'δουλευθείτε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'δούλεψα', 'δούλευσα'}, 'sec': {'δούλεψες', 'δούλευσες'},
                                          'ter': {'δούλευσε', 'δούλεψε'}},
                                   'pl': {'pri': {'δουλεύσαμε', 'δουλέψαμε'}, 'sec': {'δουλέψατε', 'δουλεύσατε'},
                                          'ter': {'δουλέψανε', 'δουλεύσανε', 'δούλεψαν', 'δούλευσαν'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'δουλεύθηκα', 'δουλεύτηκα'}, 'sec': {'δουλεύτηκες', 'δουλεύθηκες'},
                                   'ter': {'δουλεύτηκε', 'δουλεύθηκε'}},
                            'pl': {'pri': {'δουλευτήκαμε', 'δουλευθήκαμε'}, 'sec': {'δουλευτήκατε', 'δουλευθήκατε'},
                                   'ter': {'δουλευτήκανε', 'δουλεύτηκαν', 'δουλεύθηκαν', 'δουλευθήκανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'δούλευα'}, 'sec': {'δούλευες'}, 'ter': {'δούλευε'}},
                                                'pl': {'pri': {'δουλεύαμε'}, 'sec': {'δουλεύατε'},
                                                       'ter': {'δούλευαν', 'δουλεύανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'δουλευόμουνα', 'δουλευόμουν'}, 'sec': {'δουλευόσουν', 'δουλευόσουνα'},
                        'ter': {'δουλευόταν', 'δουλευότανε'}},
                 'pl': {'pri': {'δουλευόμασταν', 'δουλευόμαστε'}, 'sec': {'δουλευόσαστε', 'δουλευόσασταν'},
                        'ter': {'δουλεύονταν', 'δουλευόντουσαν'}}}}}, 'act_pres_participle': {'δουλεύοντας'},
             'active_aorist_participle': {'pl': {
                 'fem': {'voc': {'δουλεύσασες'}, 'gen': {'δουλευσασών'}, 'nom': {'δουλεύσασες'},
                         'acc': {'δουλεύσασες'}},
                 'neut': {'voc': {'δουλεύσαντα'}, 'gen': {'δουλευσάντων'}, 'nom': {'δουλεύσαντα'},
                          'acc': {'δουλεύσαντα'}},
                 'masc': {'voc': {'δουλεύσαντες'}, 'gen': {'δουλευσάντων'}, 'nom': {'δουλεύσαντες'},
                          'acc': {'δουλεύσαντες'}}}, 'sg': {
                 'fem': {'voc': {'δουλεύσασα'}, 'gen': {'δουλεύσασας'}, 'nom': {'δουλεύσασα'}, 'acc': {'δουλεύσασα'}},
                 'neut': {'voc': {'δουλεύσαν'}, 'gen': {'δουλεύσαντος'}, 'nom': {'δουλεύσαν'}, 'acc': {'δουλεύσαν'}},
                 'masc': {'voc': {'δουλεύσας'}, 'gen': {'δουλεύσαντος'}, 'nom': {'δουλεύσας'},
                          'acc': {'δουλεύσαντα'}}}}, 'passive_perfect_participle': {'pl': {
                'fem': {'voc': {'δεδουλευμένες', 'δουλευμένες'}, 'gen': {'δεδουλευμένων', 'δουλευμένων'},
                        'nom': {'δεδουλευμένες', 'δουλευμένες'}, 'acc': {'δεδουλευμένες', 'δουλευμένες'}},
                'neut': {'voc': {'δουλευμένα', 'δεδουλευμένα'}, 'gen': {'δεδουλευμένων', 'δουλευμένων'},
                         'nom': {'δουλευμένα', 'δεδουλευμένα'}, 'acc': {'δουλευμένα', 'δεδουλευμένα'}},
                'masc': {'voc': {'δουλευμένοι', 'δεδουλευμένοι'}, 'gen': {'δεδουλευμένων', 'δουλευμένων'},
                         'nom': {'δουλευμένοι', 'δεδουλευμένοι'}, 'acc': {'δεδουλευμένους', 'δουλευμένους'}}}, 'sg': {
                'fem': {'voc': {'δεδουλευμένη', 'δουλευμένη'}, 'gen': {'δουλευμένης', 'δεδουλευμένης'},
                        'nom': {'δεδουλευμένη', 'δουλευμένη'}, 'acc': {'δεδουλευμένη', 'δουλευμένη'}},
                'neut': {'voc': {'δεδουλευμένο', 'δουλευμένο'}, 'gen': {'δουλευμένου', 'δεδουλευμένου'},
                         'nom': {'δεδουλευμένο', 'δουλευμένο'}, 'acc': {'δεδουλευμένο', 'δουλευμένο'}},
                'masc': {'voc': {'δουλευμένε', 'δεδουλευμένε'}, 'gen': {'δουλευμένου', 'δεδουλευμένου'},
                         'nom': {'δουλευμένος', 'δεδουλευμένος'}, 'acc': {'δεδουλευμένο', 'δουλευμένο'}}}}}

        )
