from unittest import TestCase

from modern_greek_inflexion.exceptions import NotLegalVerbException, NotInGreekException
from modern_greek_inflexion import verb

"""
to do:

przy modalnych błędnie tworzy się liczbę mnogą, niepotrzebnie imieslowy i blednie tryb rozkazujacy

πρόκυψη 
"""


class VerbTestAll(TestCase):

    def test_not_in_greek_exception(self):
        self.assertRaises(NotInGreekException, verb.create_all_forms, 'gamao')

    def test_not_legal_verb_exception(self):
        self.assertRaises(NotLegalVerbException, verb.create_all_forms, 'βλέπουμε')

    def test_verb_modal_pass_fainetai(self):
        self.assertDictEqual(
            verb.create_all_forms('φαίνεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'φαίνεται'}}}}},
             'conjunctive': {'passive': {'ind': {'sg': {'ter': {'φανεί'}}}}},
             'aorist': {'passive': {'ind': {'sg': {'ter': {'φάνηκε'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'φαινόταν'}}}}}}
        )

    def test_verb_modal_brexei(self):
        self.assertDictEqual(
            verb.create_all_forms('βρέχει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'βρέχει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'βρέξει'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'έβρεξε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'έβρεχε'}}}}}}
        )

    def test_verb_modal_pass_melletai(self):
        self.assertDictEqual(
            verb.create_all_forms('μέλλεται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'μέλλεται'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'μελλόταν'}}}}}}
        )

    def test_verb_poiw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('ποιώ'),
            {'present':
                 {'active':
                      {'ind':
                           {'sg':
                                {'pri':
                                     {'ποιώ'}, 'sec': {'ποιείς'}, 'ter': {'ποιεί'}},
                            'pl':
                                {'pri':
                                     {'ποιούμε'}, 'sec': {'ποιείτε'}, 'ter': {'ποιούν', 'ποιούνε'}}},
                       'imp':
                           {'sg':
                                {'sec': {'ποίει'}},
                            'pl':
                                {'sec': {'ποιείτε'}}}},
                  'passive':
                      {'ind':
                           {'sg':
                                {'pri': {'ποιούμαι'}, 'sec': {'ποιείσαι'}, 'ter': {'ποιείται'}},
                            'pl':
                                {'pri': {'ποιούμαστε', 'ποιούμεθα'}, 'sec': {'ποιείστε', 'ποιείσθε'},
                                 'ter': {'ποιούνται'}}},
                       'imp':
                           {'pl': {'sec': {'ποιείστε'}}}}},
             'conjunctive':
                 {'active':
                      {'ind':
                           {'sg':
                                {'pri': {'ποιήσω'}, 'sec': {'ποιήσεις'}, 'ter': {'ποιήσει'}},
                            'pl':
                                {'pri': {'ποιήσουμε'}, 'sec': {'ποιήσετε'}, 'ter': {'ποιήσουνε', 'ποιήσουν'}}},
                       'imp':
                           {'sg': {'sec': {'ποίησε'}},
                            'pl': {'sec': {'ποιήστε'}}}},
                  'passive':
                      {'ind':
                           {'sg': {'pri': {'ποιηθώ'}, 'sec': {'ποιηθείς'}, 'ter': {'ποιηθεί'}},
                            'pl': {'pri': {'ποιηθούμε'}, 'sec': {'ποιηθείτε'}, 'ter': {'ποιηθούν', 'ποιηθούνε'}}},
                       'imp': {'sg': {'sec': {'ποιήσου'}}, 'pl': {'sec': {'ποιηθείτε'}}}}},
             'aorist':
                 {'active':
                      {'ind':
                           {'sg': {'pri': {'ποίησα', 'ποιήσα'}, 'sec': {'ποίησες', 'ποιήσες'},
                                   'ter': {'ποιήσε', 'ποίησε'}},
                            'pl': {'pri': {'ποιήσαμε'}, 'sec': {'ποιήσατε'},
                                   'ter': {'ποίησαν', 'ποιήσαν', 'ποιήσανε'}}}},
                  'passive':
                      {'ind':
                           {'sg': {'pri': {'ποιήθηκα'}, 'sec': {'ποιήθηκες'}, 'ter': {'ποιήθηκε'}},
                            'pl': {'pri': {'ποιηθήκαμε'}, 'sec': {'ποιηθήκατε'}, 'ter': {'ποιηθήκανε', 'ποιήθηκαν'}}}}},
             'paratatikos':
                 {'active':
                      {'ind':
                           {'sg': {'pri': {'ποιούσα'}, 'sec': {'ποιούσες'}, 'ter': {'ποιούσε'}},
                            'pl': {'pri': {'ποιούσαμε'}, 'sec': {'ποιούσατε'}, 'ter': {'ποιούσαν', 'ποιούσανε'}}}},
                  'passive':
                      {'ind':
                           {'sg': {'pri': {'ποιόμουνα', 'ποιόμουν', 'ποιούμουν'},
                                   'sec': {'ποιούσουν', 'ποιόσουνα', 'ποιόσουν'},
                                   'ter': {'ποιούντανε', 'ποιούνταν', 'ποιείτο', 'ποιόταν', 'ποιότανε'}},
                            'pl': {'pri': {'ποιούμαστε', 'ποιόμασταν', 'ποιούμασταν', 'ποιόμαστε'},
                                   'sec': {'ποιούσαστε', 'ποιούσασταν', 'ποιόσασταν', 'ποιόσαστε'},
                                   'ter': {'ποιόντουσαν', 'ποιούντανε', 'ποιούνταν', 'ποιόνταν', 'ποιούντο'}}}}},
             'act_pres_participle': {'ποιώντας'},
             'pass_pres_participle':
                 {'pl':
                      {'masc': {'acc': {'ποιούμενους'}, 'gen': {'ποιούμενων'}, 'voc': {'ποιούμενοι'},
                                'nom': {'ποιούμενοι'}},
                       'fem': {'acc': {'ποιούμενες'}, 'gen': {'ποιούμενων'}, 'voc': {'ποιούμενες'},
                               'nom': {'ποιούμενες'}},
                       'neut': {'acc': {'ποιούμενα'}, 'gen': {'ποιούμενων'}, 'voc': {'ποιούμενα'},
                                'nom': {'ποιούμενα'}}},
                  'sg':
                      {'masc': {'acc': {'ποιούμενο'}, 'gen': {'ποιούμενου'}, 'voc': {'ποιούμενε'},
                                'nom': {'ποιούμενος'}},
                       'fem': {'acc': {'ποιούμενη'}, 'gen': {'ποιούμενης'}, 'voc': {'ποιούμενη'}, 'nom': {'ποιούμενη'}},
                       'neut': {'acc': {'ποιούμενο'}, 'gen': {'ποιούμενου'}, 'voc': {'ποιούμενο'},
                                'nom': {'ποιούμενο'}}}},
             'passive_perfect_participle':
                 {'pl':
                      {'masc': {'acc': {'ποιημένους'}, 'gen': {'ποιημένων'}, 'voc': {'ποιημένοι'},
                                'nom': {'ποιημένοι'}},
                       'fem': {'acc': {'ποιημένες'}, 'gen': {'ποιημένων'}, 'voc': {'ποιημένες'}, 'nom': {'ποιημένες'}},
                       'neut': {'acc': {'ποιημένα'}, 'gen': {'ποιημένων'}, 'voc': {'ποιημένα'}, 'nom': {'ποιημένα'}}},
                  'sg': {'masc': {'acc': {'ποιημένο'}, 'gen': {'ποιημένου'}, 'voc': {'ποιημένε'}, 'nom': {'ποιημένος'}},
                         'fem': {'acc': {'ποιημένη'}, 'gen': {'ποιημένης'}, 'voc': {'ποιημένη'}, 'nom': {'ποιημένη'}},
                         'neut': {'acc': {'ποιημένο'}, 'gen': {'ποιημένου'}, 'voc': {'ποιημένο'},
                                  'nom': {'ποιημένο'}}}}}

        )

    def test_verb_antikeimai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('αντίκειμαι'),
            {'paratatikos': {},
             'pass_pres_participle': {
                 'pl': {'fem': {'acc': {'αντικείμενες'}, 'gen': {'αντικείμενων'}, 'nom': {'αντικείμενες'}, 'voc': {
                     'αντικείμενες'}}, 'masc': {'acc': {'αντικείμενους'}, 'gen': {'αντικείμενων'}, 'nom': {
                     'αντικείμενοι'}, 'voc': {'αντικείμενοι'}}, 'neut': {'acc': {'αντικείμενα'}, 'gen': {
                     'αντικείμενων'}, 'nom': {'αντικείμενα'}, 'voc': {
                     'αντικείμενα'}}}, 'sg': {'fem': {'acc': {'αντικείμενη'}, 'gen': {
                     'αντικείμενης'}, 'nom': {
                     'αντικείμενη'}, 'voc': {
                     'αντικείμενη'}}, 'masc': {'acc': {'αντικείμενο'}, 'gen': {
                     'αντικείμενου'}, 'nom': {
                     'αντικείμενος'}, 'voc': {
                     'αντικείμενε'}}, 'neut': {
                     'acc': {'αντικείμενο'}, 'gen': {
                         'αντικείμενου'}, 'nom': {
                         'αντικείμενο'}, 'voc': {
                         'αντικείμενο'}}}}, 'present':
                 {'passive': {'imp': {'pl': {'sec': {'αντίκεισθε'}}, 'sg': {'sec': {'αντίκεισο'}}},
                              'ind': {'pl': {'pri': {'αντικείμεθα'}, 'sec': {
                                  'αντίκειστε'}, 'ter': {
                                  'αντίκεινται'}}, 'sg': {
                                  'pri': {'αντίκειμαι'}, 'sec': {
                                      'αντίκεισαι'}, 'ter': {
                                      'αντίκειται'}}}}}}

        )

    def test_verb_erxomai(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('έρχομαι'),
            {'present':
                {'passive':
                    {'ind': {
                        'sg':
                            {'pri': {'έρχομαι'}, 'sec': {'έρχεσαι'}, 'ter': {'έρχεται'}},
                        'pl': {'pri': {'ερχόμαστε'}, 'sec': {'έρχεστε', 'ερχόσαστε'},
                               'ter': {'έρχονται'}}},
                        'imp': {'pl': {'sec': {'έρχεστε'}}}}},
                'conjunctive': {
                    'active': {
                        'ind': {
                            'sg': {'pri': {'έρθω', 'έλθω'},
                                   'sec': {'έρθεις', 'έλθεις'},
                                   'ter': {'έλθει', 'έρθει'}},
                            'pl': {'pri': {'έρθουμε', 'έλθουμε'},
                                   'sec': {'έρθετε', 'έλθετε'},
                                   'ter': {'έρθουνε', 'έρθουν', 'έλθουν', 'έλθουνε'}}},
                        'imp': {'sg': {'sec': {'έλα'}},
                                'pl': {'sec': {'έλθετε', 'έρθετε', 'ελάτε'}}}}},
                'aorist': {
                    'active': {
                        'ind': {'sg': {'pri': {'ήρθα', 'ήλθα'}, 'sec': {'ήλθες', 'ήρθες'}, 'ter': {'ήλθε', 'ήρθε'}},
                                'pl': {'pri': {'ήλθαμε', 'ήρθαμε'}, 'sec': {'ήλθατε', 'ήρθατε'},
                                       'ter': {'ήρθανε', 'ήρθαν', 'ήλθαν', 'ήλθανε'}}}}},
                'paratatikos': {
                    'passive': {
                        'ind': {
                            'sg': {'pri': {'ερχόμουνα', 'ερχόμουν'}, 'sec': {'ερχόσουνα', 'ερχόσουν'},
                                   'ter': {'ερχότανε', 'ερχόταν'}},
                            'pl': {'pri': {'ερχόμασταν', 'ερχόμαστε'}, 'sec': {'ερχόσαστε', 'ερχόσασταν'},
                                   'ter': {'ερχόντουσαν', 'έρχονταν'}}}}},
                'pass_pres_participle': {
                    'sg': {
                        'masc': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενε'}, 'nom': {'ερχόμενος'}, 'acc': {'ερχόμενο'}},
                        'fem': {'gen': {'ερχόμενης'}, 'voc': {'ερχόμενη'}, 'nom': {'ερχόμενη'}, 'acc': {'ερχόμενη'}},
                        'neut': {'gen': {'ερχόμενου'}, 'voc': {'ερχόμενο'}, 'nom': {'ερχόμενο'}, 'acc': {'ερχόμενο'}}},
                    'pl': {'masc': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενοι'}, 'nom': {'ερχόμενοι'},
                                    'acc': {'ερχόμενους'}},
                           'fem': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενες'}, 'nom': {'ερχόμενες'},
                                   'acc': {'ερχόμενες'}},
                           'neut': {'gen': {'ερχόμενων'}, 'voc': {'ερχόμενα'}, 'nom': {'ερχόμενα'},
                                    'acc': {'ερχόμενα'}}}}}
        )

    def test_verb_tragoudo(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('τραγουδώ'),
            {'present':
                {'active':
                    {'ind': {
                        'sg':
                            {'pri':
                                 {'τραγουδώ', 'τραγουδάω'}, 'sec': {'τραγουδάς'}, 'ter': {'τραγουδά', 'τραγουδάει'}},
                        'pl': {'pri': {'τραγουδάμε', 'τραγουδούμε'}, 'sec': {'τραγουδάτε'},
                               'ter': {'τραγουδάν', 'τραγουδούνε', 'τραγουδούν', 'τραγουδάνε'}}},
                        'imp': {'sg': {'sec': {'τραγούδα', 'τραγούδαγε'}}, 'pl': {'sec': {'τραγουδάτε'}}}},
                    'passive': {
                        'ind': {'sg': {'pri': {'τραγουδιέμαι'}, 'sec': {'τραγουδιέσαι'}, 'ter': {'τραγουδιέται'}},
                                'pl': {'pri': {'τραγουδιούμαστε', 'τραγουδιόμαστε'},
                                       'sec': {'τραγουδιόσαστε', 'τραγουδιέστε'},
                                       'ter': {'τραγουδιόνται', 'τραγουδιούνται'}}},
                        'imp': {'pl': {'sec': {'τραγουδιέστε'}}}}},
                'conjunctive': {'active': {
                    'ind': {'sg': {'pri': {'τραγουδήσω'}, 'sec': {'τραγουδήσεις'}, 'ter': {'τραγουδήσει'}},
                            'pl': {'pri': {'τραγουδήσουμε'}, 'sec': {'τραγουδήσετε'},
                                   'ter': {'τραγουδήσουν', 'τραγουδήσουνε'}}},
                    'imp': {'sg': {'sec': {'τραγούδησε'}}, 'pl': {'sec': {'τραγουδήστε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'τραγουδηθώ'}, 'sec': {'τραγουδηθείς'}, 'ter': {'τραγουδηθεί'}},
                            'pl': {'pri': {'τραγουδηθούμε'}, 'sec': {'τραγουδηθείτε'},
                                   'ter': {'τραγουδηθούν', 'τραγουδηθούνε'}}},
                    'imp': {'sg': {'sec': {'τραγουδήσου'}}, 'pl': {'sec': {'τραγουδηθείτε'}}}}},
                'aorist': {'active': {
                    'ind': {'sg': {'pri': {'τραγούδησα'}, 'sec': {'τραγούδησες'}, 'ter': {'τραγούδησε'}},
                            'pl': {'pri': {'τραγουδήσαμε'}, 'sec': {'τραγουδήσατε'},
                                   'ter': {'τραγούδησαν', 'τραγουδήσανε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'τραγουδήθηκα'}, 'sec': {'τραγουδήθηκες'}, 'ter': {'τραγουδήθηκε'}},
                            'pl': {'pri': {'τραγουδηθήκαμε'}, 'sec': {'τραγουδηθήκατε'},
                                   'ter': {'τραγουδηθήκανε', 'τραγουδήθηκαν'}}}}},
                'paratatikos':
                    {'active':
                        {'ind':
                            {
                                'sg': {'pri': {'τραγουδούσα', 'τραγούδαγα'}, 'sec': {'τραγούδαγες', 'τραγουδούσες'},
                                       'ter': {'τραγουδούσε', 'τραγούδαγε'}},
                                'pl': {'pri': {'τραγουδούσαμε', 'τραγουδάγαμε'},
                                       'sec': {'τραγουδάγατε', 'τραγουδούσατε'},
                                       'ter': {'τραγουδούσανε', 'τραγούδαγαν', 'τραγουδούσαν', 'τραγουδάγανε'}}}},
                        'passive': {'ind': {
                            'sg': {'pri': {'τραγουδιόμουν', 'τραγουδιόμουνα'},
                                   'sec': {'τραγουδιόσουνα', 'τραγουδιόσουν'},
                                   'ter': {'τραγουδιότανε', 'τραγουδιόταν'}},
                            'pl': {'pri': {'τραγουδιόμασταν', 'τραγουδιόμαστε'},
                                   'sec': {'τραγουδιόσασταν', 'τραγουδιόσαστε'},
                                   'ter': {'τραγουδιούνταν', 'τραγουδιόνταν', 'τραγουδιόντουσαν'}}}}},
                'act_pres_participle': {'τραγουδώντας'},
                'passive_perfect_participle': {'pl': {
                    'neut': {'gen': {'τραγουδημένων'}, 'acc': {'τραγουδημένα'}, 'voc': {'τραγουδημένα'},
                             'nom': {'τραγουδημένα'}},
                    'fem': {'gen': {'τραγουδημένων'}, 'acc': {'τραγουδημένες'}, 'voc': {'τραγουδημένες'},
                            'nom': {'τραγουδημένες'}},
                    'masc': {'gen': {'τραγουδημένων'}, 'acc': {'τραγουδημένους'}, 'voc': {'τραγουδημένοι'},
                             'nom': {'τραγουδημένοι'}}}, 'sg': {
                    'neut': {'gen': {'τραγουδημένου'}, 'acc': {'τραγουδημένο'}, 'voc': {'τραγουδημένο'},
                             'nom': {'τραγουδημένο'}},
                    'fem': {'gen': {'τραγουδημένης'}, 'acc': {'τραγουδημένη'}, 'voc': {'τραγουδημένη'},
                            'nom': {'τραγουδημένη'}},
                    'masc': {'gen': {'τραγουδημένου'}, 'acc': {'τραγουδημένο'}, 'voc': {'τραγουδημένε'},
                             'nom': {'τραγουδημένος'}}}}}
        )

    def test_verb_kybernw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('κυβερνώ'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'κυβερνώ', 'κυβερνάω'}, 'sec': {'κυβερνάς'}, 'ter': {'κυβερνάει', 'κυβερνά'}},
                        'pl': {'pri': {'κυβερνούμε', 'κυβερνάμε'}, 'sec': {'κυβερνάτε'},
                               'ter': {'κυβερνάν', 'κυβερνούν', 'κυβερνάνε', 'κυβερνούνε'}}},
                'imp': {'sg': {'sec': {'κυβέρναγε', 'κυβέρνα'}}, 'pl': {'sec': {'κυβερνάτε'}}}}, 'passive': {'ind': {
                'sg': {'pri': {'κυβερνώμαι', 'κυβερνούμαι', 'κυβερνιέμαι'},
                       'sec': {'κυβερνείσαι', 'κυβερνιέσαι', 'κυβερνάσαι'},
                       'ter': {'κυβερνείται', 'κυβερνάται', 'κυβερνιέται'}},
                'pl': {'pri': {'κυβερνούμεθα', 'κυβερνούμαστε', 'κυβερνόμαστε', 'κυβερνιόμαστε', 'κυβερνιούμαστε'},
                       'sec': {'κυβερνείσθε', 'κυβερνιόσαστε', 'κυβερνάστε', 'κυβερνιέστε', 'κυβερνείστε'},
                       'ter': {'κυβερνώνται', 'κυβερνιούνται', 'κυβερνούνται', 'κυβερνιόνται'}}},
                'imp': {
                    'pl': {'sec': {'κυβερνάστε', 'κυβερνείστε', 'κυβερνιέστε'}}}}},
                'conjunctive': {'active': {
                    'ind': {'sg': {'pri': {'κυβερνήσω'}, 'sec': {'κυβερνήσεις'}, 'ter': {'κυβερνήσει'}},
                            'pl': {'pri': {'κυβερνήσουμε'}, 'sec': {'κυβερνήσετε'},
                                   'ter': {'κυβερνήσουνε', 'κυβερνήσουν'}}},
                    'imp': {'sg': {'sec': {'κυβέρνησε'}}, 'pl': {'sec': {'κυβερνήστε'}}}}, 'passive': {
                    'ind': {'sg': {'pri': {'κυβερνηθώ'}, 'sec': {'κυβερνηθείς'}, 'ter': {'κυβερνηθεί'}},
                            'pl': {'pri': {'κυβερνηθούμε'}, 'sec': {'κυβερνηθείτε'},
                                   'ter': {'κυβερνηθούνε', 'κυβερνηθούν'}}},
                    'imp': {'sg': {'sec': {'κυβερνήσου'}}, 'pl': {'sec': {'κυβερνηθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'κυβέρνησα'}, 'sec': {'κυβέρνησες'}, 'ter': {'κυβέρνησε'}},
                        'pl': {'pri': {'κυβερνήσαμε'}, 'sec': {'κυβερνήσατε'}, 'ter': {'κυβέρνησαν', 'κυβερνήσανε'}}}},
                'passive': {
                    'ind': {
                        'sg': {
                            'pri': {
                                'κυβερνήθηκα'},
                            'sec': {
                                'κυβερνήθηκες'},
                            'ter': {
                                'κυβερνήθηκε'}},
                        'pl': {
                            'pri': {
                                'κυβερνηθήκαμε'},
                            'sec': {
                                'κυβερνηθήκατε'},
                            'ter': {
                                'κυβερνηθήκανε',
                                'κυβερνήθηκαν'}}}}},
                'paratatikos': {'active': {'ind': {
                    'sg': {'pri': {'κυβερνούσα', 'κυβέρναγα'}, 'sec': {'κυβερνούσες', 'κυβέρναγες'},
                           'ter': {'κυβέρναγε', 'κυβερνούσε'}},
                    'pl': {'pri': {'κυβερνούσαμε', 'κυβερνάγαμε'}, 'sec': {'κυβερνούσατε', 'κυβερνάγατε'},
                           'ter': {'κυβερνούσαν', 'κυβερνάγανε', 'κυβερνούσανε', 'κυβέρναγαν'}}}}, 'passive': {'ind': {
                    'sg': {'pri': {'κυβερνιόμουνα', 'κυβερνιόμουν'}, 'sec': {'κυβερνιόσουν', 'κυβερνιόσουνα'},
                           'ter': {'κυβερνιότανε', 'κυβερνιόταν'}},
                    'pl': {'pri': {'κυβερνιόμαστε', 'κυβερνιόμασταν'}, 'sec': {'κυβερνιόσασταν', 'κυβερνιόσαστε'},
                           'ter': {'κυβερνιούνταν', 'κυβερνιόνταν', 'κυβερνιόντουσαν'}}}}},
                'act_pres_participle': {'κυβερνώντας'}, 'arch_act_pres_participle': {
                'sg': {'fem': {'acc': {'κυβερνώσα'}, 'gen': {'κυβερνώσας'}, 'voc': {'κυβερνώσα'}, 'nom': {'κυβερνώσα'}},
                       'neut': {'acc': {'κυβερνών'}, 'gen': {'κυβερνώντος'}, 'voc': {'κυβερνών'}, 'nom': {'κυβερνών'}},
                       'masc': {'acc': {'κυβερνώντα'}, 'gen': {'κυβερνώντος'}, 'voc': {'κυβερνών'},
                                'nom': {'κυβερνών'}}}, 'pl': {
                    'fem': {'acc': {'κυβερνώσες'}, 'gen': {'κυβερνωσών'}, 'voc': {'κυβερνώσες'}, 'nom': {'κυβερνώσες'}},
                    'neut': {'acc': {'κυβερνώντα'}, 'gen': {'κυβερνώντων'}, 'voc': {'κυβερνώντα'},
                             'nom': {'κυβερνώντα'}},
                    'masc': {'acc': {'κυβερνώντες'}, 'gen': {'κυβερνώντων'}, 'voc': {'κυβερνώντες'},
                             'nom': {'κυβερνώντες'}}}}, 'pass_pres_participle': {'sg': {
                'fem': {'acc': {'κυβερνούμενη', 'κυβερνώμενη'}, 'gen': {'κυβερνώμενης', 'κυβερνούμενης'},
                        'voc': {'κυβερνούμενη', 'κυβερνώμενη'}, 'nom': {'κυβερνούμενη', 'κυβερνώμενη'}},
                'neut': {'acc': {'κυβερνούμενο', 'κυβερνώμενο'}, 'gen': {'κυβερνούμενου', 'κυβερνώμενου'},
                         'voc': {'κυβερνούμενο', 'κυβερνώμενο'}, 'nom': {'κυβερνούμενο', 'κυβερνώμενο'}},
                'masc': {'acc': {'κυβερνούμενο', 'κυβερνώμενο'}, 'gen': {'κυβερνούμενου', 'κυβερνώμενου'},
                         'voc': {'κυβερνώμενε', 'κυβερνούμενε'}, 'nom': {'κυβερνούμενος', 'κυβερνώμενος'}}}, 'pl': {
                'fem': {'acc': {'κυβερνώμενες', 'κυβερνούμενες'}, 'gen': {'κυβερνώμενων', 'κυβερνούμενων'},
                        'voc': {'κυβερνώμενες', 'κυβερνούμενες'}, 'nom': {'κυβερνώμενες', 'κυβερνούμενες'}},
                'neut': {'acc': {'κυβερνούμενα', 'κυβερνώμενα'}, 'gen': {'κυβερνώμενων', 'κυβερνούμενων'},
                         'voc': {'κυβερνούμενα', 'κυβερνώμενα'}, 'nom': {'κυβερνούμενα', 'κυβερνώμενα'}},
                'masc': {'acc': {'κυβερνώμενους', 'κυβερνούμενους'}, 'gen': {'κυβερνώμενων', 'κυβερνούμενων'},
                         'voc': {'κυβερνούμενοι', 'κυβερνώμενοι'}, 'nom': {'κυβερνούμενοι', 'κυβερνώμενοι'}}}},
                'passive_perfect_participle': {'sg': {
                    'fem': {'acc': {'κυβερνημένη'}, 'gen': {'κυβερνημένης'}, 'voc': {'κυβερνημένη'},
                            'nom': {'κυβερνημένη'}},
                    'neut': {'acc': {'κυβερνημένο'}, 'gen': {'κυβερνημένου'}, 'voc': {'κυβερνημένο'},
                             'nom': {'κυβερνημένο'}},
                    'masc': {'acc': {'κυβερνημένο'}, 'gen': {'κυβερνημένου'}, 'voc': {'κυβερνημένε'},
                             'nom': {'κυβερνημένος'}}}, 'pl': {
                    'fem': {'acc': {'κυβερνημένες'}, 'gen': {'κυβερνημένων'}, 'voc': {'κυβερνημένες'},
                            'nom': {'κυβερνημένες'}},
                    'neut': {'acc': {'κυβερνημένα'}, 'gen': {'κυβερνημένων'}, 'voc': {'κυβερνημένα'},
                             'nom': {'κυβερνημένα'}},
                    'masc': {'acc': {'κυβερνημένους'}, 'gen': {'κυβερνημένων'}, 'voc': {'κυβερνημένοι'},
                             'nom': {'κυβερνημένοι'}}}}}
        )

    def test_verb_blepo(self):
        self.assertDictEqual(
            verb.create_all_forms('βλέπω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'βλέπω'}, 'sec': {'βλέπεις'}, 'ter': {'βλέπει'}},
                                            'pl': {'pri': {'βλέπουμε'}, 'sec': {'βλέπετε'},
                                                   'ter': {'βλέπουνε', 'βλέπουν'}}},
                                    'imp': {'sg': {'sec': {'βλέπε'}}, 'pl': {'sec': {'βλέπετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'βλέπομαι'}, 'sec': {'βλέπεσαι'}, 'ter': {'βλέπεται'}},
                        'pl': {'pri': {'βλεπόμαστε'}, 'sec': {'βλέπεστε', 'βλεπόσαστε'}, 'ter': {'βλέπονται'}}},
                'imp': {'pl': {'sec': {'βλέπεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'δω'}, 'sec': {'δεις'}, 'ter': {'δει'}},
                        'pl': {'pri': {'δούμε'}, 'sec': {'δείτε'}, 'ter': {'δουν', 'δούνε'}}},
                'imp': {'sg': {'sec': {'δες'}}, 'pl': {'sec': {'δέστε', 'δείτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ιδωθώ'}, 'sec': {'ιδωθείς'}, 'ter': {'ιδωθεί'}},
                        'pl': {'pri': {'ιδωθούμε'}, 'sec': {'ιδωθείτε'}, 'ter': {'ιδωθούνε', 'ιδωθούν'}}},
                'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'ιδωθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'είδα'}, 'sec': {'είδες'}, 'ter': {'είδε'}},
                        'pl': {'pri': {'είδαμε'}, 'sec': {'είδατε'}, 'ter': {'είδανε', 'είδαν'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'ειδώθηκα'}, 'sec': {'ειδώθηκες'}, 'ter': {'ειδώθηκε'}},
                        'pl': {'pri': {'ειδωθήκαμε'}, 'sec': {'ειδωθήκατε'}, 'ter': {'ειδωθήκανε', 'ειδώθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έβλεπα'}, 'sec': {'έβλεπες'}, 'ter': {'έβλεπε'}},
                                                'pl': {'pri': {'βλέπαμε'}, 'sec': {'βλέπατε'},
                                                       'ter': {'έβλεπαν', 'βλέπανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'βλεπόμουνα', 'βλεπόμουν'}, 'sec': {'βλεπόσουν', 'βλεπόσουνα'},
                        'ter': {'βλεπόταν', 'βλεπότανε'}},
                 'pl': {'pri': {'βλεπόμαστε', 'βλεπόμασταν'}, 'sec': {'βλεπόσασταν', 'βλεπόσαστε'},
                        'ter': {'βλέπονταν', 'βλεπόντουσαν'}}}}}, 'act_pres_participle': {'βλέποντας'},
             'arch_act_pres_participle': {
                 'sg': {'masc': {'gen': {'βλέποντος'}, 'acc': {'βλέποντα'}, 'voc': {'βλέπων'}, 'nom': {'βλέπων'}},
                        'neut': {'gen': {'βλέποντος'}, 'acc': {'βλέπον'}, 'voc': {'βλέπον'}, 'nom': {'βλέπον'}},
                        'fem': {'gen': {'βλέπουσας'}, 'acc': {'βλέπουσα'}, 'voc': {'βλέπουσα'}, 'nom': {'βλέπουσα'}}},
                 'pl': {
                     'masc': {'gen': {'βλεπόντων'}, 'acc': {'βλέποντες'}, 'voc': {'βλέποντες'}, 'nom': {'βλέποντες'}},
                     'neut': {'gen': {'βλεπόντων'}, 'acc': {'βλέποντα'}, 'voc': {'βλέποντα'}, 'nom': {'βλέποντα'}},
                     'fem': {'gen': {'βλεπουσών'}, 'acc': {'βλέπουσες'}, 'voc': {'βλέπουσες'}, 'nom': {'βλέπουσες'}}}},
             'passive_perfect_participle': {
                 'sg': {'masc': {'gen': {'ιδωμένου'}, 'acc': {'ιδωμένο'}, 'voc': {'ιδωμένε'}, 'nom': {'ιδωμένος'}},
                        'neut': {'gen': {'ιδωμένου'}, 'acc': {'ιδωμένο'}, 'voc': {'ιδωμένο'}, 'nom': {'ιδωμένο'}},
                        'fem': {'gen': {'ιδωμένης'}, 'acc': {'ιδωμένη'}, 'voc': {'ιδωμένη'}, 'nom': {'ιδωμένη'}}},
                 'pl': {'masc': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένους'}, 'voc': {'ιδωμένοι'}, 'nom': {'ιδωμένοι'}},
                        'neut': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένα'}, 'voc': {'ιδωμένα'}, 'nom': {'ιδωμένα'}},
                        'fem': {'gen': {'ιδωμένων'}, 'acc': {'ιδωμένες'}, 'voc': {'ιδωμένες'}, 'nom': {'ιδωμένες'}}}}}
        )

    def test_verb_syllambanw(self):
        self.assertDictEqual(
            verb.create_all_forms('συλλαμβάνω'),
            {'present': {'active': {
                'ind': {'sg': {'pri': {'συλλαμβάνω'}, 'sec': {'συλλαμβάνεις'}, 'ter': {'συλλαμβάνει'}},
                        'pl': {'pri': {'συλλαμβάνουμε'}, 'sec': {'συλλαμβάνετε'},
                               'ter': {'συλλαμβάνουνε', 'συλλαμβάνουν'}}},
                'imp': {'sg': {'sec': {'συλλάμβανε'}}, 'pl': {'sec': {'συλλαμβάνετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'συλλαμβάνομαι'}, 'sec': {'συλλαμβάνεσαι'}, 'ter': {'συλλαμβάνεται'}},
                        'pl': {'pri': {'συλλαμβανόμαστε'}, 'sec': {'συλλαμβάνεστε', 'συλλαμβανόσαστε'},
                               'ter': {'συλλαμβάνονται'}}}, 'imp': {'pl': {'sec': {'συλλαμβάνεστε'}}}}},
                'conjunctive': {
                    'active': {'ind': {'sg': {'pri': {'συλλάβω'}, 'sec': {'συλλάβεις'}, 'ter': {'συλλάβει'}},
                                       'pl': {'pri': {'συλλάβουμε'}, 'sec': {'συλλάβετε'},
                                              'ter': {'συλλάβουν', 'συλλάβουνε'}}},
                               'imp': {'sg': {'sec': {'σύλλαβε'}}, 'pl': {'sec': {'συλλάβετε'}}}}, 'passive': {
                        'ind': {'sg': {'pri': {'συλληφθώ'}, 'sec': {'συλληφθείς'}, 'ter': {'συλληφθεί'}},
                                'pl': {'pri': {'συλληφθούμε'}, 'sec': {'συλληφθείτε'},
                                       'ter': {'συλληφθούνε', 'συλληφθούν'}}},
                        'imp': {'sg': {'sec': {''}}, 'pl': {'sec': {'συλληφθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'συνέλαβα'}, 'sec': {'συνέλαβες'}, 'ter': {'συνέλαβε'}},
                        'pl': {'pri': {'συνελάβαμε'}, 'sec': {'συνελάβατε'}, 'ter': {'συνέλαβαν', 'συνελάβανε'}}}},
                'passive': {'ind': {'sg': {
                    'pri': {'συνελήφθην'},
                    'sec': {'συνελήφθης'},
                    'ter': {'συνελήφθη'}},
                    'pl': {
                        'pri': {
                            'συνελήφθημεν'},
                        'sec': {
                            'συνελήφθητε'},
                        'ter': {
                            'συνελήφθησαν'}}}}},
                'paratatikos': {'active': {'ind': {
                    'sg': {'pri': {'συλλάμβανα', 'συνελάμβανα'}, 'sec': {'συνελάμβανες', 'συλλάμβανες'},
                           'ter': {'συνελάμβανε', 'συλλάμβανε'}},
                    'pl': {'pri': {'συλλαμβάναμε', 'συνελαμβάναμε'}, 'sec': {'συνελαμβάνατε', 'συλλαμβάνατε'},
                           'ter': {'συνελαμβάνανε', 'συλλαμβάνανε', 'συλλάμβαναν', 'συνελάμβαναν'}}}},
                    'passive': {'ind': {
                        'sg': {'pri': {'συλλαμβανόμουνα', 'συλλαμβανόμουν'},
                               'sec': {'συλλαμβανόσουν', 'συλλαμβανόσουνα'},
                               'ter': {'συλλαμβανότανε', 'συλλαμβανόταν'}},
                        'pl': {'pri': {'συλλαμβανόμαστε', 'συλλαμβανόμασταν'},
                               'sec': {'συλλαμβανόσασταν', 'συλλαμβανόσαστε'},
                               'ter': {'συλλαμβάνονταν', 'συλλαμβανόντουσαν'}}}}},
                'act_pres_participle': {'συλλαμβάνοντας'},
                'passive_aorist_participle': {'sg': {
                    'masc': {'nom': {'συλληφθείς'}, 'voc': {'συλληφθείς'}, 'acc': {'συλληφθέντα'},
                             'gen': {'συλληφθέντος'}},
                    'neut': {'nom': {'συλληφθέν'}, 'voc': {'συλληφθέν'}, 'acc': {'συλληφθέν'}, 'gen': {'συλληφθέντος'}},
                    'fem': {'nom': {'συλληφθείσα'}, 'voc': {'συλληφθείσα'}, 'acc': {'συλληφθείσα'},
                            'gen': {'συλληφθείσας'}}}, 'pl': {
                    'masc': {'nom': {'συλληφθέντες'}, 'voc': {'συλληφθέντες'}, 'acc': {'συλληφθέντες'},
                             'gen': {'συλληφθέντων'}},
                    'neut': {'nom': {'συλληφθέντα'}, 'voc': {'συλληφθέντα'}, 'acc': {'συλληφθέντα'},
                             'gen': {'συλληφθέντων'}},
                    'fem': {'nom': {'συλληφθείσες'}, 'voc': {'συλληφθείσες'}, 'acc': {'συλληφθείσες'},
                            'gen': {'συλληφθεισών'}}}}, 'pass_pres_participle': {'sg': {
                'masc': {'nom': {'συλλαμβανόμενος'}, 'voc': {'συλλαμβανόμενε'}, 'acc': {'συλλαμβανόμενο'},
                         'gen': {'συλλαμβανόμενου'}},
                'neut': {'nom': {'συλλαμβανόμενο'}, 'voc': {'συλλαμβανόμενο'}, 'acc': {'συλλαμβανόμενο'},
                         'gen': {'συλλαμβανόμενου'}},
                'fem': {'nom': {'συλλαμβανόμενη'}, 'voc': {'συλλαμβανόμενη'}, 'acc': {'συλλαμβανόμενη'},
                        'gen': {'συλλαμβανόμενης'}}}, 'pl': {
                'masc': {'nom': {'συλλαμβανόμενοι'}, 'voc': {'συλλαμβανόμενοι'}, 'acc': {'συλλαμβανόμενους'},
                         'gen': {'συλλαμβανόμενων'}},
                'neut': {'nom': {'συλλαμβανόμενα'}, 'voc': {'συλλαμβανόμενα'}, 'acc': {'συλλαμβανόμενα'},
                         'gen': {'συλλαμβανόμενων'}},
                'fem': {'nom': {'συλλαμβανόμενες'}, 'voc': {'συλλαμβανόμενες'}, 'acc': {'συλλαμβανόμενες'},
                        'gen': {'συλλαμβανόμενων'}}}}}
        )

    def test_verb_phgainw(self):
        self.assertDictEqual(
            verb.create_all_forms('πηγαίνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'πηγαίνω'}, 'sec': {'πηγαίνεις'}, 'ter': {'πηγαίνει'}},
                                            'pl': {'pri': {'πηγαίνουμε'}, 'sec': {'πηγαίνετε'},
                                                   'ter': {'πηγαίνουνε', 'πηγαίνουν'}}},
                                    'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'πάω'}, 'sec': {'πας'}, 'ter': {'πάει'}},
                                                'pl': {'pri': {'πάμε'}, 'sec': {'πάτε'}, 'ter': {'παν', 'πάνε'}}},
                                        'imp': {'sg': {'sec': {'πήγαινε'}}, 'pl': {'sec': {'πηγαίνετε'}}}}}, 'aorist': {
                'active': {'ind': {'sg': {'pri': {'πήγα'}, 'sec': {'πήγες'}, 'ter': {'πήγε'}},
                                   'pl': {'pri': {'πήγαμε'}, 'sec': {'πήγατε'}, 'ter': {'πήγαν', 'πήγανε'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πήγαινα'}, 'sec': {'πήγαινες'}, 'ter': {'πήγαινε'}},
                                                'pl': {'pri': {'πηγαίναμε'}, 'sec': {'πηγαίνατε'},
                                                       'ter': {'πηγαίνανε', 'πήγαιναν'}}}}},
             'act_pres_participle': {'πηγαίνοντας'}}
        )

    def test_verb_prokeitai(self):
        self.assertDictEqual(
            verb.create_all_forms('πρόκειται'),
            {'present': {'passive': {'ind': {'sg': {'ter': {'πρόκειται'}}}}},
             'paratatikos': {'passive': {'ind': {'sg': {'ter': {'επρόκειτο'}}}}}}
        )

    def test_verb_symbainei(self):
        self.assertDictEqual(
            verb.create_all_forms('συμβαίνει'),
            {'present': {'active': {'ind': {'sg': {'ter': {'συμβαίνει'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'ter': {'συμβεί'}}}}},
             'aorist': {'active': {'ind': {'sg': {'ter': {'συνέβη'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'ter': {'συνέβαινε'}}}}}}
        )

    def test_verb_parkaro(self):
        self.assertDictEqual(
            verb.create_all_forms('παρκάρω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παρκάρω'}, 'sec': {'παρκάρεις'}, 'ter': {'παρκάρει'}},
                                            'pl': {'pri': {'παρκάρουμε'}, 'sec': {'παρκάρετε'},
                                                   'ter': {'παρκάρουν', 'παρκάρουνε'}}},
                                    'imp': {'sg': {'sec': {'πάρκαρε'}}, 'pl': {'sec': {'παρκάρετε'}}}},
                         'passive': {
                             'ind': {'sg': {'pri': {'παρκάρομαι'}, 'sec': {'παρκάρεσαι'}, 'ter': {'παρκάρεται'}},
                                     'pl': {'pri': {'παρκαρόμαστε'}, 'sec': {'παρκάρεστε', 'παρκαρόσαστε'},
                                            'ter': {'παρκάρονται'}}},
                             'imp': {'pl': {'sec': {'παρκάρεστε'}}}}},
             'conjunctive': {'active': {'ind': {'sg': {'pri': {'παρκάρω'}, 'sec': {'παρκάρεις'}, 'ter': {'παρκάρει'}},
                                                'pl': {'pri': {'παρκάρουμε'}, 'sec': {'παρκάρετε'},
                                                       'ter': {'παρκάρουν', 'παρκάρουνε'}}},
                                        'imp': {'sg': {'sec': {'πάρκαρε'}}, 'pl': {'sec': {'παρκάρτε'}}}}},
             'aorist': {'active': {'ind': {'sg': {'pri': {'πάρκαρα'}, 'sec': {'πάρκαρες'}, 'ter': {'πάρκαρε'}},
                                           'pl': {'pri': {'παρκάραμε'}, 'sec': {'παρκάρατε'},
                                                  'ter': {'παρκάρανε', 'πάρκαραν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'πάρκαρα'}, 'sec': {'πάρκαρες'}, 'ter': {'πάρκαρε'}},
                                                'pl': {'pri': {'παρκάραμε'}, 'sec': {'παρκάρατε'},
                                                       'ter': {'παρκάρανε', 'πάρκαραν'}}}},
                             'passive': {'ind': {
                                 'sg': {'pri': {'παρκαρόμουνα', 'παρκαρόμουν'}, 'sec': {'παρκαρόσουν', 'παρκαρόσουνα'},
                                        'ter': {'παρκαρόταν', 'παρκαρότανε'}},
                                 'pl': {'pri': {'παρκαρόμαστε', 'παρκαρόμασταν'},
                                        'sec': {'παρκαρόσασταν', 'παρκαρόσαστε'},
                                        'ter': {'παρκάρονταν', 'παρκαρόντουσαν'}}}}},
             'act_pres_participle': {'παρκάροντας'}}

        )

    def test_verb_pairnw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('παίρνω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παίρνω'}, 'sec': {'παίρνεις'}, 'ter': {'παίρνει'}},
                                            'pl': {'pri': {'παίρνουμε'}, 'sec': {'παίρνετε'},
                                                   'ter': {'παίρνουνε', 'παίρνουν'}}},
                                    'imp': {'sg': {'sec': {'παίρνε'}}, 'pl': {'sec': {'παίρνετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παίρνομαι'}, 'sec': {'παίρνεσαι'}, 'ter': {'παίρνεται'}},
                        'pl': {'pri': {'παιρνόμαστε'}, 'sec': {'παίρνεστε', 'παιρνόσαστε'}, 'ter': {'παίρνονται'}}},
                'imp': {'pl': {'sec': {'παίρνεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'πάρω'}, 'sec': {'πάρεις'}, 'ter': {'πάρει'}},
                        'pl': {'pri': {'πάρουμε'}, 'sec': {'πάρετε'}, 'ter': {'πάρουνε', 'πάρουν'}}},
                'imp': {'sg': {'sec': {'πάρε'}}, 'pl': {'sec': {'πάρτε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'παρθώ'}, 'sec': {'παρθείς'}, 'ter': {'παρθεί'}},
                        'pl': {'pri': {'παρθούμε'}, 'sec': {'παρθείτε'}, 'ter': {'παρθούνε', 'παρθούν'}}},
                'imp': {'sg': {'sec': {'πάρσου'}}, 'pl': {'sec': {'παρθείτε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'πήρα'}, 'sec': {'πήρες'}, 'ter': {'πήρε'}},
                        'pl': {'pri': {'πήραμε'}, 'sec': {'πήρατε'}, 'ter': {'πήραν', 'πήρανε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'πάρθηκα'}, 'sec': {'πάρθηκες'}, 'ter': {'πάρθηκε'}},
                        'pl': {'pri': {'παρθήκαμε'}, 'sec': {'παρθήκατε'}, 'ter': {'παρθήκανε', 'πάρθηκαν'}}}}},
             'paratatikos': {'active': {'ind': {'sg': {'pri': {'έπαιρνα'}, 'sec': {'έπαιρνες'}, 'ter': {'έπαιρνε'}},
                                                'pl': {'pri': {'παίρναμε'}, 'sec': {'παίρνατε'},
                                                       'ter': {'έπαιρναν', 'παίρνανε'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'παιρνόμουνα', 'παιρνόμουν'}, 'sec': {'παιρνόσουνα', 'παιρνόσουν'},
                        'ter': {'παιρνότανε', 'παιρνόταν'}},
                 'pl': {'pri': {'παιρνόμαστε', 'παιρνόμασταν'}, 'sec': {'παιρνόσασταν', 'παιρνόσαστε'},
                        'ter': {'παίρνονταν', 'παιρνόντουσαν'}}}}}, 'act_pres_participle': {'παίρνοντας'},
             'passive_perfect_participle': {
                 'sg': {'fem': {'gen': {'παρμένης'}, 'acc': {'παρμένη'}, 'voc': {'παρμένη'}, 'nom': {'παρμένη'}},
                        'masc': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένε'}, 'nom': {'παρμένος'}},
                        'neut': {'gen': {'παρμένου'}, 'acc': {'παρμένο'}, 'voc': {'παρμένο'}, 'nom': {'παρμένο'}}},
                 'pl': {'fem': {'gen': {'παρμένων'}, 'acc': {'παρμένες'}, 'voc': {'παρμένες'}, 'nom': {'παρμένες'}},
                        'masc': {'gen': {'παρμένων'}, 'acc': {'παρμένους'}, 'voc': {'παρμένοι'}, 'nom': {'παρμένοι'}},
                        'neut': {'gen': {'παρμένων'}, 'acc': {'παρμένα'}, 'voc': {'παρμένα'}, 'nom': {'παρμένα'}}}}}

        )

    def test_verb_epitithemai(self):
        self.assertDictEqual(
            verb.create_all_forms('επιτίθεμαι'),
            {'present':
                 {'passive':
                      {'ind':
                           {'sg':
                                {'pri': {'επιτίθεμαι'}, 'sec': {'επιτίθεσαι'}, 'ter': {'επιτίθεται'}},
                            'pl': {'pri': {'επιτιθέμεθα'}, 'sec': {'επιτίθεστε'}, 'ter': {'επιτίθενται'}}},
                       'imp':
                           {'sg': {'sec': {'επιτίθεσο'}}, 'pl': {'sec': {'επιτίθεσθε'}}}}},
             'conjunctive':
                 {'passive':
                      {'ind':
                           {'sg': {'pri': {'επιτεθώ'}, 'sec': {'επιτεθείς'}, 'ter': {'επιτεθεί'}},
                            'pl': {'pri': {'επιτεθούμε'}, 'sec': {'επιτεθείτε'}, 'ter': {'επιτεθούν', 'επιτεθούνε'}}},
                       'imp':
                           {'sg': {'sec': {''}}, 'pl': {'sec': {'επιτεθείτε'}}}}},
             'aorist':
                 {'passive': {'ind':
                                  {'sg': {'pri': {'επιτέθηκα'}, 'sec': {'επιτέθηκες'}, 'ter': {'επιτέθηκε'}},
                                   'pl': {'pri': {'επιτεθήκαμε'}, 'sec': {'επιτεθήκατε'},
                                          'ter': {'επιτεθήκανε', 'επιτέθηκαν'}}}}},
             'paratatikos': {'passive': {'ind':
                                             {'sg': {'pri': {'επιτιθέμην', 'επιτιθόμουν'},
                                                     'sec': {'επιτιθόσουν', 'επιτίθεσο'},
                                                     'ter': {'επιτίθετο', 'επετίθετο', 'επιτιθόταν'}},
                                              'pl': {'pri': {'επιτιθέμεθα', 'επιτιθόμασταν'},
                                                     'sec': {'επιτίθεσθε', 'επιτιθόσασταν'},
                                                     'ter': {'επιτίθεντο', 'επιτιθούνταν'}}}}},
             'passive_aorist_participle':
                 {'pl':
                      {'fem': {'gen': {'επιτεθεισών'}, 'nom': {'επιτεθείσες'}, 'acc': {'επιτεθείσες'},
                               'voc': {'επιτεθείσες'}},
                       'neut': {'gen': {'επιτεθέντων'}, 'nom': {'επιτεθέντα'}, 'acc': {'επιτεθέντα'},
                                'voc': {'επιτεθέντα'}},
                       'masc': {'gen': {'επιτεθέντων'}, 'nom': {'επιτεθέντες'}, 'acc': {'επιτεθέντες'},
                                'voc': {'επιτεθέντες'}}},
                  'sg': {'fem': {'gen': {'επιτεθείσας'}, 'nom': {'επιτεθείσα'}, 'acc': {'επιτεθείσα'},
                                 'voc': {'επιτεθείσα'}},
                         'neut': {'gen': {'επιτεθέντος'}, 'nom': {'επιτεθέν'}, 'acc': {'επιτεθέν'},
                                  'voc': {'επιτεθέν'}},
                         'masc': {'gen': {'επιτεθέντος'}, 'nom': {'επιτεθείς'}, 'acc': {'επιτεθέντα'},
                                  'voc': {'επιτεθείς'}}}},
             'pass_pres_participle':
                 {'pl':
                      {'fem': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενες'}, 'acc': {'επιτιθέμενες'},
                               'voc': {'επιτιθέμενες'}},
                       'neut': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενα'}, 'acc': {'επιτιθέμενα'},
                                'voc': {'επιτιθέμενα'}},
                       'masc': {'gen': {'επιτιθέμενων'}, 'nom': {'επιτιθέμενοι'}, 'acc': {'επιτιθέμενους'},
                                'voc': {'επιτιθέμενοι'}}},
                  'sg': {'fem': {'gen': {'επιτιθέμενης'}, 'nom': {'επιτιθέμενη'}, 'acc': {'επιτιθέμενη'},
                                 'voc': {'επιτιθέμενη'}},
                         'neut': {'gen': {'επιτιθέμενου'}, 'nom': {'επιτιθέμενο'}, 'acc': {'επιτιθέμενο'},
                                  'voc': {'επιτιθέμενο'}},
                         'masc': {'gen': {'επιτιθέμενου'}, 'nom': {'επιτιθέμενος'}, 'acc': {'επιτιθέμενο'},
                                  'voc': {'επιτιθέμενε'}}}}}

        )

    def test_verb_katexo(self):
        self.assertDictEqual(
            verb.create_all_forms('κατέχω'),
            {'present': {'active': {'ind': {'sg': {'pri': {'κατέχω'}, 'sec': {'κατέχεις'}, 'ter': {'κατέχει'}},
                                            'pl': {'pri': {'κατέχουμε'}, 'sec': {'κατέχετε'},
                                                   'ter': {'κατέχουνε', 'κατέχουν'}}},
                                    'imp': {'sg': {'sec': {'κάτεχε'}}, 'pl': {'sec': {'κατέχετε'}}}}, 'passive': {
                'ind': {'sg': {'pri': {'κατέχομαι'}, 'sec': {'κατέχεσαι'}, 'ter': {'κατέχεται'}},
                        'pl': {'pri': {'κατεχόμαστε'}, 'sec': {'κατέχεστε', 'κατεχόσαστε'}, 'ter': {'κατέχονται'}}},
                'imp': {'pl': {'sec': {'κατέχεστε'}}}}}, 'conjunctive': {'active': {
                'ind': {'sg': {'pri': {'κατάσχω'}, 'sec': {'κατάσχεις'}, 'ter': {'κατάσχει'}},
                        'pl': {'pri': {'κατάσχουμε'}, 'sec': {'κατάσχετε'}, 'ter': {'κατάσχουνε', 'κατάσχουν'}}},
                'imp': {'sg': {'sec': {'κάτασχε'}}, 'pl': {'sec': {'κατάσχετε'}}}}}, 'aorist': {'active': {
                'ind': {'sg': {'pri': {'κατείχα'}, 'sec': {'κατείχες'}, 'ter': {'κατείχε'}},
                        'pl': {'pri': {'κατείχαμε'}, 'sec': {'κατείχατε'}, 'ter': {'κατείχαν', 'κατείχανε'}}}}},
             'paratatikos': {'active': {'ind': {
                 'sg': {'pri': {'κατείχα', 'κάτεχα'}, 'sec': {'κάτεχες', 'κατείχες'}, 'ter': {'κατείχε', 'κάτεχε'}},
                 'pl': {'pri': {'κατέχαμε', 'κατείχαμε'}, 'sec': {'κατείχατε', 'κατέχατε'},
                        'ter': {'κατείχαν', 'κατείχανε', 'κατέχανε', 'κάτεχαν'}}}}, 'passive': {'ind': {
                 'sg': {'pri': {'κατεχόμουνα', 'κατεχόμουν'}, 'sec': {'κατεχόσουνα', 'κατεχόσουν'},
                        'ter': {'κατεχόταν', 'κατεχότανε'}},
                 'pl': {'pri': {'κατεχόμαστε', 'κατεχόμασταν'}, 'sec': {'κατεχόσασταν', 'κατεχόσαστε'},
                        'ter': {'κατεχόντουσαν', 'κατέχονταν'}}}}}, 'act_pres_participle': {'κατέχοντας'},
             'arch_act_pres_participle': {
                 'sg': {'masc': {'gen': {'κατέχοντος'}, 'voc': {'κατέχων'}, 'nom': {'κατέχων'}, 'acc': {'κατέχοντα'}},
                        'neut': {'gen': {'κατέχοντος'}, 'voc': {'κατέχον'}, 'nom': {'κατέχον'}, 'acc': {'κατέχον'}},
                        'fem': {'gen': {'κατέχουσας'}, 'voc': {'κατέχουσα'}, 'nom': {'κατέχουσα'},
                                'acc': {'κατέχουσα'}}}, 'pl': {
                     'masc': {'gen': {'κατεχόντων'}, 'voc': {'κατέχοντες'}, 'nom': {'κατέχοντες'},
                              'acc': {'κατέχοντες'}},
                     'neut': {'gen': {'κατεχόντων'}, 'voc': {'κατέχοντα'}, 'nom': {'κατέχοντα'}, 'acc': {'κατέχοντα'}},
                     'fem': {'gen': {'κατεχουσών'}, 'voc': {'κατέχουσες'}, 'nom': {'κατέχουσες'},
                             'acc': {'κατέχουσες'}}}}, 'pass_pres_participle': {'sg': {
                'masc': {'gen': {'κατεχόμενου'}, 'voc': {'κατεχόμενε'}, 'nom': {'κατεχόμενος'}, 'acc': {'κατεχόμενο'}},
                'neut': {'gen': {'κατεχόμενου'}, 'voc': {'κατεχόμενο'}, 'nom': {'κατεχόμενο'}, 'acc': {'κατεχόμενο'}},
                'fem': {'gen': {'κατεχόμενης'}, 'voc': {'κατεχόμενη'}, 'nom': {'κατεχόμενη'}, 'acc': {'κατεχόμενη'}}},
                'pl': {'masc': {'gen': {'κατεχόμενων'},
                                'voc': {'κατεχόμενοι'},
                                'nom': {'κατεχόμενοι'},
                                'acc': {
                                    'κατεχόμενους'}},
                       'neut': {'gen': {'κατεχόμενων'},
                                'voc': {'κατεχόμενα'},
                                'nom': {'κατεχόμενα'},
                                'acc': {'κατεχόμενα'}},
                       'fem': {'gen': {'κατεχόμενων'},
                               'voc': {'κατεχόμενες'},
                               'nom': {'κατεχόμενες'},
                               'acc': {
                                   'κατεχόμενες'}}}}}

        )

    def test_verb_paraeimai(self):
        self.assertDictEqual(
            verb.create_all_forms('παραείμαι'),
            {'present': {'active': {'ind': {'sg': {'pri': {'παραείμαι'}, 'sec': {'παραείσαι'}, 'ter': {'παραείναι'}},
                                            'pl': {'pri': {'παραείμαστε'}, 'sec': {'παραείστε', 'παραείσαστε'},
                                                   'ter': {'παραείναι'}}}, 'imp': {'nd': {'nd': {'παραόντας'}}}}},
             'conjunctive': {}, 'aorist': {}, 'paratatikos': {'active': {'ind': {
                'sg': {'pri': {'παραήμουν', 'παραήμουνα'}, 'sec': {'παραήσουνα', 'παραήσουν'},
                       'ter': {'παραήτανε', 'παραήταν'}},
                'pl': {'pri': {'παραήμαστε', 'παραήμασταν'}, 'sec': {'παραήσασταν', 'παραήσαστε'},
                       'ter': {'παραήτανε', 'παραήταν'}}}}}}

        )

    def test_verb_eimai(self):
        self.assertDictEqual(
            verb.create_all_forms('είμαι'),
            {'present': {'active': {'ind': {'sg': {'pri': {'είμαι'}, 'sec': {'είσαι'}, 'ter': {'είναι'}},
                                            'pl': {'pri': {'είμαστε'}, 'sec': {'είστε', 'είσαστε'}, 'ter': {'είναι'}}},
                                    'imp': {'sg': {'ter': {'έστω'}}}}}, 'conjunctive': {}, 'aorist': {},
             'paratatikos': {'active': {
                 'ind': {'sg': {'pri': {'ήμουν', 'ήμουνα'}, 'sec': {'ήσουν', 'ήσουνα'}, 'ter': {'ήταν', 'ήτανε'}},
                         'pl': {'pri': {'ήμασταν', 'ήμαστε'}, 'sec': {'ήσασταν', 'ήσαστε'},
                                'ter': {'ήταν', 'ήτανε'}}}}}, 'act_pres_participle': {'όντας'},
             'arch_act_pres_participle': {
                 'pl': {'neut': {'acc': {'όντα'}, 'nom': {'όντα'}, 'gen': {'όντων'}, 'voc': {'όντα'}},
                        'fem': {'acc': {'ούσες'}, 'nom': {'ούσες'}, 'gen': {'ουσών'}, 'voc': {'ούσες'}},
                        'masc': {'acc': {'όντες'}, 'nom': {'όντες'}, 'gen': {'όντων'}, 'voc': {'όντες'}}},
                 'sg': {'neut': {'acc': {'ον'}, 'nom': {'ον'}, 'gen': {'όντος'}, 'voc': {'ον'}},
                        'fem': {'acc': {'ούσα'}, 'nom': {'ούσα'}, 'gen': {'ούσας'}, 'voc': {'ούσα'}},
                        'masc': {'acc': {'όντα'}, 'nom': {'ων'}, 'gen': {'όντος'}, 'voc': {'ων'}}}}}

        )

    def test_verb_douleuw(self):
        self.maxDiff = None
        self.assertDictEqual(
            verb.create_all_forms('δουλεύω'),
            {'present':
                 {'active':
                      {'ind':
                           {'sg':
                                {'pri': {'δουλεύω'}, 'sec': {'δουλεύεις'}, 'ter': {'δουλεύει'}},
                            'pl':
                                {'pri': {'δουλεύουμε'}, 'sec': {'δουλεύετε'}, 'ter': {'δουλεύουν', 'δουλεύουνε'}}},
                       'imp':
                           {'sg': {'sec': {'δούλευε'}},
                            'pl': {'sec': {'δουλεύετε'}}}},
                  'passive':
                      {'ind':
                           {'sg':
                                {'pri': {'δουλεύομαι'}, 'sec': {'δουλεύεσαι'}, 'ter': {'δουλεύεται'}},
                            'pl':
                                {'pri': {'δουλευόμαστε'}, 'sec': {'δουλεύεστε', 'δουλευόσαστε'},
                                 'ter': {'δουλεύονται'}}},
                       'imp':
                           {'pl': {'sec': {'δουλεύεστε'}}}}},
             'conjunctive':
                 {'active':
                      {'ind':
                           {'sg':
                                {'pri': {'δουλέψω', 'δουλεύσω'},
                                 'sec': {'δουλεύσεις', 'δουλέψεις'},
                                 'ter': {'δουλέψει', 'δουλεύσει'}},
                            'pl':
                                {'pri': {'δουλέψουμε', 'δουλεύσουμε'},
                                 'sec': {'δουλεύσετε', 'δουλέψετε'},
                                 'ter': {'δουλέψουνε', 'δουλεύσουν', 'δουλέψουν', 'δουλεύσουνε'}}},
                       'imp':
                           {'sg':
                                {'sec': {'δούλεψε', 'δούλευσε'}},
                            'pl':
                                {'sec': {'δουλέψτε', 'δουλεύστε'}}}},
                  'passive':
                      {'ind':
                           {'sg':
                                {'pri': {'δουλευτώ'}, 'sec': {'δουλευτείς'}, 'ter': {'δουλευτεί'}},
                            'pl': {'pri': {'δουλευτούμε'}, 'sec': {'δουλευτείτε'},
                                   'ter': {'δουλευτούνε', 'δουλευτούν'}}},
                       'imp':
                           {'sg': {'sec': {'δουλέψου', 'δουλεύσου'}}, 'pl': {'sec': {'δουλευτείτε'}}}}},
             'aorist':
                 {'active':
                      {'ind':
                           {'sg':
                                {'pri': {'δούλευσα', 'δούλεψα'}, 'sec': {'δούλευσες', 'δούλεψες'},
                                 'ter': {'δούλεψε', 'δούλευσε'}},
                            'pl': {'pri': {'δουλεύσαμε', 'δουλέψαμε'}, 'sec': {'δουλεύσατε', 'δουλέψατε'},
                                   'ter': {'δούλευσαν', 'δουλεύσανε', 'δουλέψανε', 'δούλεψαν'}}}},
                  'passive': {'ind': {'sg':
                                          {'pri': {'δουλεύτηκα'}, 'sec': {'δουλεύτηκες'}, 'ter': {'δουλεύτηκε'}},
                                      'pl':
                                          {'pri': {'δουλευτήκαμε'}, 'sec': {'δουλευτήκατε'},
                                           'ter': {'δουλεύτηκαν', 'δουλευτήκανε'}}}}},
             'paratatikos':
                 {'active':
                      {'ind': {'sg': {'pri': {'δούλευα'}, 'sec': {'δούλευες'}, 'ter': {'δούλευε'}},
                               'pl': {'pri': {'δουλεύαμε'}, 'sec': {'δουλεύατε'}, 'ter': {'δουλεύανε', 'δούλευαν'}}}},
                  'passive': {'ind': {'sg':
                                          {'pri': {'δουλευόμουν', 'δουλευόμουνα'},
                                           'sec': {'δουλευόσουνα', 'δουλευόσουν'},
                                           'ter': {'δουλευόταν', 'δουλευότανε'}},
                                      'pl': {'pri': {'δουλευόμαστε', 'δουλευόμασταν'},
                                             'sec': {'δουλευόσασταν', 'δουλευόσαστε'},
                                             'ter': {'δουλευόντουσαν', 'δουλεύονταν'}}}}},
             'act_pres_participle': {'δουλεύοντας'},
             'active_aorist_participle': {'sg':
                                              {'fem':
                                                   {'acc': {'δουλεύσασα'}, 'voc': {'δουλεύσασα'},
                                                    'gen': {'δουλεύσασας'}, 'nom': {'δουλεύσασα'}},
                                               'neut':
                                                   {'acc': {'δουλεύσαν'}, 'voc': {'δουλεύσαν'}, 'gen': {'δουλεύσαντος'},
                                                    'nom': {'δουλεύσαν'}},
                                               'masc': {'acc': {'δουλεύσαντα'}, 'voc': {'δουλεύσας'},
                                                        'gen': {'δουλεύσαντος'}, 'nom': {'δουλεύσας'}}},
                                          'pl': {'fem': {'acc': {'δουλεύσασες'}, 'voc': {'δουλεύσασες'},
                                                         'gen': {'δουλευσασών'}, 'nom': {'δουλεύσασες'}},
                                                 'neut': {'acc': {'δουλεύσαντα'}, 'voc': {'δουλεύσαντα'},
                                                          'gen': {'δουλευσάντων'}, 'nom': {'δουλεύσαντα'}},
                                                 'masc': {'acc': {'δουλεύσαντες'}, 'voc': {'δουλεύσαντες'},
                                                          'gen': {'δουλευσάντων'}, 'nom': {'δουλεύσαντες'}}}},
             'passive_perfect_participle': {'sg': {
                 'fem': {'acc': {'δεδουλευμένη', 'δουλευμένη'}, 'voc': {'δεδουλευμένη', 'δουλευμένη'},
                         'gen': {'δεδουλευμένης', 'δουλευμένης'}, 'nom': {'δεδουλευμένη', 'δουλευμένη'}},
                 'neut': {'acc': {'δεδουλευμένο', 'δουλευμένο'}, 'voc': {'δεδουλευμένο', 'δουλευμένο'},
                          'gen': {'δουλευμένου', 'δεδουλευμένου'}, 'nom': {'δεδουλευμένο', 'δουλευμένο'}},
                 'masc': {'acc': {'δεδουλευμένο', 'δουλευμένο'}, 'voc': {'δουλευμένε', 'δεδουλευμένε'},
                          'gen': {'δουλευμένου', 'δεδουλευμένου'}, 'nom': {'δεδουλευμένος', 'δουλευμένος'}}},
                 'pl': {'fem': {'acc': {'δεδουλευμένες', 'δουλευμένες'},
                                'voc': {'δεδουλευμένες', 'δουλευμένες'},
                                'gen': {'δεδουλευμένων', 'δουλευμένων'},
                                'nom': {'δεδουλευμένες', 'δουλευμένες'}},
                        'neut': {'acc': {'δεδουλευμένα', 'δουλευμένα'},
                                 'voc': {'δεδουλευμένα', 'δουλευμένα'},
                                 'gen': {'δεδουλευμένων', 'δουλευμένων'},
                                 'nom': {'δεδουλευμένα', 'δουλευμένα'}},
                        'masc': {'acc': {'δεδουλευμένους', 'δουλευμένους'},
                                 'voc': {'δεδουλευμένοι', 'δουλευμένοι'},
                                 'gen': {'δεδουλευμένων', 'δουλευμένων'},
                                 'nom': {'δεδουλευμένοι', 'δουλευμένοι'}}}}}

        )
