quant = ['δύο', 'έξι', 'δέκα', 'ένας/μία/ένα', 'επτά', 'εφτά', 'οχτώ', 'δεκαεφτά', 'δεκαοχτώ', 'οκτώ', 'εκατόν', 'εκατό', 'εννέα', 'εννιά', 'μηδέν', 'πέντε',
         'τρεις/τρία', 'δεκάξι', 'δεκαέξι', 'δώδεκα', 'είκοσι', 'ένδεκα', 'έντεκα', 'εξήντα', 'ογδόντα', 'πενήντα', 'σαράντα', 'τριάντα', 'δεκαεπτά',
         'δεκαοκτώ', 'ενάμισης/μιάμιση/ενάμισι', 'ενενήντα', 'τέσσερις/τέσσερα', 'δεκαεννέα', 'δεκαεννιά', 'δεκαπέντε', 'δεκατρείς/δεκατρία', 'εβδομήντα', 'δεκατέσσερις/δεκατέσσερα']

quant_adj =['έκτος', 'διπλός', 'ένατος', 'όγδοος', 'πρώτος', 'πέμπτος', 'τρίτος', 'χίλιοι', 'δέκατος', 'έβδομος', 'εξαπλός',
            'τριπλός', 'δεκαπλός', 'δεύτερος', 'εικοστός', 'επταπλός', 'τέταρτος', 'διπλάσιος', 'δωδέκατος',
            'εκατοστός', 'ενδέκατος', 'εξηκοστός', 'πενταπλός', 'τετραπλός', 'χιλιοστός', 'εξαπλάσιος', 'τριακοστός',
            'τριπλάσιος', 'δεκαπλάσιος', 'ενενηκοστός', 'επταπλάσιος', 'ογδοηκοστός', 'διακοσιοστός', 'εβδομηκοστός',
            'εξακοσιοστός', 'πενταπλάσιος', 'τετραπλάσιος', 'εικοσαπλάσιος', 'ενδεκαπλάσιος', 'τεσσαρακοστός',
            'τριακοσιοστός', 'τετρακοσιοστός', 'εκατομμυριοστός', 'εκατονταπλάσιος']

quant_noun = ['δυάδα', 'εξάδα', 'δεκάδα', 'οκτάδα', 'τριάδα', 'μυριάδα', 'πεντάδα', 'τετράδα', 'χιλιάδα',
              'δωδεκάδα', 'εικοσάδα', 'εικοσαριά', 'εκατοντάδα', 'εκατομμύριο', 'δισεκατομμύριο', 'τρισεκατομμύριο',
              'τετρακισεκατομμύριο', 'πεντακισεκατομμύριο']

hundreds = ['διακόσια', 'τριακόσια', 'τετρακόσια', 'πεντακόσια', 'εξακόσια', 'εφτακόσια', 'οχτακόσια', 'εννιακόσια', 'χίλια']

alternative_syllables = {'οκτ': 'οχτ', 'επτ':'εφτ'}